{
 "items": [
  {
    "id": "2Otp500vQRSGffw1b_dkqw",
    "url": "https://remoteok.io/jobs/85136",
    "title": "Solutions Engineer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``5N( opportun,             2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Crisp",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 13, 2020 10:21:06 PM",
    "validThrough": "May 20, 2020 10:21:06 PM",
    "crawled": "May 13, 2020 11:05:19 PM",
    "content": "<span></span> <span><h4>Crisp</h4></span> <br> <h3>Solutions Engineer</h3> <div>  <div>   \\nHere at Crisp, we value the strength in teamwork, and strongly believe that it’s the key to Crisp’s success. By bringing together bright, motivated creators, wherever they live and work, we are leveraging humanity’s diversity of experience and background in order to understand the challenges facing our food supply, and solve them together. Come join us, and help build the type of business you’d like to be a part of.\\n\\nWe are a socially conscious, distributed team. We give you the opportunity to solve challenges in the global food industry while living where you’re most comfortable and working in areas where you can help foster and grow the community that you are a part of.\\n\\nWe believe in transparency, diversity, merit and fostering a culture of empowerment, personal impact and career growth.&nbsp; As a Solution Engineer you will be working closely with sales, engineering and customer success to ensure new customers are successful in our platform. Success in the role will require excellent communication skills as you will be both customer facing and working with our software engineers. Given that data is core to our customer success, the Solution Engineer will be responsible for getting customer data in and out of&nbsp; our platform. Part of your responsibilities will also be working hand in hand with engineering to prioritize, design and implement new data integrations. The role is highly technical in nature and the best candidates will have software development experience,experience with APIs and integrations and the ability to see the “bigger picture” on how Crisp can fit into the customer’s existing technology stack.\\n\\nSigns of a great candidate for Crisp\\n\\n\\n* Collaborative.&nbsp;You know that your colleagues’ perspectives will make our customers successful. Similarly, you use your strengths to help us grow together. You propose ways for us to be more engaged and successful with our customers.\\n\\n* Customer focused.&nbsp;Our customers are at the forefront of your day.&nbsp; You prioritize our customers’ voice to ensure their needs are met.&nbsp;\\n\\n* Ambitious, curious, and resourceful.&nbsp;You are innately curious, and you aren’t afraid to work hard. You are self driven, you take direction well but are able to be creative to find results on your own when asked. You are driven to succeed because your hard work and results make you proud.\\n\\n* Disciplined and reliable.&nbsp;&nbsp;We are a distributed company and you enjoy the benefits of working distributed while consistently delivering what you have committed to. When you hit a snag, you communicate and reset expectations early.\\n\\n* Appreciative of honest feedback.&nbsp;&nbsp;You know that the best way to learn and grow is through constructive feedback delivered kindly. You view feedback given to you as an opportunity to get better and strive to do the same for others.\\n\\n* Work smarter and harder.&nbsp;You often identify a problem, create a solution and bring it to a state of completion - with others, or even on your own.&nbsp; You find ways of eliminating or automating stuff that is uninteresting or wasteful.\\n\\n\\n\\n\\nCrisp’s Tech Stack\\n\\n\\n* Statically typed, modern languages.&nbsp;We use Kotlin, TypeScript and React for the UI, and GraphQL with Apollo to communicate with our backend. Knowledge of these specific technologies is not a requirement. If you’re willing to learn, we’re willing to help you along the way.\\n\\n* Continuous deployment.&nbsp;Code is never far from being deployed to production, because if it’s not in production, it’s not solving problems in the real world. Our branch time spans are short, and features under development are hidden behind feature flags.\\n\\n* Start-up mode.&nbsp;&nbsp;The team is still small, and the product is fresh.&nbsp; You’ll be able to exert a large amount of influence, and contribute to decisions that will determine the future of the product and the team.\\n\\n\\n\\n\\nSigns of a great candidate for Solution Engineer\\n\\n\\n* Software engineering background.&nbsp;You are able to understand and design technical data solutions and communicate those with the engineering team.&nbsp;\\n\\n* Ability to understand and manipulate data.&nbsp;You enjoy using tools like Excel, and have a strong background in data manipulation and interpretation and know what can and should be automated.\\n\\n* You thrive in ambiguity.&nbsp;You prefer when tasks clearly define the desired outcome rather than the specific steps required along the way. You enjoy innovating on a concept during development.&nbsp;\\n\\n* You are an active communicator.&nbsp;You are interested in working cross functionally with sales, customer success and engineering. You enjoy working collaboratively with others to find new solutions to problems.\\n\\n* Passion for eliminating waste in the food supply chain.&nbsp;You are excited to work with innovative food companies to eliminate food waste.&nbsp;\\n\\n* Committed to customer success.&nbsp;You are passionate about our customer’s success and will act as a sales gatekeeper to ensure we are only closing deals where our product can deliver value for the customer.\\n\\n\\n\\n\\nWe are building a team of product people with a breadth of combined experiences so that we can collaboratively enable our customers to be successful. There are no hard requirements on specific background, experience or geographical location. Instead we’re looking for individuals that are capable, reliable, and hoping to grow along with us. Do you have strengths you can share? If so, we’d love to hear from you!   <span>yagJzhkdapAsCMnUw7CpJAMi</span>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "uzNZiTP8RhmDllAHg4UioA",
    "url": "https://jobmote.com/job/5013373/remote-azure-architect/",
    "title": "Remote Azure Architect",
    "tags": [
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "VirtualVocations",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 8, 2020 2:35:24 AM",
    "validThrough": "May 11, 2020 2:35:24 AM",
    "crawled": "May 8, 2020 3:05:15 AM",
    "content": "<div>A technology company is seeking a Remote Azure Architect. Candidates will be responsible for the following: Architecting an Azure solution that migrates their monolithic Microsoft-based application to the Azure Working on release pipelines, automation and Infrastructure as Code Qualifications Include: Limited travel to the client's office in Santa Ana, CA (likely 1-2 times over the next 6 months) Minimum of 5 years of experience working with Azure is required Experience in supporting release pipelines with tools like Jenkins Demonstrated experience in a DevOps role Strong understanding of Terraform, CloudFormation or other Infrastructure as Code solutions Experience with Docker, Kubernetes, and/or AKS<p>SDL2017</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kbhL77eNTaedNVSfnSbF1A",
    "url": "https://weworkremotely.com/remote-jobs/funnelenvy-growth-marketer-for-new-martech-solution",
    "title": "FunnelEnvy: Growth Marketer for New Martech Solution",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "FunnelEnvy",
      "sameAs": "https://www.funnelenvy.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 5, 2020 8:29:25 AM",
    "validThrough": "May 12, 2020 8:29:25 AM",
    "crawled": "May 5, 2020 9:05:11 AM",
    "content": "<h3> Growth Marketer for New Martech Solution </h3><div><div>&nbsp;</div><div>FunnelEnvy is looking for an analytical and creative Growth Marketer to launch a new martech solution to drive better attribution and personalization capabilities for SaaS and growth companies. You will be responsible for driving our go to market product, content and campaign strategy in partnership with the leadership team.<br><br><br></div><div><strong>Who We’re Looking For</strong><br><br>Ideal candidates should be driven self-starters who are excited to be a part of a team leading the way in data-driven personalization and passionate about driving results in a fast paced startup. <br><br><strong>Responsibilities Include</strong></div><ul><li>Create, execute, and manage FunnelEnvy’s go to market plan for launching our new self-service SaaS product.</li><li>Define the content strategy to support the successful launch and growth of the solution in our target markets.</li><li>Generate all the content and branding in support of the new product launch. Responsibilities including branding, website content, use cases, blogs, support content, marketing and sales materials, and social and campaign content.</li><li>Define the website strategy for the new product offering and manage the website presence. Recommend the user sign-up and activation funnels to encourage easy signup, activation, and value creation from this new service.&nbsp;</li><li>Conceive and execute the inbound and outbound marketing programs that will create awareness and generate quality leads that meet/exceed our quarterly sales targets.</li><li>Test multiple marketing channels concurrently and establish key acquisition metrics and identify top performing channel(s) based on acquisition cost, lead quality and conversion rate.</li><li>Execute on additional marketing projects and initiatives as needed to support FunnelEnvy’s broader growth and demand generation goals.</li></ul><div><strong>Key competencies to be successful at this position.</strong></div><ul><li><strong>5+ years of experience</strong> successfully driving growth and demand programs and initiatives, ideally for a b2b/martech software startup.</li><li>Experience managing and executing on a brand’s content strategy including content for the website, blog (own/industry), and social media accounts.</li><li>Strong copywriting experience in B2B enterprise software category with assets like blog posts, ebooks, case studies, and presentations.</li><li>Experience with optimizing the digital experience of end users using growth and CRO best practices for both user acquisition and product activation.</li><li>History of efficiently and effectively managing multiple campaigns across multiple marketing platforms (Facebook, Linkedin, Twitter, Google Ads, Adroll, etc).</li><li>Takes a data driven approach to marketing campaigns with an ability to structure and process qualitative or quantitative data and draw insightful ROI conclusions from it.</li><li>Ability to research and identify top prospects in a market and use the latest discovery and data enrichment tools to create targeted prospect lists.</li><li>Hands on experience with running outbound marketing campaigns using platforms like Marketo, Hubspot, Outreach.IO, etc. and how to integrate campaign data with Salesforce.</li><li>Ability to manage contractors and agencies as needed to execute on a given task in scope, on time and on budget.</li><li>Prior experience in graphics and design a plus.</li></ul><div><strong>The things that we absolutely need in a candidate<br></strong><br><strong>Excellent communication skills</strong> – Speaks and writes clearly and articulately. Maintains this standard in all forms of written communication, including email.<br><br><br></div><div><strong>Resourceful problem solver</strong> – We don’t have all the answers, so we are looking to you to help figure out the best way forward with our marketing programs and strategy. Trial and error will be part of the process.<br><br><br></div><div><strong>Organization &amp; planning</strong> – Plans, organizes, schedules, and budgets in an efficient, productive manner. Focuses on key priorities and outcomes.<br><br><br></div><div><strong>Team-Oriented &amp; collaborative</strong> – Marketing and sales are team sports at FunnelEnvy.<br><br><br></div><div><strong>Willingness to roll up your sleeves</strong> – Need the ability to thrive in a fast-paced, high-growth environment<strong>. </strong>We have a small (but rapidly growing) operation, so this isn’t a role for professional managers.<br><br><br></div><div><strong>Passion for learning new things</strong> – We hit a relatively broad base of skill sets in our work, so if you just want to focus on the one thing you do well then this might not be the position for you. Ideally you’ll be able to teach us things as well.<br><br><br></div><div><strong>Willingness to take (calculated) risks</strong> – We’re an entrepreneurial firm and absolutely encourage intelligent risk taking.<br><br><br></div><div><strong>Value evidence over opinion</strong> – At FunnelEnvy it’s far less important to be right than it is to get it right.<br><br><br></div><div><strong>Genuine enthusiasm for the problems we’re solving</strong> – Life is too short to do anything you’re not excited about.<br><br><strong>Why FunnelEnvy?<br></strong><br>You probably have a lot of options, so why work with us?<br><br><br></div><div><strong>Work on innovative marketing technology</strong>&nbsp; - We’re pushing boundaries with machine learning, big data and serverless to deliver real-time experiences on the web.</div><div>&nbsp;</div><div><strong>Small, entrepreneurial culture</strong> - We’re small, with limited bureaucracy or overhead.</div><div>&nbsp;</div><div><strong>Flexible location</strong> - We’re a fully distributed team looking for the best person for the job who can get it done without being chained to a desk.</div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "q_VmKkxlTIqnSCCB_ULAXw",
    "url": "https://remote.co/job/patient-success-advocate-2/",
    "title": "Patient Success Advocate",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Cedar Cares",
      "sameAs": "https://www.cedar.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 4, 2020 4:14:42 PM",
    "validThrough": "May 11, 2020 4:14:42 PM",
    "crawled": "May 4, 2020 5:06:05 PM",
    "content": "<div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p>Remote</p><p><strong>The Role</strong></p><p>At Cedar, our mission is to improve the broken healthcare experience for patients, this starts with reengineering the patient billing support experience by refocusing our efforts on a patient-centric experience and providing exceptional customer service. The&nbsp;3 Month Contract&nbsp;Patient Advocate position serves as the liaison between the patient and healthcare provider supporting our patients through the following channels: live chat, phone, and email communications. In addition, patient advocates act as account managers to holistically manage the medical billing process and anticipate potential billing issues. We believe that all patients deserve to have a pleasant and efficient healthcare billing experience.</p><p><strong>Responsibilities</strong></p><ul><li>Utilize the Cedar platform to handle all patient questions via inbound chats, phone calls and perform appropriate outbound call campaign</li><li>Manage and follow through on escalations to the healthcare provider</li><li>Manage the payment posting process and follow up on defaulted payments</li><li>Appropriately follow up with insurance and other third parties</li></ul><p><strong>Skills and Experience</strong></p><ul><li>1-2 years of insurance billing experience</li><li>Experience navigating electronic medical record systems (preferably Centricity Business)</li><li>Ability to toggle between multiple systems and efficient typing skills</li><li>Excellent verbal and written communication skills</li><li>Self motivated individual with exceptional attention to detail</li><li>Ability to show empathy and passion for exceptional customer service</li><li>Excellent problem solving and critical thinking skills</li><li>Open to ambiguity and ever changing environment</li><li>We’re looking for someone willing to be flexible with their schedule from time to time</li><li>This position is currently remote – having access to a nice private space is a must</li></ul><p><strong>What do we offer to the ideal candidate?</strong></p><p>Joining the Cedar team allows you to not only work on solving a problem that affects millions of patients annually, but also offers the following:</p><ul><li>An opportunity to work in a creative environment on a daily basis</li><li>Competitive pay</li><li>An opportunity to work with a smart and engaging team tackling a real world problem</li><li>A chance to join a high-growth company in an early stage</li><li>An ability to grow and take on more responsibility within our company</li><li>Interaction with multiple departments within our company</li></ul><p><strong>Changing the way patients interact with healthcare</strong></p><p>Cedar is improving the healthcare financial experience. We partner with the most important institutions in the healthcare space that are vital to the care provided in our communities. Our technology enables these providers to ensure that they can continue to be profitable in a rapidly changing environment so they can provide care to the patients that depend on them. We allow patients to understand the cost of their healthcare and have a flawless experience when trying to afford and manage their healthcare needs.</p><p>Based in New York City, we’re backed by some of the best investors in New York and Silicon Valley including Thrive Capital and Founders Fund.</p><p>If creating a better healthcare experience excites you, we encourage you to apply.</p>        </div><div>        <a href='https://www.cedar.com/careers/view/?gh_jid=2167549' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OFTFPJUmTtu-M1d5Ehon3w",
    "url": "https://news.ycombinator.com/item?id=23066756",
    "title": "æternity blockchain | Developer Advocate | Remote | https://angel.co/company/aeternity ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 4, 2020 1:34:39 PM",
    "validThrough": "May 11, 2020 1:34:39 PM",
    "crawled": "May 4, 2020 2:06:07 PM",
    "content": "æternity blockchain | Developer Advocate | Remote | <a href='https://angel.co/company/aeternity-blockchain/jobs/712107-developer-advocate' rel='nofollow'>https://angel.co/company/aeternity-blockchain/jobs/712107-de...</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Mnpd6Q8tQFS8gkY27AOahQ",
    "url": "https://remoteok.io/jobs/84944",
    "title": "Cloud Architect",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=4, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Blue Orange Digital",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 2, 2020 5:51:28 AM",
    "validThrough": "May 9, 2020 5:51:28 AM",
    "crawled": "May 2, 2020 6:05:51 AM",
    "content": "<span></span> <span><h4>Blue Orange Digital</h4></span> <br> <h3>Cloud Architect</h3> <div>  <div>   \\n*This is a fully remote position for candidates in South and Latin America*\\n\\nResponsibilities\\n\\n\\n* Design and implement end-to-end data solutions (storage, integration, processing, visualization) in Azure\\n\\n* Design and implement database solutions in Azure SQL Data Warehouse, Azure SQL\\n\\n* Migrate data from traditional database systems (such as Teradata) to Azure databases\\n\\n* Implement ad-hoc analysis solutions using Azure Data Lake Analytics/Store, HDInsight\\n\\n* Architect and implement ETL and data movement solutions using Azure Data Factory, SSIS\\n\\n* Design and develop data visualizations in Power BI\\n\\n* Prepare documentation and architectural designs\\n\\n* Propose architectures that consider cost/spend in Azure and develop recommendations to right-size Azure data infrastructure\\n\\n* Design &amp; implement data security and governance policies and standards\\n\\n\\n\\n\\n\\n\\nQualifications\\n\\n\\n* Bachelor's degree in Computer Science, Software Engineering, or equivalent combination of education and experience.\\n\\n* 3-5 years-experience with Azure storage solutions such as Azure Storage, Azure Storage Disks, and Azure Files\\n\\n* 3-5 years-experience with Azure data solutions such as Azure SQL, SQL Data Warehouse, Data Lake Analytics/Store, HDInsight\\n\\n* 1-3 years-experience with tools such as Databricks, Snowflake, etc.\\n\\n* BA/BS degree in Computer Science or a related technical field, or equivalent practical experience.\\n\\n* 3-5 years-experience in Python with an excellent understanding of computer science fundamentals, complex data structure, data processing, data quality, data lifecycle, and algorithms.\\n\\n* Enjoys collaborating with other engineers on architecture and sharing designs with the team\\n\\n* Excellent verbal and written English communication.\\n\\n* Interacts with others using sound judgment, good humor, and consistent fairness in a fast-paced environment\\n\\n\\n\\n\\nPreferred Qualifications\\n\\n\\n* Basic understanding of/experience with streaming solutions such as Kafka and Azure Stream Analytics\\n\\n* Solid understanding of/experience with Microsoft SQL Server and related technologies\\n\\n* Basic understanding of Azure solutions outside of the Azure storage and data platforms\\n\\n* Basic understanding of Azure non-relational data solutions such as Azure Cosmos D\\n\\n* Good understanding of data security and governance standard\\n\\n* Basic understanding of AI/ML approaches leveraging data on Azure\\n\\n\\n  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "qA2n71PmTAW-T9UL_oBmgQ",
    "url": "https://news.ycombinator.com/item?id=23045849",
    "title": "HP Inc | DevOps | REMOTE (UK) | FT Contract HP’s Graphics Solutions Business (GSB) works to ...",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 9:50:27 PM",
    "validThrough": "May 8, 2020 9:50:27 PM",
    "crawled": "May 1, 2020 11:06:01 PM",
    "content": "HP Inc | DevOps | REMOTE (UK) | FT Contract<p>HP’s Graphics Solutions Business (GSB) works to deliver large scale cloud solutions that manage the production workflow for print shops around the world.  GSB helps Print Service Providers streamline the manufacture of books, business cards, packaging, photos, posters, signage and almost anything else that can be printed.</p><p>On a technical level it’s an AWS / Kubernetes shop with an emphasis on Terraform &amp; Helm for config-managing all of the things.  Workloads range from maintaining a huge throughput of batch processing jobs to large databases and the API layers that front them.</p><p>We’re looking for a senior, UK-based devops engineer to help maintain and develop the platform.  You’ll need to demonstrate experience building software as well as infrastructure (there’s a ‘dev’ in devops!), excellent communication skills, a strong interest in keeping things secure and a near-obsessive level of attention to detail.</p><p>UK working hours &amp; remote is fine so long as you can visit the London office a couple of days a month.</p><p>CVs to hn-2020-05@mbird.biz.  No agencies please.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "KdlSYYRqTGuyGaa62eJ68A",
    "url": "https://news.ycombinator.com/item?id=23044150",
    "title": "Forestry.io (https://forestry.io) | Solutions Engineer, Developer Relations Lead | Remote (UTC  ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 7:04:38 PM",
    "validThrough": "May 8, 2020 7:04:38 PM",
    "crawled": "May 1, 2020 8:06:04 PM",
    "content": "Forestry.io (<a href='https://forestry.io' rel='nofollow'>https://forestry.io</a>) | Solutions Engineer, Developer Relations Lead | Remote (UTC -8 to UTC -3) | Full-Time<p>--- About Us</p><p>Forestry.io is on a mission to help people build a better web. We’re building a Git-backed content management system (CMS) and an open source site-editing toolkit (TinaCMS) -both focused on the JAMstack.</p><p>We're a small, growing company (17 people) and are proud of our remote-first, people-centric culture. Read more about that here: <a href='https://forestry.io/careers' rel='nofollow'>https://forestry.io/careers</a></p><p>--- Role Details &amp; How to Apply</p><p>Solutions Engineer : <a href='https://forestry.io/job-openings/solutions-engineer/' rel='nofollow'>https://forestry.io/job-openings/solutions-engineer/</a></p><p>To apply for this role, please fill out the application form on this page.</p><p>Developer Relations Lead :</p><p>We are still working on a formal job description, however we're essentially looking for a player/coach to help create our developer relations function at Forestry with the primary goal of raising awareness of TinaCMS (<a href='https://tinacms.org' rel='nofollow'>https://tinacms.org</a>). To apply for this role, please send an email &amp; resume to careers@forestry.io and mention this post in the subject.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2dcOBgLERey3zU_4Zx52Gg",
    "url": "https://www.remoteage.com/remote-jobs/cloud-solutions-architect-68/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-solutions-architect-68",
    "title": "Cloud Solutions Architect",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 29, 2020 10:39:04 AM",
    "validThrough": "May 6, 2020 10:39:04 AM",
    "crawled": "Apr 29, 2020 11:06:08 AM",
    "content": "<h3>            Cloud Solutions Architect        </h3><div>United States, Arizona</div><div>Company: Kforce Technology<p></p></div><div>                    <h4>Overview</h4>                    <p><strong>RESPONSIBILITIES:</strong></p><p>Kforce has a client, a growing company in the Phoenix, AZ area is seeking a Cloud Solution Architect. We are working directly with the Hiring Manager. This role is currently 100% remote and will switch back to office environment when COVID-19 ramps down. Responsibilities: </p><ul><li> Create product and technology designs to determine future state architectural vision and modernization efforts to meet business goals and growth projections</li><li> Provide architectural guidance to teams in an effort to build scalable and maintainable cloud solutions, adhere to a technology roadmap, and minimize technical debt</li><li> Participates in product development activities such as architecture, design, prototyping, implementation and review</li><li> Guide teams through cloud platform migration</li><li> Utilize skills and experience in successful decomposition of existing software systems for re-design with cloud native patterns</li><li> Work with peers to build designs supporting accelerated paths for new products to market</li><li> Support business and development process using Lean Architecture and Agile methodologies</li><li> Evaluate and work with third party software vendors to determine feasibility of incorporation of products into Lighthouse products and solutions</li><li> Aid product teams in design reviews to ensure the architecture is scalable and consistent with overall architectural vision</li><li> Contribute to team learning activities such as lunch and learn sessions, workshops, and other activities to empower development teams to understand and follow cloud standards &amp; best practices</li><li> Build and run team learning activities such as lunch and learn, coding exercises and samples, and other activities to better the development teams</li><li> Serve as a mentor to less experienced team members</li><li> Proactively raises awareness and participate in development of standards, best practices, guidelines, and processes that can benefit the development organization</li></ul><p><b>Job Requirements:</b></p><p><strong>REQUIREMENTS:</strong></p><ul><li> B.S. in Computer Science/Engineering/Mathematics or equivalent work experience.</li><li> 7-10+ years of professional software experience.</li><li> 4-6+ years of architectural experience designing and integration large scale applications.</li><li> Exemplary software system architecture and design skills.</li><li> Experience with containerization and designing cloud platforms.</li><li> Experience with AWS or Azure or GPC</li><li> Experience in design of microservice and general service oriented architectures.</li><li> Experience with Big Data environments including, but not limited to Data pipelines, Data Warehouse, Non-Relational data stores, and Analytics.</li><li> The ability to work in a collaborative and fast past agile environment to evangelize best practices and clean architectures.</li><li> Strong with understanding and utilization of SOLID and other software design principles.</li><li> Familiarity with technology compliance standards such as Soc-2, PCI, OWASP is a plus.</li><li> Be able to lead development teams with DevOps initiatives such as Automation and Continuous Integration.</li><li> Experience in system decomposition practices such as Event Storming is preferred.</li><li> Ability to communicate technical concepts to technical and non-technical audiences.</li><li> Excellent written and verbal communication skills</li></ul><p></p>                                                <div>                            <a href='https://www.jobg8.com/Traffic.aspx?PqrVm2oR6hw3jmF4AbJqqgq' rel='nofollow'>Apply for job</a>                    </div>                                    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "o6uIt4LPS2yjJi-74vvsEQ",
    "url": "https://www.indeed.co.uk/viewjob?t=Data+Warehouse+Developer&jk=bc7d232939d6df37&",
    "title": "Data Warehouse Developer - Newport - Opus Recruitment Solutions - Newport",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Opus Recruitment Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 10:30:19 AM",
    "validThrough": "May 5, 2020 10:30:19 AM",
    "crawled": "Apr 29, 2020 2:05:14 AM",
    "content": "<div><div><b>Data Warehouse Developer - £45,000 - Newport</b><br>An exciting opportunity for a Data Warehouse Developer to join a fast growing financial services company in Newport.<br><b>Skill Experiences</b><br><ul><li><b>SQL</b></li><li><b>ETL</b></li><li><b>SSRS / SSIS / SSAS</b></li><li><b>Azure or AWS</b></li><li><b>NoSQL (MongoDB or Cassandra)</b></li><li><b>Experience configuring and interrogating CRM Dynamics or Salesforce systems</b></li></ul><b>Benefits</b><br><ul><li><b>Remote working</b></li><li><b>Flexible hours</b></li><li><b>Life assurance</b></li><li><b>Private health care</b></li><li><b>Free parking</b></li></ul>Interviews are taking place from 11th May remotely and successful candidates will be started remotely.<br>Please APPLY for more information on the role or call Samuel Barcia on 01179107984<br><b>Data Warehouse Developer - £45,000 - Newport</b></div></div><div><div><div><span></span></div><span>Newport</span></div><div><div><span></span></div><span>Permanent</span></div><div><div><span></span></div><span>£43,000 - £48,000 a year</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ExoRR8S9SbqYKlxVsxbyGQ",
    "url": "https://remote.co/job/patient-success-advocate/",
    "title": "Patient Success Advocate",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Cedar",
      "sameAs": "https://www.cedar.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:41:51 PM",
    "validThrough": "May 5, 2020 3:41:51 PM",
    "crawled": "Apr 28, 2020 4:06:05 PM",
    "content": "<div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p>Remote</p><p><strong>The Role</strong></p><p>At Cedar, our mission is to improve the broken healthcare experience for patients, this starts with reengineering the patient billing support experience by refocusing our efforts on a patient-centric experience and providing exceptional customer service. The&nbsp;3 Month Contract&nbsp;Patient Advocate position serves as the liaison between the patient and healthcare provider supporting our patients through the following channels: live chat, phone, and email communications. In addition, patient advocates act as account managers to holistically manage the medical billing process and anticipate potential billing issues. We believe that all patients deserve to have a pleasant and efficient healthcare billing experience.</p><p><strong>Responsibilities</strong></p><ul><li>Utilize the Cedar platform to handle all patient questions via inbound chats, phone calls and perform appropriate outbound call campaign</li><li>Manage and follow through on escalations to the healthcare provider</li><li>Manage the payment posting process and follow up on defaulted payments</li><li>Appropriately follow up with insurance and other third parties</li></ul><p><strong>Skills and Experience</strong></p><ul><li>1-2 years of insurance billing experience</li><li>Experience navigating electronic medical record systems (preferably Centricity Business)</li><li>Ability to toggle between multiple systems and efficient typing skills</li><li>Excellent verbal and written communication skills</li><li>Self motivated individual with exceptional attention to detail</li><li>Ability to show empathy and passion for exceptional customer service</li><li>Excellent problem solving and critical thinking skills</li><li>Open to ambiguity and ever changing environment</li><li>We’re looking for someone willing to be flexible with their schedule from time to time</li><li>This position is currently remote – having access to a nice private space is a must</li></ul><p><strong>What do we offer to the ideal candidate?</strong></p><p>Joining the Cedar team allows you to not only work on solving a problem that affects millions of patients annually, but also offers the following:</p><ul><li>An opportunity to work in a creative environment on a daily basis</li><li>Competitive pay</li><li>An opportunity to work with a smart and engaging team tackling a real world problem</li><li>A chance to join a high-growth company in an early stage</li><li>An ability to grow and take on more responsibility within our company</li><li>Interaction with multiple departments within our company</li></ul><p><strong>Changing the way patients interact with healthcare</strong></p><p>Cedar is improving the healthcare financial experience. We partner with the most important institutions in the healthcare space that are vital to the care provided in our communities. Our technology enables these providers to ensure that they can continue to be profitable in a rapidly changing environment so they can provide care to the patients that depend on them. We allow patients to understand the cost of their healthcare and have a flawless experience when trying to afford and manage their healthcare needs.</p><p>Based in New York City, we’re backed by some of the best investors in New York and Silicon Valley including Thrive Capital and Founders Fund.</p><p>If creating a better healthcare experience excites you, we encourage you to apply.</p>        </div><div>        <a href='https://www.cedar.com/careers/view/?gh_jid=2167549' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xLO_WLaGSIKPDiJmVLYH8g",
    "url": "https://stackoverflow.com/jobs/371395/senior-software-solutions-developer-chainbridge-technologies?a=20ymYxcGFhDO&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Software Solutions Developer at Chainbridge Technologies (Vienna, VA) ",
    "tags": [
      "DBG:surround``2N(remot,work) 3W OR(encourag, avail, environ)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:asp.net-mvc/dotnet/16",
      "DBG_TECH1:k/t/w:asp.net-web-api/dotnet/8",
      "DBG_TECH1:k/t/w:asp.net/dotnet/16",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:knockout.js/frontend/8",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:k/t/w:twitter-bootstrap/frontend/8",
      "DBG_TECH1:k/t/w:visual-studio/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=59, c=4, mobile=4, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=43}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "dotnet",
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Chainbridge Technologies – Vienna, VA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Senior Software Solutions Developer</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Lead, Manager</span>                                </div>                        </div>                </div>            <div>Company: Chainbridge Technologies – Vienna, VA<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-05:00) Eastern Time </span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Vienna, VA.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>c#</div><div>asp.net-mvc</div><div>asp.net-web-api</div>            <h4>Job description</h4>            <div><p>We are seeking a Senior Solutions Developer&nbsp;for&nbsp;<strong><em>immediate hire</em></strong>. This position will work in a leadership role, but will report to the Technical Lead.&nbsp; This position is contingent upon contract award and funding.&nbsp; Contract award is scheduled for late March 2020.&nbsp; This position will require the ability to obtain a Public Trust Clearance.&nbsp; To be considered, you must include your full address, phone number, and current email on your resume.</p><p><strong>Due to current Government Contract Requirements: ONLY US CITIZENS CAN BE CONSIDERED</strong>. Unfortunately, NON-CITIZENS, including Green Card Holders, will not be reviewed.&nbsp;</p><p><strong>Remote</strong>&nbsp;work&nbsp;<strong>IS</strong>&nbsp;available for this position for qualified candidates; however,&nbsp;<strong>candidates must reside within the continental US</strong>&nbsp;and work<strong>&nbsp;during Eastern Standard Time business hours</strong>.&nbsp;&nbsp;</p><p>We would like to talk with you if you have:</p><ul><li>8-10 years of experience</li><li>Knowledge of system architecture and database entities, but also design and UI/UX best practices&nbsp;</li><li>Demonstrated the ability to detail high-level product specifications and design documents.</li><li>Proven experience collaborating with various stakeholders to determine software requirements.</li><li>A solid understanding of a variety of programming tools and development platforms.</li><li>Previous management/team leadership experience.</li><li>The ability to ramp up and understand the project mission&nbsp;in a very short amount of time.</li><li>Experience troubleshooting and resolving issues with coding or design.</li><li>The ability to mentor and lead more junior staff.</li><li>Excellent communications skills with all levels of personnel.</li><li>Organizational skills to ensure that your team adheres to development schedules and deadlines.</li></ul><p><strong>Technical requirements needed:</strong></p><ul><li>ASP.NET MVC; ASP.NET CORE</li><li>Web Services: SOAP/JSON/REST</li><li>HTML5 and C#</li><li>&quot;Modern&quot; Javascript&nbsp;&nbsp;</li><li>Microsoft SQL server</li><li>Visual Studio</li><li>Frameworks such as jQuery, Knockout, Bootstrap, Angular,&nbsp;Aurelia, or Durandal</li></ul><p><strong>Technical skills that are a plus:</strong></p><ul><li>Experience using ORMs such as Entity Framework</li><li>Experience with CI/CD pipelines</li><li>Experience using unit testing frameworks such as Microsoft Unit Test Framework or NUnit</li><li>iOS or Android development</li><li>Microsoft Azure</li><li>GIS (Bing or Google Maps)</li></ul><p>The interview process includes both oral and written components. The written&nbsp;component is an online skills test and is taken before the oral interview process begins. Candidates scoring less than 75% will not be contacted for an interview.&nbsp;</p><p>Chainbridge Technologies is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law.</p>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/371395?reset=False&amp;ra=20ymYxcGFhDO&amp;oqs=a%3D20ymYxcGFhDO%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Chainbridge Technologies</h4>            <div><p>We are a small, tight-knit IT company based just outside of Washington DC.&nbsp; Chainbridge Technologies is&nbsp;the leader in developing&nbsp;custom emergency response systems&nbsp;for&nbsp;private and federal customers.&nbsp; We are seeking passionate developers who want to make a difference- if this sounds like your next career, we want to hear from you!&nbsp;</p><p>&nbsp;Chainbridge Technologies is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law.</p>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "v9-zDcxfRxKrm048r3bfGg",
    "url": "https://stackoverflow.com/jobs/387418/developer-advocate-jack-henry-associates-inc?a=25Vx9ZfDNeFi&so_medium=Talent&so_source=TalentApi",
    "title": "Developer Advocate at Jack Henry & Associates, Inc.®  ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG_TECH1:k/t/w:android/java/2",
      "DBG_TECH1:k/t/w:android/mobile/4",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=4, java=2, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Jack Henry & Associates, Inc.® – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 100000,
      "maxValue": 145000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 100k - 145k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Developer Advocate</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer, Mobile Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Banking, Financial Technology, Software Development / Engineering</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>5k–10k people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Public</span>                                </div>                        </div>                </div>            <div>Company: Jack Henry &amp; Associates, Inc.® – No office location<br></div><h4>Technologies</h4><div>ios</div><div>android</div><div>web-component</div><div>api</div>            <h4>Job description</h4>            <div><p>Banno is redefining the relationship between forward-thinking financial institutions and their customers. Banno leverages bleeding edge technology and an industry leading product vision to make user-friendly mobile and web apps. We build front end applications natively in both Android and iOS as well as using modern web components.</p><p><strong>About You</strong></p><p>You are infinitely curious and thrive in an environment where you are constantly learning and growing. You want to be somewhere that you are trusted and set up for success every day. You want to be somewhere that surrounds you with other great engineers that drive you to be better everyday.</p><p>Although you work with multiple teams you are self motivated and able to work with independence. You have experienced good developer experiences and poor developer experiences.&nbsp; You have an itch to make a great developer experience. You care deeply about your work, your teams, and the end user.</p><p>Banno values trust and those with a bias towards action. We have a remote-first culture that challenges you each day and supports your growth. We are confident you will love it here.</p><p><strong>What you are working on</strong></p><p>In short, you'll be advocating for the needs of developers whether they are 3rd party developers or internal engineers.The Developer Advocate is the primary public interface for evangelizing Banno’s API, developer toolkit, and plugin ecosystem while assisting outside developers in building new and interesting products with Banno.</p><p>The Developer Advocate is constantly creating new proof of concept projects to demonstrate inventive new things to do with Banno’s API. The Developer Advocate publicly discusses Banno’s API on social media as well as presents at conferences. The Developer Advocate writes technical guides, tutorials, and reference docs for <a href='https://jackhenry.dev' rel='nofollow'>https://jackhenry.dev</a>.</p><p><strong>About the Banno team</strong></p><p>We are committed to creativity, thoughtfulness, culture, and openness—the perfect place to make phenomenal products that have a big impact. Our work environment echoes a modern tech startup but we have the security and benefits of a large, publicly traded company. With an engineering team of over 100, we place a high value on continued education and also contribute to--and use--open source projects.</p><p>Our team is distributed and that means you can live and work wherever you want within the US. You’ll get the chance to choose your own tools, work with bleeding edge web technologies across the stack and contribute to products that are used by millions of people.</p><p>Travel of up to 25% may be required for company meetings, professional development, and public speaking at conferences.</p><p>Must be U.S. based.</p><p><strong>Minimum Qualifications</strong></p><ul><li>Minimum 6 years of programming experience.</li><li>Experience with one of these modern JavaScript frameworks; Angular, React, Vue, or Polymer.</li><li>Must have experience presenting at a conference, industry group or local development groups.</li><li>Experience being in a customer facing role as an engineer.</li></ul><p><strong>Bonus Points</strong></p><ul><li>Proof of concept applications built for various APIs on GitHub.</li><li>Examples of great communication: documentation, blog posts and video blogs.</li><li>Active professional presence on Twitter.</li></ul><p><strong>Essential Functions</strong></p><ul><li>Gain industry recognition and credibility as a regular attendee, panelist, and keynote speaker at meetups, technology conferences, trade shows, and press events</li><li>Advocate for developers internally and craft narratives around new releases and features by working with Product Management, Engineering, and other cross-functional teams.</li><li>Write, curate, and edit developer resources: tutorials, examples, guides, and documentation.</li><li>Deliver compelling presentations, product demos, sample solutions, and discussions to drive adoption of company products and services</li><li>Create screencasts, white papers, and tutorials about emerging technologies and industry developments</li><li>Maintain a strong and credible presence in social media channels relevant to developers</li><li>Work with worldwide counterparts to share best practices and help build a best-in-the-industry developer advocacy organization</li><li>Collaborate and cultivate trust with both the product and the developers. Facilitate dialogue to drive achievement of objectives and a better developer experience.</li><li>Develop a process to solicit, gather, and organize feedback from both internal and external stakeholders to improve and extend the developer experience, product offering, and platform ecosystem.</li></ul>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/387418?reset=False&amp;ra=25Vx9ZfDNeFi&amp;oqs=a%3D25Vx9ZfDNeFi%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Jack Henry &amp; Associates, Inc.®</h4>            <div><p>Banno is redefining the relationship between forward-thinking financial institutions and their customers. Banno leverages bleeding edge technology and an industry leading product vision to make user-friendly mobile and web apps. We have a first-class API; the same API our web and mobile apps use is the same API that is open to the community to build on top of and extend.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Flexible Work Hours</span>                            </li>                            <li>                                <span></span>                                <span>Remote Work Opportunities</span>                            </li>                            <li>                                <span></span>                                <span>Competitive Salaries</span>                            </li>                            <li>                                <span></span>                                <span>Employee Stock Purchase Plan (ESPP)</span>                            </li>                            <li>                                <span></span>                                <span>Awesome Health Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Excellent PTO &amp; Paid Holidays</span>                            </li>                            <li>                                <span></span>                                <span>Casual Business Attire</span>                            </li>                            <li>                                <span></span>                                <span>Paid Parental Leave</span>                            </li>                            <li>                                <span></span>                                <span>Forbes Top 100 Best Places to Work 2017 (#2 in IT)</span>                            </li>                            <li>                                <span></span>                                <span>Computerworld's Best Places to Work in IT 2017</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xnmTQK9VS7GZd2us54eXyQ",
    "url": "https://stackoverflow.com/jobs/371618/software-architect-cloud-services-integration-ockam?a=20D0sreJ0lAA&so_medium=Talent&so_source=TalentApi",
    "title": "Software Architect - Cloud Services Integration at Ockam (San Francisco, CA) ",
    "tags": [
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:erlang/other/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=5, mobile=0, go=22, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/solution",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go",
      "other"
    ],
    "hiringOrganization": {
      "name": "Ockam – San Francisco, CA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 125000,
      "maxValue": 175000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 125k - 175k /Year | Equity"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Software Architect - Cloud Services Integration</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Lead</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Cybersecurity, Developer APIs, Software Development / Engineering</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>1–10 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: Ockam – San Francisco, CA<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-08:00) Pacific Time +/- 4 hours</span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>San Francisco, CA.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>go</div><div>erlang</div><div>apache-kafka</div><div>influxdb</div><div>amazon-web-services</div>            <h4>Job description</h4>            <div><p>Ockam is building&nbsp;<a href='https://www.ockam.io/product/cloud-sdk' rel='nofollow'>interfaces to cloud services</a>&nbsp;like Kafka, InfluxDB, Okta. We are also creating new cloud services like the&nbsp;<a href='https://www.ockam.io/product/registry' rel='nofollow'>Ockam Registry</a>.</p><p>This is an exciting and challenging role on the Ockam Team. You will be responsible for building core components and generalized interfaces in the Ockam code base. You will also get to work with some of the most popular open source communities in the edge and IoT ecosystems.&nbsp; Moreover you will be building infrastructure templates and standing up resources in public cloud environments.&nbsp;</p><p>The primary language we utilize in this layer of the stack is Golang, however, you will have the opportunity to utilize or learn Erlang, Elixir, C, and Rust at Ockam. Cryptography protocols are utilized throughout the Ockam stack, so whether this is an area of experience or experimentation in your past, you will be challenged.</p><p>Ockam is a small and extremely senior team. This role involves architecture, interface design, writing code, responsibility for testing, and publishing documentation. Everyone on the Ockam team takes responsibility for their parts from end-to-end, including the creation of long term objectives, issues in GitHub, task management in our Trello boards, and summaries of key results.</p><p><strong>Expertise</strong></p><ul><li>Git and GitHub's workflow.</li><li>Modern CI/CD pipelines and DevOps.</li><li>API design</li><li>Building complex code bases in the Go language</li><li>Individual and collaborative project management leadership</li></ul><p><strong>Experience</strong></p><ul><li>10+ years of experience</li><li>Building with Docker and Kubernetes</li><li>Provisioning and operating cloud services in AWS, Azure or Google Cloud</li><li>Consuming and contributing to open source codebases</li><li>The basics of cryptography and PKI</li><li>Messaging systems like RabbitMQ&nbsp;</li><li>Comfort switching between multiple programming languages</li></ul><p><strong>Level:</strong></p><ul><li>This is a Level 6-7 role at Ockam.</li><li>Individuals that consider themselves to be Level 5 or 8 are also encouraged to apply.</li><li>For more information about Role Levels at Ockam,&nbsp;<a title=&quot;Guide to Levels at Ockam&quot; href='https://www.ockam.io/learn/guides/engineering_levels/' rel='nofollow'>here is our guide</a>.</li></ul>            </div>        <div>        <a href='https://jobs.lever.co/ockam/c8547a19-a975-4e08-bdce-043f39bf4da7/apply' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Ockam</h4>            <div><p>Ockam’s mission is to enable builders of the seamless connected future. We are builders who empower other builders to develop trustful IoT systems with our easy to use tools, methods, and protocols. We are building an open and thriving open source ecosystem to accrue ever increasing functionality for our users. Ockam is growing The Team to accelerate this mission. We are backed by a world class group of venture investors including Future Ventures, Core Ventures Group, Okta Ventures and others.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote / distributed team</span>                            </li>                            <li>                                <span></span>                                <span>Health care coverage</span>                            </li>                            <li>                                <span></span>                                <span>401k</span>                            </li>                            <li>                                <span></span>                                <span>High performance team culture</span>                            </li>                            <li>                                <span></span>                                <span>Best in class modern tool stack</span>                            </li>                            <li>                                <span></span>                                <span>Stock options</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "9SCn3ubvS8Srw9QDnPUsBg",
    "url": "https://stackoverflow.com/jobs/372624/senior-solutions-architect-remote-new-context-services?a=20XVlPceY3Oo&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Solutions Architect (Remote) at New Context Services  ",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=1, bigdata-ml=8, ruby=4, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "New Context Services – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Senior Solutions Architect (Remote)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer, DevOps</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Cybersecurity, DevOps, Internet Infrastructure</span>                                </div>                        </div>                </div>            <div>Company: New Context Services – No office location<br></div><h4>Technologies</h4><div>cloud</div><div>kubernetes</div><div>api-design</div><div>google-cloud-platform</div><div>hashicorp-vault</div>            <h4>Job description</h4>            <div><p>New Context is a rapidly growing consulting company in the heart of downtown San Francisco. We specialize in Lean Security: an approach that leads organizations to build better, safer software through hands-on technical and management consulting. We are a group of engineers who live and breathe Agile Infrastructure, Systems Automation, Cloud Orchestration, and Information &amp; Application Security.</p><p>As a New Context Senior Solutions Architect, you will provide technical leadership with a hands-on approach. Our clients look to us to guide them to a solution that makes sense for them, and you should expect to provide thought leadership, design, and implement that solution.&nbsp;</p><p>We foster a tight-knit, highly-supportive environment where there are no stupid questions. Even if you may not know the answer immediately, you'll have the entire company supporting you via Slack, Zoom, or in-person. We also host a daily, all-company stand-up via Zoom, and a weekly company Retro, so you won't just be a name on an email.&nbsp;</p><p>At New Context, our core values are Humility, Integrity, Quality &amp; Passion! Our employees live these values every single day.</p><p><strong>Who You Are:</strong></p><ul><li>A Solutions Architect with 10+ years work experience in a related role;</li><li>Experienced in designing cloud platforms for highly regulated industries;</li><li>Experienced in designing microservice architecture on Kubernetes;</li><li>Fluent in one or more high-level languages, ideally Java, Ruby, and/or Python;</li><li>Understanding of DevSecOps, CI/CD pipelines, and infrastructure as code;</li><li>Experienced in API design/development, testing, and authentication/authorization strategies for applications;</li><li>A believer in automated tests and their role in software engineering;</li><li>Familiar with Open Source web technologies and their use in enterprise data platforms;</li><li>Able to think on your feet and learn quickly on-the-job in order to meet the expectations of our clients;</li><li>Experienced working with technical/non-technical external clients and customers;</li><li>Happy and effective in a consulting role;</li><li>A great teammate and a creative and independent thinker.</li></ul><p><strong>Bonus Points if You Are:</strong></p><ul><li>Knowledgeable on the design of Healthcare IT platforms;</li><li>Familiar with HIPAA, ISO 13485:2016, and/or IEC 62304:2006;</li><li>Experienced with GCP administration;</li><li>Familiar with HashiCorp product suite (Terraform, Vault, Packer, Consul);</li><li>Comfortable presenting complex technical issues to C-suite executives.</li></ul><p><strong>We tailor solutions to our customers. You might work on projects using any of the following technologies:</strong></p><ul><li>Automation: HashiCorp Product Suite (Terraform, Packer, Vault, Consul, Vagrant), Chef, Puppet, Ansible, Salt, Automated Testing</li><li>Containerization Ecosystem: Kubernetes, Docker, Mesosphere, Rancher, CoreOS&nbsp;</li><li>Cloud &amp; Virtualization: AWS, GCP, Azure, OpenStack, Cloudstack, kvm, libvirt</li><li>Tools: GitLab, Jenkins, Atlassian Suite, Pivotal Tracker, Git,&nbsp;</li><li>Monitoring: SysDig, DataDog, AppDynamics, New Relic, Sentry, Nagios, Prometheus</li><li>Databases/Datastores: Cassandra, Hadoop, Redis, PostgreSQL, MySQL</li><li>Security: Compliance Automation, Application Security, Firewalls, OSSEC, AuthN and AuthZ</li><li>Languages: Ruby, Python, Go, JavaScript</li></ul><p><em>We are committed to equal-employment principles, and we recognize the value of committed employees who feel they are being treated in an equitable and professional manner. We are passionate about finding ways to attract, develop and retain the talent and unique viewpoints needed to meet business objectives, and to recruit and employ highly qualified individuals representing the diverse communities in which we live, because we believe that this diversity results in conversations which stimulate new and innovative ideas.</em></p><p><em>Employment policies and decisions on employment and promotion are based on merit, qualifications, performance, and business needs. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>            </div>        <div>        <a href='https://jobs.lever.co/newcontext/9b48cb69-1661-4fe9-b4d7-75678a9d274f?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>            Apply        </a>                            </div>            <h4>About New Context Services</h4>            <div><p>New Context is a rapidly growing consulting company in the heart of downtown San Francisco. &nbsp;We specialize in Lean Security; an approach that leads organizations to build better software thru hands-on technical and management consulting. We are a group of engineers who live and breath Agile Infrastructure, Systems Automation, Cloud Orchestration, and Information Security.</p><p>The New Context team personifies the DevOps spirit. We love a challenge and look forward to working with clients to solve their own challenges. Our teams operate with complete stack awareness of infrastructure, application and security.</p><p>Our driving methodologies are Lean Security and Humane Systems. In adopting a security first approach to infrastructure focused on people, processes and technologies, our team will have an integral part in driving the direction of these exciting new approaches.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Great office on Market Street</span>                            </li>                            <li>                                <span></span>                                <span>Any tools you need to get your work done</span>                            </li>                            <li>                                <span></span>                                <span>The opportunity to be a leader in a growing company</span>                            </li>                            <li>                                <span></span>                                <span>Stock Options</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "quuZZ9zbSLSvCLGvndkSSQ",
    "url": "https://stackoverflow.com/jobs/371834/certified-aws-certified-solutions-architect-djangoforce?a=20HuUQAZJdss&so_medium=Talent&so_source=TalentApi",
    "title": "Certified AWS Certified Solutions Architect at DjangoForce  ",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "DjangoForce – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 150000,
      "maxValue": 180000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 150k - 180k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Certified AWS Certified Solutions Architect</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Contract</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Lead</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>SaaS, Software Development, Web Development</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>11–50 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: DjangoForce – No office location<br></div><h4>Technologies</h4><div>amazon-web-services</div><div>architecture</div><div>database-design</div>            <h4>Job description</h4>            <div><p>We are an enterprise software development firm with a preference for AWS hosting.&nbsp; For this reason, we have many AWS accounts that we need to manage and help setup.&nbsp; We are looking for someone with a verified AWS Architect certification.</p>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/371834?reset=False&amp;ra=20HuUQAZJdss&amp;oqs=a%3D20HuUQAZJdss%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About DjangoForce</h4>            <div><p>We build enterprise business &amp; SaaS web applications for start-up companies to Fortune 500 companies.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote Work</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Tz0eLmTgT1GFK7meV33PNA",
    "url": "https://stackoverflow.com/jobs/368114/solutions-architect-sdvi?a=1Zs9fmizufIs&so_medium=Talent&so_source=TalentApi",
    "title": "Solutions Architect at SDVI  ",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(&quot;not&quot;,no,doesn't) W matter 3W OR(locat,live,resid)",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "SDVI – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Solutions Architect</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Entertainment, Media, SaaS</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>11–50 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: SDVI – No office location<br></div><h4>Technologies</h4><div>python</div><div>json</div><div>amazon-web-services</div><div>google-cloud-platform</div>            <h4>Job description</h4>            <div><p>SDVI works hand-in-hand with leaders of the Media &amp; Entertainment industry to develop media supply chain management solutions. SDVI Rally provides SaaS-based, dynamic management of a media company’s supply chain infrastructure, including compute, storage, and networking resources, as well as third-party media applications such as transcoding and QC analysis tools and the resources they require. Our solution architects are responsible for working directly with our customers and technical account management team to ensure customers are able to gain maximum benefit from our platform.</p><p>As part of an internationally distributed team, headquartered in Sunnyvale but working from home and in the field, you are assertive, energetic, an excellent communicator and a highly effective collaborator. You are a puzzle solver that is not afraid to bring your technical prowess to bear when crafting solutions. You have a passion for working intimately with your team and customers, to change the way they work and get a kick from sharing in their ongoing success.</p><p>You are responsible for creating and configuring efficient, scalable supply chains with our customers, ultimately ensuring their successful use of the SDVI platform. As a solutions architect, your focus is supporting the technical account management (TAM) team during the process of initial customer engagements, via POC design and implementation, as well as the ongoing expansion of existing deployments. Additionally, some aspects of technical support and training are required, ensuring the success of our customers as they become self-sufficient in the use of the SDVI Rally platform.</p><p>Your technical capabilities will allow you to quickly learn the Rally platform inside and out. You will become an expert in configuration of the Rally platform, exercising your development skillset to ensure our customers are implementing best-of-breed supply chains, and working directly with them to become self-sufficient as they become familiar with the platform. Your strong communication skills will ensure we continue to support and serve our customers to the highest standards.</p><p>Responsibilities include:</p><ul><li><strong>Pre-Sales Support </strong></li></ul><p>Directly supporting the sales and TAM teams, you will assist with technical aspects of the sales process, including architecture and configuration of demo and POC supply chains, third party software integrations, support of product demonstrations, and building relationships with the technical stakeholders who will ultimately become our customers.</p><ul><li><strong>Customer Onboarding</strong></li></ul><p>As new customers start to use our platform, you will be there every step of the way. Working closely with the TAM team, you will be assisting customers in the definition, creation and testing of supply chains, while helping them get up to speed to manage the platform themselves through training and education.</p><ul><li><strong>Expansion of SDVI services</strong></li></ul><p>As a provider of SaaS services, we expect happy customers to grow their usage over time. This can be achieved through increased throughput, onboarding of additional services and use cases, enhancements to their existing supply chains, or growth in to other departments within the organization. You will support the design and implementation to nourish and grow these expansions within existing accounts to grow the SDVI footprint.</p><ul><li><strong>Ongoing design support</strong></li></ul><p>As a design and implementation specialist you will support our customers with the highest level of customer satisfaction in conjunction with our TAM &amp; support teams. Your goal is happy customers who will want to do more with the SDVI platform.</p><p><strong><em>Requirements:</em></strong></p><ul><li>Expert in Python 3.</li><li>Excellent knowledge of XML, JSON and REST APIs.</li><li>Proficient understanding of code versioning tools (Git).</li><li>Experience of working with public cloud platforms, specifically AWS.</li><li>Excellent communication skills.</li><li>Familiarity with media workflows and associated tools and technologies a plus.</li><li>Customer-facing experience a plus.</li><li>Limited travel to and work from customer locations as required.</li></ul><p>You are likely a professionally trained software engineer who has determined they want more from their career. This role will exercise your existing software development skillset, but couple it with a customer facing role to expand your experience and give you the satisfaction of directly solving customers problems using the Rally platform.</p>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/368114?reset=False&amp;ra=1Zs9fmizufIs&amp;oqs=a%3D1Zs9fmizufIs%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About SDVI</h4>            <div><p><strong>You</strong>&nbsp;are looking for your next big challenge. You want to see the results of your hard work, are ready to do it on your terms, and are looking for a company that welcomes your talent no matter where you live.</p><p><strong>We are SDVI</strong>, a cutting-edge SaaS developer for Media &amp; Entertainment, and we believe that the ideal company is a tight-knit team pursuing excellence and having fun along the way. We are a completely distributed company, with staff based around the globe, looking to grow our team of A-level developers.&nbsp;<strong>Are you ready to join us?</strong></p><p><strong>What we’re about</strong></p><p>SDVI is engaged in an exciting challenge: bringing the benefits of cloud-enabled technology to world-class Media &amp; Entertainment companies. The media industry is in the midst of a radical shift: content is streamed to individuals around the globe - in their living room, in their lap, or in the palm of their hand. SDVI is at the center of that transformation.</p><p>SDVI is the market leader in its space and, with 100% business growth year-on-year, we’re pursuing an aggressive company growth strategy. We’re partnered with global industry leaders, including Discovery, Fox, Sky, Turner, and others. Many of these customers are also investors: they truly need the technologies we’re developing and work closely with our teams to get it right.</p><p>We offer a robust benefits package, including stock options, highly competitive salary, unlimited vacation allowance, and comprehensive medical, vision, and dental benefits. SDVI respects the individual needs of employees and is an equal opportunity employer. We check all of your boxes in terms of stability and generous benefits.</p><p><strong>What makes you a good fit</strong></p><p>You are an A-level player who wants to work with other A-level players. You can thrive in an Agile environment where engineers talk directly to their users and immediately see how your work is making a real difference. You appreciate commitment to best-practices – solving problems the&nbsp;<em>right&nbsp;</em>way, not just&nbsp;<em>any</em>&nbsp;way.</p><p>You want to be part of a team that respects individuals and their work. You can work independently and maintain focus. You enjoy working on enterprise-scale projects, or you are ready to take on that challenge. You consider the big picture and your contribution to it.</p><p><strong>What we’re like</strong></p><p>If we do say so ourselves, we are smart, competitive, responsible, creative and fun. We enjoy big challenges and excellence in our work. We value a supportive team culture, and we expect our staff to maintain strong work/life balance, because good people are the difference between a satisfactory job and a great job. We’ve found that the sharpest and most creative people also tend to be the most fun. A great sense of humor is highly valued around here - that’s what keeps our energy up and makes us look forward to working together each day.</p><p>And we do work closely together every day, even though we don’t share an office. As a completely distributed company, we each work in the place that makes the most sense for us, whether at home, on the road, in a shared business workspace… the possibilities are really up to you. We’ve created an infrastructure that makes the distributed work environment&nbsp;<em><strong>work</strong></em>&nbsp;for our teams.</p><ul><li>Video chat tools for easy face2face interaction</li><li>Daily, focused standups to stay on-target and connected</li><li>Technology stipends to support your productive work environment</li></ul><p>We also&nbsp;<strong>bring our staff together</strong>&nbsp;for in-person meetings that include team dinners and activities. They let us have some fun together and build stronger relationships. Our team agrees: these kinds of details are what make SDVI a great place to work.</p><p><strong>Does SDVI sound like a good fit? Contact us. Let’s talk.</strong></p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Comprehensive medical, dental, and vision insurance</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited vacation time</span>                            </li>                            <li>                                <span></span>                                <span>Competitive base pay</span>                            </li>                            <li>                                <span></span>                                <span>Stock options</span>                            </li>                            <li>                                <span></span>                                <span>Quarterly in-person meetups</span>                            </li>                            <li>                                <span></span>                                <span>Technology stipend</span>                            </li>                            <li>                                <span></span>                                <span>Distributed company (work from home!)</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PPCXTdLuQ9yL4EDkoxAQJA",
    "url": "https://remoteok.io/jobs/84805",
    "title": "Developer Advocate",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Jack Henry & Associates .�",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 25, 2020 4:19:08 AM",
    "validThrough": "May 2, 2020 4:19:08 AM",
    "crawled": "Apr 25, 2020 5:05:21 AM",
    "content": "<span></span> <span><h4>Jack Henry &amp; Associates .�</h4></span> <br> <h3>Developer Advocate</h3> <br> <span>US-only</span> <div>  <div>   \\nBanno is redefining the relationship between forward-thinking financial institutions and their customers. Banno leverages bleeding edge technology and an industry leading product vision to make user-friendly mobile and web apps. We build front end applications natively in both Android and iOS as well as using modern web components.\\n\\nAbout You\\n\\nYou are infinitely curious and thrive in an environment where you are constantly learning and growing. You want to be somewhere that you are trusted and set up for success every day. You want to be somewhere that surrounds you with other great engineers that drive you to be better everyday.\\n\\nAlthough you work with multiple teams you are self motivated and able to work with independence. You have experienced good developer experiences and poor developer experiences.&nbsp; You have an itch to make a great developer experience. You care deeply about your work, your teams, and the end user.\\n\\nBanno values trust and those with a bias towards action. We have a remote-first culture that challenges you each day and supports your growth. We are confident you will love it here.\\n\\nWhat you are working on\\n\\nIn short, you'll be advocating for the needs of developers whether they are 3rd party developers or internal engineers.The Developer Advocate is the primary public interface for evangelizing Banno’s API, developer toolkit, and plugin ecosystem while assisting outside developers in building new and interesting products with Banno.\\n\\nThe Developer Advocate is constantly creating new proof of concept projects to demonstrate inventive new things to do with Banno’s API. The Developer Advocate publicly discusses Banno’s API on social media as well as presents at conferences. The Developer Advocate writes technical guides, tutorials, and reference docs for https://jackhenry.dev.\\n\\nAbout the Banno team\\n\\nWe are committed to creativity, thoughtfulness, culture, and openness—the perfect place to make phenomenal products that have a big impact. Our work environment echoes a modern tech startup but we have the security and benefits of a large, publicly traded company. With an engineering team of over 100, we place a high value on continued education and also contribute to--and use--open source projects.\\n\\nOur team is distributed and that means you can live and work wherever you want within the US. You’ll get the chance to choose your own tools, work with bleeding edge web technologies across the stack and contribute to products that are used by millions of people.\\n\\nTravel of up to 25% may be required for company meetings, professional development, and public speaking at conferences.\\n\\nMust be U.S. based.\\n\\nMinimum Qualifications\\n\\n\\n* Minimum 6 years of programming experience.\\n\\n* Experience with one of these modern JavaScript frameworks; Angular, React, Vue, or Polymer.\\n\\n* Must have experience presenting at a conference, industry group or local development groups.\\n\\n* Experience being in a customer facing role as an engineer.\\n\\n\\n\\n\\nBonus Points\\n\\n\\n* Proof of concept applications built for various APIs on GitHub.\\n\\n* Examples of great communication: documentation, blog posts and video blogs.\\n\\n* Active professional presence on Twitter.\\n\\n\\n\\n\\nEssential Functions\\n\\n\\n* Gain industry recognition and credibility as a regular attendee, panelist, and keynote speaker at meetups, technology conferences, trade shows, and press events\\n\\n* Advocate for developers internally and craft narratives around new releases and features by working with Product Management, Engineering, and other cross-functional teams.\\n\\n* Write, curate, and edit developer resources: tutorials, examples, guides, and documentation.\\n\\n* Deliver compelling presentations, product demos, sample solutions, and discussions to drive adoption of company products and services\\n\\n* Create screencasts, white papers, and tutorials about emerging technologies and industry developments\\n\\n* Maintain a strong and credible presence in social media channels relevant to developers\\n\\n* Work with worldwide counterparts to share best practices and help build a best-in-the-industry developer advocacy organization\\n\\n* Collaborate and cultivate trust with both the product and the developers. Facilitate dialogue to drive achievement of objectives and a better developer experience.\\n\\n* Develop a process to solicit, gather, and organize feedback from both internal and external stakeholders to improve and extend the developer experience, product offering, and platform ecosystem.\\n\\n\\n \\n\\n#Location\\n- US-only   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "g4Ivr-IjSTi6_Nf-x-lBxw",
    "url": "https://news.ycombinator.com/item?id=22754189",
    "title": "Autodesk Construction Solutions (Plangrid) | San Francisco, CA (Onsite or Remote)| Senior ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=5, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 12:32:46 AM",
    "validThrough": "Apr 9, 2020 12:32:46 AM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Autodesk Construction Solutions (Plangrid) | San Francisco, CA (Onsite or Remote)| Senior Software Engineer<p>Autodesk Construction Solutions is the industry leader for construction management software, and we're building a ton of cool new stuff after the Plangrid acquisition.</p><p>I'm currently a SWE at Plangrid (now part of Autodesk Construction Solutions), and there's a lot of smart people and great culture.  Perhaps being bought out by Autodesk was a smart move, as we are now doubling down on recruiting thanks BigCo cash reserves. I'm not worried at all about the economy affecting Autodesk, and we all just got our raises and bonuses last week. We also have a really good remote culture (~40% remote people) so that's a real plus for this COVID-19 crisis. Come work with some fun and smart people.</p><p>Server stack: Python | Kubernetes | PostgreSQL | Swift</p><p>Senior SWE (Backend): <a href='https://rolp.co/FSbti' rel='nofollow'>https://rolp.co/FSbti</a>Product Manager: <a href='https://rolp.co/sHHWh' rel='nofollow'>https://rolp.co/sHHWh</a>Android Engineer: <a href='https://rolp.co/sTWni' rel='nofollow'>https://rolp.co/sTWni</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "oufkupycRNWZzS5o0ydqUw",
    "url": "https://www.indeed.co.uk/viewjob?t=Data+Warehouse+Developer&jk=09257f1ee60d888c&",
    "title": "Data Warehouse Developer - Newport - Opus Recruitment Solutions - Newport",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Opus Recruitment Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 4:30:34 PM",
    "validThrough": "Apr 8, 2020 4:30:34 PM",
    "crawled": "Apr 24, 2020 8:09:08 PM",
    "content": "<div><div><b>Data Warehouse Developer - £45,000 - Newport</b><br>An exciting opportunity for a Data Warehouse Developer to join a fast growing financial services company in Newport.<br><b>Skill Experiences</b><br><ul><li><b>SQL</b></li><li><b>Azure or AWS</b></li><li><b>NoSQL (MongoDB or Cassandra)</b></li><li><b>Experience configuring and interrogating CRM Dynamics or Salesforce systems</b></li></ul><b>Benefits</b><br><ul><li><b>Remote working</b></li><li><b>Flexible hours</b></li><li><b>Life assurance</b></li><li><b>Private health care</b></li><li><b>Free parking</b></li></ul>Interviews are taking place from 6th April remotely and successful candidates will be started remotely.<br>Please APPLY for more information on the role or call Samuel Barcia on 01179107984<br><b>Data Warehouse Developer - £45,000 - Newport</b></div></div><div><div><div><span></span></div><span>Newport</span></div><div><div><span></span></div><span>Permanent</span></div><div><div><span></span></div><span>£43,000 - £48,000 a year</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1gPOPrehSySbYs6nPcH26g",
    "url": "https://stackoverflow.com/jobs/383810/automation-solutions-engineer-keelvar?a=24IvSpJvpobK&so_medium=Talent&so_source=TalentApi",
    "title": "Automation Solutions Engineer at Keelvar (Cork, Ireland) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:k/t/w:django/python/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=10, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ],
    "hiringOrganization": {
      "name": "Keelvar – Cork, Ireland",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Automation Solutions Engineer</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                        </div>                </div>            <div>Company: Keelvar – Cork, Ireland<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                                            <div>                                <span>Office Location:</span>                                <span>Cork, Ireland.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                            <div>                                <span>Relocation Assistance:</span>                                <span>Yes</span>                            </div>                    </div>                </div>            <h4>Technologies</h4><div>python</div><div>django</div>            <h4>Job description</h4>            <div><p>As a Solutions Engineer, you will be responsible for building solutions that revolutionize how the best procurement teams in the world are sourcing. On a typical day you will:</p><ul><li>Build relationships with key executives, understand their workflows and map out best practice solutions within our product suite.</li><li>Drive the discovery process, helping to uncover your customer’s current process and align to their business objectives</li><li>Ensure customers understand how our AI Bots work to automate their existing sourcing and bid process</li><li>Guide the customers through the automation onboarding process</li><li>Write code to customise our Bots to your customers’ logistical needs</li><li>Prepare and deliver demonstrations which combine your customers data and workflow with Keelvar technology to ensure key business objectives and technical requirements are met</li><li>Liaise closely with engineering teams to understand and enhance product features.</li><li>Act as a liaison between Engineering, Marketing and Sales, sharing customer feedback to help craft the product roadmap</li><li>Contribute to the ongoing success of this fast-paced, rapidly growing and evolving organization&nbsp;</li></ul>            </div>        <div>        <a href='https://grnh.se/d8fba6862us' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Keelvar</h4>            <div><p><strong>About Us</strong></p><p>This is an exciting opportunity to join a cutting edge company, disrupting its industry. Currently optimizing over $100bn+ in procurement spend for the world's largest companies, Keelvar is more than just a software company. Keelvar is an evolution of how companies work.</p><p>Our technology is unparalleled in its space. We are on a fast-paced journey to herald a new era of SaaS 3.0. Using AI, Machine Learning, and Game Theory to build intelligent systems that optimize and automate the procurement sourcing process, we save our customers millions of dollars every year, and help their suppliers find the best customers for them. Many of the world’s top blue chip companies use Keelvar to aid negotiations; they set high standards that we relish achieving because it helps us be the best at what we do.</p><p>We believe we can change the world and have fun doing it. We are a hard-working team who love what we do. We believe that a culture of curiosity, experimentation, and risk-taking is the key to finding breakthrough approaches - and we don’t settle for conventional approaches.</p><p>We strive for excellence, challenging ourselves and each other, with independent thinking, a lot of focus, and plenty of collaboration. In our eyes, the bigger the challenge, the bigger the reward. We’re not content with just equipping users with good tools; we want to help our customers achieve success and excellence, and sometimes this requires lateral or unconventional thinking. We want you to share your knowledge readily and learn every day. We like to ask questions, and answer questions when we can. We invite you to a workplace that is inclusive and celebrates diversity. We support everyone in being themselves, feeling empowered and inspired to make a difference.</p><p>If you are passionate about how technology is changing the world of work and want to work with a great team, this is the role for you!</p><p><strong>What you will be doing</strong></p><p>As a Solutions Engineer, you will be responsible for building solutions that revolutionize how the best procurement teams in the world are sourcing. On a typical day you will:</p><ul><li>Build relationships with key executives, understand their workflows and map out best practice solutions within our product suite.</li><li>Drive the discovery process, helping to uncover your customer’s current process and align to their business objectives</li><li>Ensure customers understand how our AI Bots work to automate their existing sourcing and bid process</li><li>Guide the customers through the automation onboarding process</li><li>Write code to customise our Bots to your customers’ logistical needs</li><li>Prepare and deliver demonstrations which combine your customers data and workflow with Keelvar technology to ensure key business objectives and technical requirements are met</li><li>Liaise closely with engineering teams to understand and enhance product features.</li><li>Act as a liaison between Engineering, Marketing and Sales, sharing customer feedback to help craft the product roadmap</li><li>Contribute to the ongoing success of this fast-paced, rapidly growing and evolving organization&nbsp;</li></ul>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "wM8RjePbQky6XZ64_cQAIQ",
    "url": "https://stackoverflow.com/jobs/374036/german-speaking-solution-architect-needed-magnolia-international-ltd?a=21rhDUeiF4CA&so_medium=Talent&so_source=TalentApi",
    "title": "German-speaking Solution Architect needed! at Magnolia International Ltd.  ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:glassfish/java/8",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/6",
      "DBG_TECH1:k/t/w:java/mobile/3",
      "DBG_TECH1:k/t/w:jboss/java/16",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:k/t/w:tomcat/java/16",
      "DBG_TECH1:k/t/w:weblogic/java/8",
      "DBG_TECH1:k/t/w:websphere/java/8",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=9, c=0, mobile=3, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=75, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Magnolia International Ltd. – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>German-speaking Solution Architect needed!</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Agile Software Development, CMS, Enterprise Software</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: Magnolia International Ltd. – No office location<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Berlin </span>                            </div>                                                                                            </div>                </div>            <h4>Technologies</h4><div>java</div><div>java-ee</div><div>jboss</div><div>content-management-system</div><div>tomcat</div>            <h4>Job description</h4>            <div><p>“We believe in making it as easy and fast as possible for smart, digitally experienced brands to deliver great web projects and amazing customer experiences…and we love doing it!” Tim Brown, CEO, Magnolia</p><p>Sounds like you? Great, here’s how Magnolia empowers your success:</p><ul><li><strong>A Great Product:</strong>&nbsp; Loved by clients and respected by analysts, Magnolia is arguably one of the best CMS solutions on the market.</li><li><strong>Directly Contribute to Magnolia’s Success:&nbsp;</strong>We value each individuals’ input and create opportunities to realize them.</li><li><strong>Great variety in your areas of responsibility:&nbsp;</strong>You will be able to dive into any skill area within the company that allows you to grow according to your personal career goals.</li><li><strong>International Exposure:&nbsp;</strong>With offices in the USA, Spain, Switzerland, Czech Republic, Singapore, and Vietnam you will collaborate with colleagues from over 30 Nationalities.</li></ul><p><br><br>Now,&nbsp;if you are an&nbsp;<u><strong>experienced Solution Architect</strong></u>&nbsp;who wants to support our business growth in the DACH region, please read on.</p><p><strong>&nbsp;What we need you to do</strong></p><ul><li>Provide value during product demonstrations by showcasing Magnolia features and capabilities during initial product evaluations.</li><li>Define requirements and develop measurement strategies to ensure the Magnolia solution addresses the customers’ specific business needs.&nbsp;</li><li>Provide expert know-how on development, integration and Magnolia deployment and system architecture, including backup strategies, load balancing, failover, security, multisite and general hosting configuration.</li><li>Consult with existing clients to expand their usage of Magnolia or troubleshoot issues encountered.</li><li>Build proof of concept and new modules, trace issues in client implementations and propose solutions to maximize the business value to our customers.</li><li>Work constantly with cutting-edge technology to help customers to reach their demanding goals in the area of digital transformation.</li></ul><p><strong>What you ideally offer</strong></p><ul><li>Bachelor’s degree in Computer Science or a related field is required</li><li>Fluent in German (at least C1)</li><li>+5 years of experience in software development with Java, building or managing the development of a complex, commercial enterprise-class product. Experience with cloud-based installations and web services is a big plus.</li><li>Experience with a broad range of operating systems, application servers, databases,&nbsp;and related products (e.g. Unix, Solaris, OSX, Windows; WebSphere, WebLogic, Glassfish, Tomcat, JBoss; Oracle, MySQL, SQL Server, etc.).</li><li>Experience in Internet technologies: HTTP, HTML, XML, Web server, server-side Java, and databases.</li><li>Excellent problem solving and communication skills.</li><li>Willing and able to travel regularly within Europe.</li><li>A collaborative can-do attitude and a relentless focus on helping our customers succeed.</li></ul>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/374036?reset=False&amp;ra=21rhDUeiF4CA&amp;oqs=a%3D21rhDUeiF4CA%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Magnolia International Ltd.</h4>            <div><p><strong>Why work at Magnolia</strong></p><p>We develop the best web content management system, an&nbsp;interesting, high-quality product, have big customers, work with friendly people in a relaxed environment, and be well compensated - that's what developing at Magnolia is about.</p><p><strong>Our Product - Magnolia CMS:</strong></p><p><span>When it comes to how consumers experience a brand, the website is only the beginning. Today, consumers use a diversity of touchpoints, search engines and social networks to interact and hence the Customer Experience has become the new competitive battleground.&nbsp;</span></p><p><span>Monolithic suite implementations have become outdated by a new breed of </span><span>modern, often cloud-based and API-centric solutions </span><span>that </span><span>bring the flexibility, speed and ease brands need in today's omnichannel age</span><span>.</span>&nbsp;</p><p><span>With best-in-class headless CMS, unrivaled integrations, and modern technology in the cloud - Magnolia is uniquely positioned in this market to enable enterprises to fully bring their customer-centric vision to life. </span></p><p>Enterprises such as The New York Times, Tesco, Avis, and REWE believe in us and our product.&nbsp;<br><br></p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>25 days paid vacation</span>                            </li>                            <li>                                <span></span>                                <span>Freedom and responsibility in your work</span>                            </li>                            <li>                                <span></span>                                <span>Low admin bureaucracy in a self driven environment</span>                            </li>                            <li>                                <span></span>                                <span>Endless snacks, catering, free drinks, happy hours, BBQs, etc.</span>                            </li>                            <li>                                <span></span>                                <span>Happy to offer flex-time</span>                            </li>                            <li>                                <span></span>                                <span>Home- / Remote-friendly</span>                            </li>                            <li>                                <span></span>                                <span>No dress code, relaxed atmosphere</span>                            </li>                            <li>                                <span></span>                                <span>Smart and inspiring colleagues</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yikLdsBXQT6vs8ybH6vCsQ",
    "url": "https://stackoverflow.com/jobs/349917/it-solutions-architect-hays-specialist-recruitment?a=1TlMqPjnTdQs&so_medium=Talent&so_source=TalentApi",
    "title": "IT Solutions Architect at Hays Specialist Recruitment Ltd (Nottingham, UK) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=5, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Hays Specialist Recruitment Ltd via Hays plc – Nottingham, UK",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:07 PM",
    "validThrough": "May 1, 2020 8:09:07 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>IT Solutions Architect</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior</span>                                </div>                        </div>                </div>            <div>Company: Hays Specialist Recruitment Ltd via Hays plc – Nottingham, UK<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                                            <div>                                <span>Office Location:</span>                                <span>Nottingham, UK.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>togaf</div><div>architecture</div><div>enterprise</div>            <h4>Job description</h4>            <div><p>Are you an ambitious Solutions Architect, looking for a new challenge, playing a key role in as part of a wider team delivering a wide a range of new technologies across a large enterprise environment? We want you to be a leader in the successful and exciting portfolio of programmes and projects <br> <br> This leading University are looking to appoint a Solution's Architect within the Information Services department. The role is key in working within an established Architecture function designing solutions across our infrastructure and applications landscape, looking at how we can leverage new and existing technologies to help drive of Digital Strategy supporting our global community of over 50,000 students and staff. <br> <br> Your Responsibilities <br> <br> As a member of the newly formed Solution Design team, you will play a key role within a wider skilled team of Solution Architects and Solution Designers, taking responsibility for key projects as directed by the Head of Solution Design, understanding the wider business drivers for change and capabilities of IT Services to determine suitable enterprise system designs and change requirements. <br> <br> You will develop the architecture for a broader scope of projects, working closely with the Enterprise Architects and the Solution Design team to align business, application, data and infrastructure architecture across the portfolio. As an ambassador of change, you will have a continuous improvement ethos, and will seek to work with the wider university and IT Services to develop solutions that are fit for purpose and will enable innovation. <br> <br> Core Skills</p><ul><li>Proven experience in a Solution Architecture discipline across a range of technologies and disciplines</li><li>Expertise in designing complex systems including discovering and analysing requirements analysis, understanding the context, identifying and assessing alternative solutions, selecting technologies and advising on configuration</li><li>Experience or qualifications within TOGAF or equivalent framework is advantageous</li><li>An awareness of current and emerging technologies and services</li></ul><p><br> Communication</p><ul><li>You will be self-motivated and dynamic, and able to engage, challenge and influence others</li><li>A track record of developing and maintaining collaborative working relationships across IT and the wider institution</li><li>An ability to explain technical issues to non-specialists, and to write clear technical reports and other formal documentation for solution deployments and evaluations is essential.</li></ul><p><br> As an employer of choice, the University offers an extensive benefits package including:</p><ul><li>A competitive salary package</li><li>30 days leave up to 5 closure days plus bank holidays</li><li>Excellent average salary pension scheme</li><li>An extensive training and development plan for this role and those within the Solution Design team</li></ul><p><br>Close date Wednesday 22nd January<br> <br> Please note interviews will take place on 31st January or 4th February <br> <br> For more information please contact Amanda Whicher 020 7259 8746<br><br>Hays Specialist Recruitment Limited acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T&amp;C's, Privacy Policy and Disclaimers which can be found at hays.co.uk</p>            </div>        <div>        <a href='https://www.aplitrak.com/?adid=QS5HbGFuY3kuNzg3NTcuNjk4MUBoYXlzbGVnLmFwbGl0cmFrLmNvbQ' rel='nofollow'>            Apply        </a>                            </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
