{
 "items": [
  {
    "id": "W9jbQRuMTQOqe25qKrz5ng",
    "url": "https://weworkremotely.com/remote-jobs/toggl-financial-controller",
    "title": "Toggl: Financial Controller",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 2W work W experi",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Toggl",
      "sameAs": "https://toggl.com/"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 50000,
      "maxValue": 50000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "EUR 50k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 11:37:21 AM",
    "validThrough": "May 4, 2020 11:37:21 AM",
    "crawled": "Apr 27, 2020 12:05:10 PM",
    "content": "<h3> Financial Controller </h3><div><div>&nbsp;</div><div>Toggl is an easy to use and flexible time tracking tool that helps 3+ million users see where their work time goes, so they can focus on the projects that really matter. It also works on all devices, and integrates with over a 100 tools.&nbsp;<br><br><br><br></div><div><strong>As a part of our Operations team, you will be accountable for the integrity and accuracy of financial accounts for Toggl Track, Plan, and Hire. You will prepare internal and external financial reports, manage our budgeting processes and assist in developing our financial data control processes.<br></strong><br><br></div><div><strong>The salary for this position is €50,000 annually.</strong><br><br><br></div><div>You can work from anywhere in the world.<br><br><br></div><div><strong><br>The role<br></strong><br><br></div><div>We need your experience and knowledge to support the team in scaling a world-renowned, and much-loved, SaaS brand from $10M to $50M+ in revenue.<br><br><br></div><div>We expect you to bring a fresh pair of eyes to our financial reporting and budgeting processes, supporting key decision making in every function. You will be working to ensure financial compliance to local, international and group policies. Delivering financial analysis and reports will also form a significant part of the role.<br><br><br></div><div>You will be in good company, too. Toggl is a team of fantastic professionals. Everyone is smart, fun and caring.<br><br><br></div><div>We are profitable and self-funded, and we’re taking Toggl to the next level. Join us for the ride!<br><br><br></div><div><strong><br>About you<br></strong><br><br></div><div>You have 5+ years of experience in a financial controlling or financial management position, preferably in an international setting. You have a solid track record of successfully setting up and improving financial processes in previous companies and providing forward-thinking financial assistance to the upper management. You are data-driven and have strong analytical skills complemented by very good presentation skills.<br><br><br></div><div>You will succeed in this role if you are self-motivated, have exceptional problem-solving skills and remain composed under pressure. Excellent written and spoken English skills are a must, remote work experience is a plus.<br><br><br></div><div><strong><br>About the team<br></strong><br><br></div><div>Toggl is a distributed team of 75+ people working remotely from 30 countries. We take pride in our professional, learning-oriented and friendly working environment that values work-life balance and constantly doing our best in every aspect of our work. You can work from anywhere in the world, because we know great people do awesome work wherever they are. Every few months we travel to meet up somewhere in the world and spend some quality time together. Our business is profitable with a healthy margin and we are built with no outside investments, so you can count on a stable working environment.</div><div><strong><br>Some benefits<br></strong><br><br></div><ul><li>Freedom to choose when and where you work from.</li><li>24 days of paid time off a year, plus your local holidays.</li><li>2 company retreats and 2 team meetups a year (expenses covered) for team-building.</li><li>Laptop and a €2,000 budget to set up your home office.</li><li>Reimbursement for co-working space rent or internet service at home.</li><li>Opportunities to attend trainings, workshops or conferences.</li><li>Monthly reimbursement for gym membership, massage and other things to improve your health.</li><li>Support for buying a phone, eyeglasses or tools you need for doing your best work.&nbsp;</li></ul><div>&nbsp;</div><div><strong>Apply now!</strong><br>All it takes to apply is answering a short skills test that assesses your expertise. Instead of fancy resumes we want to see your real skills. Only candidates who do well on the test will be considered for this position.&nbsp;</div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "abkvoYWuRZO5_wxAeNnMPw",
    "url": "https://jobmote.com/job/4577465/senior-accountant-remote-full-time/",
    "title": "Senior Accountant (Remote, Full-time)",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TrueCare24",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 25, 2020 3:22:06 AM",
    "validThrough": "Apr 28, 2020 3:22:06 AM",
    "crawled": "Apr 25, 2020 4:05:12 AM",
    "content": "<div><p><strong>TrueCare24 is seeking a &quot;Jack or Jill-of-all-trades&quot; Senior Accountant</strong></p>            <p><strong></strong><br><strong>About Us:&nbsp;</strong>TrueCare24.com is a platform that connects healthcare professionals and caregivers. We are changing the future of how care/healthcare services are bought and delivered. Headquartered in the San Francisco Bay Area, we have a globally distributed team of highly skilled and highly committed professionals all over the United States.&nbsp;</p>            <p><strong>Job Description:&nbsp;</strong>As a <strong>Senior Accountant</strong>, you will be fundamental to TrueCare24's success. You are intellectually curious and excited at the opportunity to drive the company forward by tackling the most critical challenges. You love wearing multiple hats, and “multitasking” is in your blood. You are a true generalist. You see the big picture, but always pay attention to the details. You are responsive and responsible.</p>            <p>This is a unique opportunity for a hungry, driven self-starter to define and build out a Financial Operations (Fin Ops) function from the ground up. You will be responsible for a wide range of accounting, finance, and payroll functions.&nbsp;</p>            <p>Please note that this is a remote, contract (1099) position with the potential to become a full-time W2 position in the future. You will be responsible for timely and accurate billing and effective collections. You will also be responsible for payroll processing, vendor, and contractor payments.&nbsp;</p>            <p></p>            <p><strong>Job Requirements:</strong></p>            <ul><li>3+ years of A/P, A/R and Billing experience&nbsp;</li><li>3+ years of payroll processing experience</li><li>Strong MS Excel, MS Word, and Google Suite skills</li><li>Ability to scale teams from 0 to &gt;1</li><li>Define and refine workflow and procedures</li><li>Knowledge of payroll processing software required (Zenefits &amp; ADP preferred).</li><li>Knowledge of basic payroll rules and regulations.</li><li>Strong collection skills; ability to follow up with clients with respectful tenacity.</li><li>Strong accounting, analytical, and investigative skills.</li><li>Strong attention to detail.</li><li>Ability to communicate effectively and disseminate pertinent information efficiently.</li><li>Ability to exercise discretion and maintain confidentiality.</li><li>Ability to make sound ethical decisions. Integrity beyond reproach.</li><li>Ability to work effectively under pressure.</li><li>Strong communication and followthrough skills.</li><li>Comfortable working directly with the Founders and C-level executives.</li><li>Ability to work independently and take ownership of assigned responsibilities and work product.</li><li>Bachelor's Degree in Business or Accounting preferred</li></ul><p></p>            <p><strong>Important:</strong> For this position, you must have a reliable home office setup (a laptop, a cell phone with a strong signal, a reliable high-speed internet connection, and a quiet work area). Your laptop and cell phone should be no more than 2 years old and in good working condition. You should be able to troubleshoot your equipment quickly in case of minor malfunctions.</p>            <p></p>            <p><strong>TrueCare24's Values</strong><strong>Customer First</strong> - We have a Customer First mindset. (EAC) Engage, Align, and Execute for our Customer &amp; Partner communities.&nbsp;</p>            <p><strong>Bias for Action</strong> - We practice high-velocity decision-making, despite encountering ambiguity daily. Act and move forward.&nbsp;&nbsp;</p>            <p><strong>Act Like an Owner</strong> - We have a strong ownership mentality. Therefore, we work smart, hard, and long. Every person on the team has the potential to have a large impact.</p>            <p><strong>Always Be Learning</strong> - We learn rapidly and eagerly, from different teams within and outside the company. Respectful debate makes our organization stronger. We will make unintentional mistakes.&nbsp; Learn and move forward.&nbsp;</p>            <p><strong>Do the Right Thing. Period.</strong> - Empathy, Trust, Candor (ETC). Being empathetic to our Partners, our Customers, and each other helps build trust in our community and fosters successful decision-making.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5rXVmTopTPSYY79BcEyH4g",
    "url": "https://problogger.com/jobs/job/content-article-writers-for-personal-finance-and-college-savings/",
    "title": "Content/Article Writers for Personal Finance and College Savings",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Saving for College",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 22, 2020 2:00:00 AM",
    "validThrough": "Apr 29, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Content/Article Writers for Personal Finance and College Savings</h3><div>Company: Saving for College</div>Location: Anywhere<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p>Savingforcollege.com is the #1 visited finance website (with millions of visitors) focused on college savings and we are growing quickly, expanding our audience, and launching new products. We have built industry leading content and tools on college savings plans that are trusted by parents, financial professionals, and leading media outlets. Our advertisers include some of the most prestigious financial institutions in the country. You will be joining a unique team in that we have strong financials but with startup, move-fast culture - the best of both worlds.</p><p>We are looking for freelance writers to produce a large number of articles that are designed with SEO guidelines in mind. Most of the articles are between 500-1000 words, depending on the topic.</p><p>We are looking for writers that can balance speed and quality in their writing. We need applicants to be able to handle at least five articles a week, but we are giving preference to applicants who have the availability to write much more. For the right candidate, there is potentially a near-endless supply of writing wanted.</p><p>We pay at a starting rate of $.03/word but scale upward based on previous experience and skill. The ideal candidate is expected to be able to:<br>- Consistently produce error-free articles on a daily basis (we will require poorly written or inaccurate articles to be fixed before we’ll accept the submission)<br>- Choose imagery from relevant articles or from our stock image libraries<br>- Correctly categorize and tag content<br>- Work under an editor who will oversee and approve all content<br>- Command a mastery of the English language and adhere to site style conventions<br>- Be flexible and communicative about availabilities<br>- Have general SEO knowledge and how to incorporate SEO into articles</p><p>To apply writers MUST:</p><p>- Have experience writing about personal finance.<br>- Include 3 personal finance writing samples.</p><p>This is a work-from-anywhere position. Our team is global and comes from a wide variety of backgrounds, but candidates must be able to write in clear, adept American English.<br>This is not a word-mill job. It is entry-level, but we have a history of promoting capable writers from within, and we compensate competitively within the industry.</p>          </div>                <h5>Application Instructions</h5>    <div>                            MUST include 3 personal finance writing samples                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WTsevJXSQdu7NpkoqPA_Ug",
    "url": "http://workinstartups.com/job-board/job/91204/finance-subject-matter-expert-at-you-intrapreneur/",
    "title": "Finance - Subject Matter Expert",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "you intrapreneur",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 18, 2020 9:39:21 AM",
    "validThrough": "Apr 25, 2020 9:39:21 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>At You Intrapreneur (<a href='https://www.youintrapreneur.com/'>https://www.youintrapreneur.com/</a>) we teach people how to become corporate entrepreneurs to advance their career within their organization or outside their organization.</p><br /><p>We want to build the workforce of the future raising CEO alike profiles who are able to lead at every level of their company, who have a broad range of competences, and can go deep and/or broad to solve problems and build solutions.&nbsp;</p><br /><p>Our students' motto is: &quot;you don't need to be a CEO to work as a CEO!&quot;.</p><br /><p><strong>We are looking for a Finance- Subject Matter Expert to build our Finance chapter and improve our knowledge program.</strong></p><br /><p>Responsibilities:</p><br /><ul><br /><li>identify critical elements to know of a Finance function</li><br /><li>identify business cases to facilitate the learning experience</li><br /><li>summarize practical tips that you can share from your career experience in Finance</li><br /><li>write content material</li><br /><li>work with the rest of the team to support with marketing activity (contribute to Webinars, articles, LinkedIn, etc)</li><br /></ul><br /><p>What you'll have back:</p><br /><ul><br /><li>the possibility to contribute developing future leaders and &quot;give back&quot; with your knowledge</li><br /><li>you'll be part of a team, virtually meet other experts to expand your network</li><br /><li>add a new experience in your CV and join our community of Advisers once everything goes back to normal</li><br /><li>access coaching sessions for free</li><br /></ul><br /><p><em>Please note this is a volunteer role for people in furlough</em></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
