{
 "items": [
  {
    "id": "071xw6k1SQqzg_B5dOMG8Q",
    "url": "https://stackoverflow.com/jobs/194780/solution-engineer-id-prse01-open-xchange-gmbh?a=13k2gGHkY1qM",
    "title": "Solution Engineer (ID: PRSE01) at Open-Xchange GmbH (Nürnberg, Deutschland) ",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "c"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 24, 2018 9:06:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Collaboration Tools, Computer Software, Open-Source</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>powerdns</a><a rel='nofollow'>dns</a><a rel='nofollow'>linux</a>                    </div>                                            <h2>Job description</h2>                <div><strong>Don’t just go to work.&nbsp;Thrive.</strong><br>Here are people committed to openness, a rebellious business spirit and they have the will to revolutionize the market.<p></p><p><strong>We are eMail</strong><br>Worldwide companies like: 1&amp;1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace use our &quot;white label&quot; products for eMail and collaboration.</p><p><strong>Open people for an open source!</strong><br>Join the force which works on products to support people in their daily digital life without sacrificing their personal freedom and protect their data.</p><p>Daily activities alternate between working on customer issues and actual &quot;Professional Services for customer implementations (both on &amp; off-site). As a Solutions Engineer (with a focus on PowerDNS) you will work closely with the PowerDNS development team, as well as other parts of Open-Xchange and Dovecot development, sales and Product Management teams form within the European Service team.</p><p>We think Support &amp; Implementation is a great step into a promising career. We are specifically looking for employees willing to learn quickly while delivering great support and service. Keeping an eye towards growing within the Global Services department or into different roles in the larger Open-Xchange organisation. In other words, this position is a great opportunity for your personal development. There will be a close and intimate cooperation between PowerDNS and OX Professional Services regarding the &nbsp;support, implementation and development roles.</p><p><strong>Your passion / Your job</strong></p><ul><li>Implementation &amp; Support of PowerDNS technology for our customers</li><li>Investigate and reproduce complex custom issues, test solutions, help implement fixes</li><li>Providing technical support during complex deployment projects and roll-outs</li><li>Evaluation of customer environment, creation of custom integration concepts, and writing SOWs for actual implementations.</li><li>Customer communication and managing (technical) relationship</li><li>Work closely with PowerDNS (including Open-Xchange and Dovecot) development, sales, and product management teams</li><li>Manage architecture, design and documentation for customer solutions &amp; projects</li><li>Hands on training of customer’s administrators and support team</li></ul><p><strong>What do you bring to the table</strong></p><ul><li>Good knowledge of DNS technologies and solutions (Open source and commercial).</li><li>Knowledge and experience with PowerDNS is a bonus</li><li>Experience in system administration or support of Unix or Linux systems, ideally in the hosting/telco market.</li><li>In-depth knowledge of and demonstrated experience with Linux systems</li><li>Experience with System architecture and design (design and analysis of complex setups in heterogeneous environments).&nbsp;</li><li>Good understanding of large, complex networking environments (IP, Anycast, Telco mobile and broadband networks, etc.)</li><li>Hands-on experience with Ansible, cloud technologies and databases (MySQL, PostgreSQL, Redis and sqlite)</li><li>Knowledge of Lua script and/or C++ is a bonus.</li><li>Ability to work independently</li><li>Ability to travel international</li><li>Excellent verbal and written communication skills in English</li><li>multi-lingual candidates (in German, Dutch, French, Spanish or Italian) will get bonus points</li><li>Experience with mission critical systems</li><li>knowledge of large scale E-Mail systems is a bonus&nbsp;</li></ul><p><strong>What do we offer</strong></p><ul><li>Training and personal development</li><li>Home Office and the opportunity to work from one of the many offices we define as the OX world</li><li>The latest in IT equipment</li><li>Flat hierarchies combined with &quot;Open Door&quot; policies</li><li>Personal development in a dynamic environment</li></ul><p>                </p></div>                                    <div>                                    <div>                                        <div>        <a rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Open-Xchange GmbH</h2>            <div><p><strong>Open-Xchange / Open people for Open source</strong></p><p>With some 250+ employees Open-Xchange develops a Open-Source-Software addressing communication, collaboration and office-productivity worldwide. Sales are made through Internet service providers, hosting, telecommunication and cable providers, which offer their customers the Open-Xchange solution as SaaS (Software as a Service). More than 200 million users adopted Open-Xchange software for their private and business communications via partners such as 1 &amp; 1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace.</p><p>The core offer is named <a href='https://www.open-xchange.com/portfolio/ox-app-suite/' rel='nofollow'>OX App Suite</a> with applications for processing e-mails, contacts and appointments, which can be extended by functions like: <a href='https://www.open-xchange.com/portfolio/ox-drive/' rel='nofollow'>OX Drive</a> for managing and synchronizing documents, images, photos and movies; <a href='https://www.open-xchange.com/portfolio/ox-documents/' rel='nofollow'>OX Documents</a> for text processing, spreadsheets and presentations and <a href='https://www.open-xchange.com/portfolio/ox-guard/' rel='nofollow'>OX Guard</a> for encrypting emails and files. Software from <a href='https://www.open-xchange.com/portfolio/dovecot-pro/' rel='nofollow'>Dovecot</a> and <a href='https://www.open-xchange.com/portfolio/ox-powerdns/' rel='nofollow'>PowerDNS</a> are complementing Open-Xchange's portfolio.</p><p>We want to constantly advance and are looking for people who have fun working with the latest technologies in an international team. There are locations in Hamburg, Bremen, Dortmund, Cologne, Olpe and Nuremberg as well as Finland, France, the Netherlands, Italy and Spain. International offices are in Tokyo, Sydney and Palo Alto which represents the distributed team in the USA.</p><p>If you are interested, please contact Jochen F. Schude for further information - or send us your paperless application with a cover letter including the job ID, tabular CV, certificates, salary request and the earliest possible date of entry by e-mail to recruiting at open-xchange.com.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Homeoffice</span>                            </li>                            <li>                                <span></span>                                <span>Flache Hierarchien</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Arbeitszeiten</span>                            </li>                            <li>                                <span></span>                                <span>Modernste Technik</span>                            </li>                            <li>                                <span></span>                                <span>Work-Live-Balance</span>                            </li>                            <li>                                <span></span>                                <span>Culture-Mixed</span>                            </li>                    </ul>                "
  },
  {
    "id": "eaSODohXQferXytXfP7xzg",
    "url": "https://stackoverflow.com/jobs/175186/requirements-engineer-technical-solution-grandcentrix-gmbh?a=WKCuZyahxuw",
    "title": "REQUIREMENTS ENGINEER | TECHNICAL SOLUTION ARCHITECT (M/W) at grandcentrix GmbH (Köln, Deutschland) ",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 24, 2018 9:06:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Junior, Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud Services, Mobile, Software Development</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>process</a><a rel='nofollow'>domain-driven-design</a><a rel='nofollow'>architecture</a><a rel='nofollow'>development-environment</a><a rel='nofollow'>documentation</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>Hi. Wir sind grandcentrix!</strong></p><p>Unser großartiges Team aus über 140&nbsp;<strong>Infrastructure- und Cloud Architekten, Front- und Backend Entwicklern, User Experience Designern und agilen Projektmanagern</strong>&nbsp;macht uns zum erfolgreichsten, kreativen Systemintegrator im deutschsprachigen Raum. Wir sind auf die Entwicklung&nbsp;<strong>vernetzter Produkte</strong>&nbsp;spezialisiert. Die Engagements, in denen wir aktiv werden, suchen wir uns sorgfältig aus, denn für uns zählt die&nbsp;<strong>technische Herausforderung</strong>&nbsp;und der&nbsp;<strong>Spaß an unserer Arbeit</strong>. Als Partner für führende&nbsp;<strong>Premium-Brands der Industrie</strong>&nbsp;sind wir die Köpfe hinter spannenden und innovativen Produktionen im Umfeld von Smart Home und des Internet of Things.</p><p>Zur sofortigen Verstärkung suchen wir -&nbsp;<strong>für unser HQ in Köln und Dortmund und Remote</strong>-</p><p><strong>REQUIREMENTS ENGINEER | TECHNICAL SOLUTION ARCHITECT (M/W)</strong></p><p><strong>Deine Aufgaben bei uns&nbsp;</strong></p><ul><li>Du siehst dich als Ansprechpartner für den Kunden bei technischen Problemen und löst diese mit Hilfe deines Teams.</li><li>Gemeinsam mit UX erstellst du auf Basis unserer Kundenanforderungen einen Lösungsvorschlag, welcher die Grundlage für die Aufwandsschätzung und das Angebotdurch unser Sales Team bildet.</li><li>Du übersetzt die Anforderungen unserer Kunden in für unsere Entwicklungsteams handhabbare Stories und identifizierst Abhängigkeiten und Zusammenhänge, die bisher nicht aufgefallen sind.</li><li>Du trägst alle notwendigen Informationen zusammen, sodass unsere Entwicklungsteams eine klare Vorstellung hinsichtlich Aufwand und Umsetzung erhalten.</li><li>Du stellst sicher, dass zu jeder Anforderung eine Übersicht aller Abhängigkeiten und Schnittstellen vorliegt, damit die Entwicklungsteams&nbsp;effizient arbeiten können.</li><li>Wo nötig verschaffst du dir einen Überblick über die Dokumentenlage, destillierst die uns betreffenden Aspekte heraus und holst fehlende Informationen proaktiv beim Kunden ein.</li><li>Du überprüfst, ob die bereitgestellten Schnittstellen für uns erreichbar und mit sinnvollen Daten gefüllt sind. Dazu schreibst du auch schon einmal curl Statements und fügst diese unseren User Stories hinzu.</li></ul><p><strong>Was wir uns von dir wünschen</strong></p><ul><li>Ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation.</li><li>Mehrjährige Berufserfahrung als Softwareentwickler, Technical Solution Architect oder Requirements Engineer wäre wünschenswert.</li><li>Hervorragende analytische Fähigkeiten sowie eine systematische und lösungsorientierte Arbeitsweise.</li><li>Einen offenen und klaren Kommunikationsstil – in deutscher und englischer Sprache.</li><li>Eine präzise und verbindliche Ausdrucksweise in der schriftlichen Kommunikation und Dokumentation.</li><li>Kenntnisse in allgemeiner Prozessmodellierung, bspw. in UML&nbsp;sind von Vorteil.</li><li>Verständnis für agile Vorgehensweisen und Methoden, wie Scrum, Kanban oder DDD.</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/175186?reset=False&amp;ra=WKCuZyahxuw&amp;oqs=a%3DWKCuZyahxuw' rel='nofollow'>Apply now</a></div>                                    </div>                        </div>        </div>            <h2>About grandcentrix GmbH</h2>            <div><p><strong>Was wir dir bieten</strong></p><ul><li><p>Vertrauensarbeitszeiten und eine Home-Office-Regelung, bei der du für den Termin mit dem Techniker keinen Urlaub einreichen musst.</p></li><li><p>Aktuelle Arbeitsgeräte und ein inspirierendes, modernes Arbeitsumfeld in attraktiver Atmosphäre.</p></li><li>Innovative Projekte, unbürokratische Strukturen und kurze Entscheidungswege.</li><li><p>Regelmäßig interne Lightning Talks, Hackathons, Kongressbesuche und Meet-ups.</p></li><li><p>Förderung von Weiterbildungen, aktivem Wissensaustausch sowie Mitarbeitertreffen.&nbsp;</p></li></ul><p>Lerne uns einfach kennen und mach dir ein eigenes Bild über uns!&nbsp;</p><p><strong>Neugierig? Schreib uns!</strong></p><p>Wir freuen uns über deine Bewerbung. Schick uns deine Unterlagen sowie deine Gehaltsvorstellung an&nbsp;<a href='mailto:jobs@grandcentrix.net' rel='nofollow'>jobs@grandcentrix.net</a>.</p><p><strong>Nichts passendes gefunden?</strong></p><p>Wir suchen immer nach motivierten Talenten. Schau dir unsere anderen Ausschreibungen auf&nbsp;<a href='https://www.grandcentrix.net/jobs/' rel='nofollow'>https://www.grandcentrix.net/jobs/</a>&nbsp;an oder bewirb dich einfach initiativ.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Competitive salary and permanent contracts</span>                            </li>                            <li>                                <span></span>                                <span>Great work atmosphere</span>                            </li>                            <li>                                <span></span>                                <span>Home office and remote work</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working-hours</span>                            </li>                            <li>                                <span></span>                                <span>Softdrink flatrate, hot &amp; cold</span>                            </li>                            <li>                                <span></span>                                <span>Open &amp; transparent communication</span>                            </li>                            <li>                                <span></span>                                <span>Free drinks, hot &amp; cold</span>                            </li>                            <li>                                <span></span>                                <span>Company Pension Scheme</span>                            </li>                            <li>                                <span></span>                                <span>TaxSaver Tickets and Bike to Work Plans</span>                            </li>                            <li>                                <span></span>                                <span>Sunroof, Seaview &amp; icecream flat</span>                            </li>                    </ul>                "
  },
  {
    "id": "9LhfdSkNSSyRASkQGiLGgA",
    "url": "https://stackoverflow.com/jobs/166955/mobile-developer-with-xamarin-jbs-custom-software-solutions?a=TZtr6PxbB4s",
    "title": "mobile developer with xamarin at JBS Custom Software Solutions  ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:app-store/mobile/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:xamarin/mobile/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=36, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=20}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2018 1:08:14 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <div>                        <div></div>                        <div>                            <h3>High response rate</h3>                            <div>This company responds to the majority of applications it receives.</div>                        </div>                    </div>                                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>javascript</a><a rel='nofollow'>ios</a><a rel='nofollow'>android</a><a rel='nofollow'>xamarin</a>                    </div>                                            <h2>Job description</h2>                <div><p>JBS has an opening for a well-rounded mobile developer with Xamarin experience.<br><strong>Required</strong></p><ul><li>3+ years working with iOS and Android native mobile development</li><li>1+ years working with Xamarin</li><li>Strong knowledge of javascript &nbsp;</li><li>Experience with react and react native</li><li>Experience working with CSS and PSD/Sketch UI designs</li><li>Published apps in App Store and/or Google Play Store</li><li>Experience with devOps (automated deployments and continuous integration)</li><li>Strong computer science background</li><li>3+ years working with relational database systems</li><li>Experienced in integrating with APIs, persisting data, caching and refreshing</li><li>Strong communication skills, both written and verbal</li><li>Ability to accurately estimate work</li><li>Commitment to provide quality completed deliverables with well-factored, maintainable code</li><li>Experience with VCS (git, hg or svn)</li></ul><p><strong>Nice To Have</strong></p><ul><li>Experience with event based architectures</li><li>Experience in e-commerce development</li><li>Experience building and designing REST-based web services using JSON</li><li>Experience with containerization</li><li>Experience with serverless framework</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/166955?reset=False&amp;ra=TZtr6PxbB4s&amp;oqs=a%3DTZtr6PxbB4s' rel='nofollow'>Apply now</a></div>                                    </div>                        </div>        </div>                    <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Remote Work</span>                            </li>                    </ul>                "
  },
  {
    "id": "amgnsB7UQVeqVzLO8BiuXQ",
    "url": "https://stackoverflow.com/jobs/168334/solution-architect-web-crawling-scrapinghub?a=Us9bzxPxYEo",
    "title": "Solution Architect - Web Crawling at Scrapinghub  ",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:scrapy/python/8",
      "DBG_TECH1:techWeightMap:{python=10, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2018 1:08:14 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Big Data</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>python</a><a rel='nofollow'>web-scraping</a><a rel='nofollow'>scrapy</a><a rel='nofollow'>architecture</a><a rel='nofollow'>web-crawler</a>                    </div>                                            <h2>Job description</h2>                <div><p>Scrapinghub is looking for a motivated Solution Architect to further accelerate the rapid growth&nbsp;Scrapinghub&nbsp;has seen in the last 3+ years.</p><p>As a Solution Architect, you will be in charge of the requirement analysis phase of our Professional Services projects. You will gather the customer requirements, analyze and provide technical solutions to our customers and our internal teams for development and delivery. You will be pivotal in translating customer and technical project requirements across various internal and external teams. &nbsp;&nbsp;</p><p><strong>Job Responsibilities:</strong></p><ul><ul><li>Meet with customers for requirement collection and provide technical consultation and advice.</li><li>Deconstruct raw business / customer &nbsp;requirements and identifying the actual business problems the customer is trying to solve.</li><li>Translate customer requirements into a viable business solution, execute the necessary; conduct deep technical investigation, propose the best approach and solution inclusive of effort, cost estimates, and occasionally project timelines which fit the customer’s business goals and expectations.</li><li>Build Proof of Concepts, to showcase technical expertise in data acquisition projects, assess feasibility, refine scope, and &nbsp;achieve project collaboration and engagement</li><li>Mentor developers to build a strong team of Solution Architects.</li><li>Ensure you are up-to-date on Scrapinghub products and service offerings which will enable you to provide an architectural solution that includes the latest capabilities and provide value to our customers</li><li>Create, write and present customer proposals and ensure it completely captures the technical requirements for the solution proposed</li><li>Take ownership of learning upcoming product and service capabilities by requesting training sessions from the concerned team.</li><li>Work with subject matter experts to provide better solutions.</li></ul></ul><p><strong>About you:</strong></p><ul><ul><li>You have solid knowledge and understanding of aspects of web crawling using Python &amp; Scrapy.</li><li>You have strong client and customer facing experience - minimum of 3 years experience in a similar position within a technical environment</li><li>You have excellent communication skills, both written and verbal, and are comfortable in document writing, both technical and non technical</li><li>You possess excellent presentation skills and experience in articulating technical and business solutions to both technical and non technical audiences.</li><li>You have the ability to articulate and convey technical solutions effectively and clearly to internal teams and stakeholders.</li><li>You have the zeal to understand customer business requirements really well by asking the right questions.</li><li>You have the confidence to assert and justify the technical feasibility of a requirement, to make decisions, negotiate scope, and assess risk.</li><li>You have solid experience of mentoring teams preferably software developers.</li><li>You demonstrate proven knowledge and experience of estimation, planning, and project management.</li><li>You are well organized, self-motivated, and communicative -- an essential skill in a remote team.</li></ul></ul><p><strong>Bonus points for:</strong></p><ul><ul><li>You have experience in web crawling in any other tools.</li><li>A proven track record of working with a remote team</li><li>Knowledge of and interest in web crawling, data mining and information retrieval</li></ul></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://jobs.lever.co/scrapinghub/bb5873b0-b5df-4897-9757-df338951800f/apply' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Scrapinghub</h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of 120 Shubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Shubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Autonomy to make the role your own, supported by great people</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Remote working</span>                            </li>                            <li>                                <span></span>                                <span>Paid time off</span>                            </li>                            <li>                                <span></span>                                <span>Paid open source work</span>                            </li>                            <li>                                <span></span>                                <span>Global team meet ups</span>                            </li>                    </ul>                "
  },
  {
    "id": "Dy8TYQqmRbqMNaM_aqjFgw",
    "url": "https://weworkremotely.com/remote-jobs/oasis-digital-solutions-inc-node-js-developer-enterprise-integration-contractor",
    "title": "Oasis Digital Solutions Inc.: Node.js developer - enterprise integration - contractor",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:javascript/frontend/3",
      "DBG_TECH1:k/t/w:javascript/nodejs/3",
      "DBG_TECH1:k/t/w:node.js/nodejs/26",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=29, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2018 5:33:35 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Node.js developer - enterprise integration - contractor</h2>      <h4>Posted Jun 18</h4>    <h3>      <span>Oasis Digital Solutions Inc.</span><br>      <span>Headquarters: St. Louis, MO</span><br>        <a href='https://oasisdigital.com/' rel='nofollow'>https://oasisdigital.com/</a>      <br>      <a rel='nofollow'>View all Oasis Digital Solutions Inc. jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>Oasis Digital is looking for Node developers for a complex project involving enterprise integration of multiple pre-existing systems using microservices. Full staff experience is appreciated, but most of the problems to be solved are in backend development. You will be working on a project an important Oasis Digital customer, working closely with both Oasis Digital and customer developers.</span></div><div><br></div><div><span>Key qualifications</span></div><div><br></div><ul><li><span>2+ years of Node experience</span><br><br></li><li><span>3+ years of JavaScript experience</span><br><br></li><li><span>Comfortable with the asynchronous nature of JavaScript and Node</span><br><br></li><li><span>Able to explain and assist other developers with Node development</span><br><br></li><li><span>Eager to both collaborate extensively and produce independently</span><br><br></li><li><span>BS degree in a technical field strongly preferred</span><br><br></li><li><span>Live and work in the USA - while the work is remote, for this project it must be remote only within the USA.</span><br><br></li><li><span>Fluently communicate in English, but also comfortable interacting with developers around the world</span><br><br></li><li><span>Experience with integrating disparate systems</span><br><br></li><li><span>Have your own workspace</span><br><br></li><li><span>Comfortable with online meetings using video chat and screen sharing</span><br><br></li></ul><div><span>Essentials of the job</span></div><div><br></div><ul><li><span>Contractor, working remotely from your own location</span><br><br></li><li><span>Likely 6+ months</span><br><br></li><li><span>35+ hours per week</span><br><br></li><li><span>Hourly, contractor pay - occasionally &gt;40 hours is possible</span><br><br></li><li><span>95% remote</span><br><br></li><li><span>Visit us in St. Louis, once or twice a year</span><br><br></li><li><span>Daily meetings working out the details of complex integrations - so you must be available during the workday.</span><br><br></li><li><span>You can flexibly schedule your own working days and times - though this is considerably constrained by the need to meet with others.</span><br><br></li></ul><div>&nbsp;</div><div><br></div><div><span>Technology stack</span></div><div><br></div><ul><li><span>Node</span><br><br></li><li><span>JavaScript</span><br><br></li><li><span>Microservices</span><br><br></li><li><span>Docker</span><br><br></li><li><span>Angular</span><br><br></li></ul><div><span>Our hiring process</span></div><div><br></div><ol><li><span>We review your resume and answers to a few questions</span><br><br></li><li><span>~15 minute initial video chat discussion</span><br><br></li><li><span>~45 minute deeper technical discussion and interview</span><br><br></li><li><span>~60 minute remote shared coding session, where we see you in action and you get to know us a bit more</span><br><br></li><li><span>final &quot;HR style&quot; interview</span><br><br></li><li><span>background check and start date</span><br></li></ol><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply at the following page:  <a href='https://oasisdigital.applytojob.com/apply/00TJBw6WR4/Nodejs-Developer-Enterprise-Integration-Remotecontract' rel='nofollow'>https://oasisdigital.applytojob.com/apply/00TJBw6WR4/Nodejs-Developer-Enterprise-Integration-Remotecontract</a></p>  </div>"
  },
  {
    "id": "EyocmcWaQyGfbQMWfz3FMQ",
    "url": "http://jobmote.com/jobs/13971-solutions-consultant-remote",
    "title": "Solutions consultant (Remote)",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2018 2:20:33 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Solutions consultant (Remote) - Jobmote<div><div><h2>Solutions consultant (Remote)</h2><h5>Capita Resourcing</h5></div></div><div><div><div><div></div></div><div><div><div><p>Solutions Consultant needed for remote work and client visits in the midlands (South of Birmingham). As the Solutions Consultant, You will be joining a technology leader in the development and implementation of real-time mobile workforce management.<br><strong>Role description</strong><br>Utilise deep product understanding and apply this..... click apply for full job details </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "BjgOkwCAQc62HC2xDaV9DQ",
    "url": "https://stackoverflow.com/jobs/169521/solutions-architect-nlp-and-machine-learning-critical-mix?a=UQPpTuM9Aly",
    "title": "Solutions Architect - NLP and Machine Learning at Critical Mix (Perrysburg, OH) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=36, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 12, 2018 8:49:30 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Integrated Marketing Solutions</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>reactjs</a><a rel='nofollow'>go</a><a rel='nofollow'>python</a><a rel='nofollow'>watson-conversation</a><a rel='nofollow'>php</a>                    </div>                                            <h2>Job description</h2>                <div><p>&nbsp;&nbsp; Critical Mix is looking for a&nbsp;<strong>Solutions Architect</strong>&nbsp;to work with our teams across the United States and is passionate on simplifying the complex with digital innovation.&nbsp; Success in this position will require some unique knowledge in the areas of natural language processing services such as Watson and Lex as well as expertise in machine learning technologies. Of course, none of this really functions without an exceptional and intuitive BOT interface for the end user.</p><p><strong>Responsibilities:</strong></p><ul><li>Take technical lead on the team in the ML/NLP domain and keep up with latest industry solutions.</li><li>Design, develop, validate and deploy proposed ML/NLP solutions both internal and client facing.</li><li>Innovate and&nbsp;build new features for our products including chatbots and virtual assistants.</li><li>Coaching and mentoring a team of diverse and talented software engineers.</li><li>Interfacing with senior management and stakeholders to define requirements and take the lead on operational and technical projects in a fast-paced environment.</li></ul><p><strong>Requirements</strong></p><ul><li>Advanced degree Computer Science, Statistics, Mathematics, or related area&nbsp;</li><li>3+ Years of experience building software products as an Architect</li><li>1+ years ML/NLP domain experience.</li><li>Experience with Python or Go programming languages</li><li>Knowledge of JavaScript frameworks like ReactJS, React Native, AngularJS</li><li>Experience with Microservices and Resftul API’s</li><li>Familiarity with a major machine learning/deep learning frameworks a plus (Keras, Tensorflow, Torch, Spark-ML)</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/169521?reset=False&amp;ra=UQPpTuM9Aly&amp;oqs=a%3DUQPpTuM9Aly' rel='nofollow'>Apply now</a></div>                                                <div>                                                    <a rel='nofollow'>Ask a question</a>                                                                                                        </div>                                    </div>                        </div>        </div>            <h2>About Critical Mix</h2>            <div><p>Critical Mix provides easy access to highly-targeted global survey respondents, survey programming and data visualization services for market research and consulting firms. Driven by a passion for simplifying data collection, the team at Critical Mix is personally invested in giving clients the ultimate customer service experience.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Health benefits</span>                            </li>                            <li>                                <span></span>                                <span>Flexible schedule</span>                            </li>                            <li>                                <span></span>                                <span>Great work/life integration</span>                            </li>                            <li>                                <span></span>                                <span>Empowerment</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited vacation policy</span>                            </li>                            <li>                                <span></span>                                <span>Competitive compensation</span>                            </li>                            <li>                                <span></span>                                <span>Remote location</span>                            </li>                            <li>                                <span></span>                                <span>Gym memberships</span>                            </li>                    </ul>                "
  },
  {
    "id": "BTH-yN9VS2aKflN3Z7unQA",
    "url": "https://stackoverflow.com/jobs/191793/php-developer-for-m3-solutions-local-time-doctor?a=12jVyi5tFaPm",
    "title": "PHP Developer for M3 Solutions- Local at Time Doctor  ",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR( australia, japan, newzealand)",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/15",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=15, embedded=0, frontend=20}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/Asia"
    ],
    "tagsNames1": [
      "Asia time zones"
    ],
    "tagsNames2": [
      "frontend",
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 10:40:11 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>php</a><a rel='nofollow'>reactjs</a><a rel='nofollow'>javascript</a><a rel='nofollow'>sql</a>                    </div>                                            <h2>Job description</h2>                <div><p>We are seeking the services of a full time, highly skilled and talented PHP developer to join our rapidly growing team at M3 Solutions (<a href='http://www.m3solutions.net.au' rel='nofollow'>http://www.m3solutions.net.au</a>), an Australian software development company that has been operating for 15 years. M3 Solutions is a small team centrally located near the train line in North Sydney where you can make a real difference and work on a variety of projects.</p><p>We are looking to hire someone locally in Sydney however we may consider sponsoring you to work in Australia if we do not find a suitable local candidate. If we are planning to sponsor you then you will need to work remotely from your current location before being sponsored to Australia.</p><p>You will have the opportunity to learn new technologies in a highly collaborative and autonomous environment. You will work with a diverse range of senior stakeholders in an exciting environment with real work-life balance. Progress your career to the next level with a focus on quality code and be part of a great team.</p><p>TO BE THE BEST FIT FOR THIS JOB, YOU MUST BE/HAVE:</p><ul><li>Proven experience working as a PHP developer</li><li>Preference for experience also with Java</li><li>Solid experience with large transactional systems</li><li>Advanced knowledge of SQL</li><li>Practical knowledge of Git</li><li>Comfortable with UNIX/LINUX</li><li>Advanced skills in HTML, CSS, JavaScript (ideally React)</li><li>Experience in Angular 4 framework would be well regarded</li><li>Experience working in agile environment – scrum / Atlassian products</li><li>Proven experience delivering mission critical projects</li><li>Flawless communication skills are essential</li></ul><p>Salary is negotiable depending on experience.</p><p>TO APPLY, please go to this link -&nbsp;<a href='http://time-doctor.breezy.hr/p/57bd5704e6bd-php-developer-for-m3-solutions-local' rel='nofollow'>http://time-doctor.breezy.hr/p/57bd5704e6bd-php-developer-for-m3-solutions-local</a></p><p><strong>ABOUT THE COMPANY:</strong></p><p>M3 Solutions is a software development company that provides automated workflow systems for big multinationals and smaller organisations in Australia. Our solutions have provided efficiency and cost saving technologies for sales, marketing, finance, management reporting and accounting systems. We differentiate ourselves in building custom solutions to fit the customers existing processes.</p>                </div>                                    <div>                                    <div>                                        <div>        <a href='http://time-doctor.breezy.hr/p/57bd5704e6bd-php-developer-for-m3-solutions-local' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>"
  },
  {
    "id": "zJMgoi30Q8O9XAToDR3nnw",
    "url": "https://news.ycombinator.com/item?id=17232896",
    "title": "SEEKING FREELANCER – REMOTE Email: llevitt@iotini.com IoTini is a technology startup working on industrial sensor systems. We offer a complete solution where ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:erlang/other/10",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 12:50:08 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>SEEKING FREELANCER – REMOTE<p>Email: llevitt@iotini.com</p><p>IoTini is a technology startup working on industrial sensor systems. We offer a complete solution where you choose the type of sensors you need, the data you want to visualize and we take care of the rest.</p><p>We are looking for a software engineer with experience in API design, usage and implementation of new networking protocols and basic Linux sysadmin chops. Our systems run mostly on top of Ruby with some Erlang and Javascript on the sides, and on your day to day you will be working with our firmware team to add support for new features on the server side, standarizing communication for different protocols (IP and LoRa) and finding ways to efficiently share, process and visualize data between all of our services.</p><p>Requirements:* 4+ years of professional experience working with Ruby.* Basic knowledge of either Erlang or Javascript (client and server side).* Experience in architecture and design of non-monolithic systems.* Decent understanding of different types of datastores and their their pros/cons (we use Postgres, MongoDB and Mnesia).* You can setup, secure and maintain Linux servers and cloud instances.</p><p>Bonus:* Hardware/electrical engineering background.* Previous experience working on a fully remote team.* Open source contributions, having an interesting GitHub profile or public personal projects.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "y0qwAs9rSwCgx7h8P-eyBQ",
    "url": "http://jobmote.com/jobs/11951-azure-cloud-architect-100-remote-nearshore-project-swiss-client",
    "title": "Azure Cloud Architect ( 100% Remote ) Nearshore Project - Swiss Client",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 2, 2018 4:21:05 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Azure Cloud Architect ( 100% Remote ) Nearshore Project - Swiss Client - Jobmote<div><div><h2>Azure Cloud Architect ( 100% Remote ) Nearshore Project - Swiss Client</h2><h5>Euro Transition Ltd</h5></div></div><div><div><div><div></div></div><div><div><div><p>Azure Cloud Architect ( 100% Remote ) Nearshore Project - Swiss Client - English Speaking Azure Cloud Architect required by our Switzerland based client. This project is 100% remote and can be done from any European Country. Expert in Azure PaaS, Serverless (Azure Functions) Ideally also expert in IaaS. Powershell expert design secure and compliance by design components together with Solution architect, E2E architects and Digital Security. Your initial contract will run until the end of the year with a view to extend, please send a copy of your latest profile, we have interview slots for this week still. Azure Cloud Architect ( 100% Remote ) Nearshore Project - Swiss Client - English Speaking - provided by Dice AZURE, CLOUD, IAAS, PAAS, POWERSHELL </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "pLr99McfSiOK454VUR_aEQ",
    "url": "https://stackoverflow.com/jobs/190523/contract-remote-microservice-security-architect-twin-technologies?a=11TwjXzR2oLu",
    "title": "Contract Remote Microservice Security Architect (located in the US) at Twin Technologies  ",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:dropwizard/java/8",
      "DBG_TECH1:k/t/w:java/java/6",
      "DBG_TECH1:k/t/w:java/mobile/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jboss/java/8",
      "DBG_TECH1:k/t/w:jpa/java/8",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=3, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=43, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 7:40:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>DevOps, System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Consulting, Design, Digital Agency</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>java</a><a rel='nofollow'>security</a><a rel='nofollow'>jenkins</a><a rel='nofollow'>devops</a><a rel='nofollow'>docker</a><a rel='nofollow'>sysadmin</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>Company Description</strong></p><p>We dream, create, and deliver digital solutions that transform what’s possible for enterprises, government institutions and organizations and partner with our clients through every stage of digital transformation: from strategy, to activation, to delivery to decrease risk and increase speed-to-market.</p><p>We are Remotely Awesome! We understand that quality of life directly impacts quality of work, and we know that talent is all over the place. Our team is not limited by geography, and seeks top talent where it exists. Our remote work model encourages independent thinking, requires professional discipline, and contributes to a high quality work/life balance.</p><p>What’s does this mean for you? Many of our team members have the flexibility to work from anywhere in the United States, and is provided the tools and infrastructure to successfully collaborate across the globe. We will continue to grow and evolve with the market and provide an environment where creativity, leadership, mentoring, planning, and resources are in place to achieve our shared goals.</p><p><strong>Job Description</strong></p><p>The Security Architect will serve as part of a development team supporting both established projects and creating from the ground up. The ideal candidate is an experienced leader and team player with a background in security and a passion for delivering well through DevOps best practices.&nbsp; They are passionate about technology and committed to lifelong learning, possessing the ability to apply their technical knowledge, skills and experience to solve complex/real-world problems.</p><p><strong>Technologies and Disciplines:</strong></p><p>We use several different technologies in our development stack across multiple clients and projects. We continuously evaluate new technologies to make sure we are fully aware and always using the right tool for the job. Examples of the technologies we currently use include:</p><ul><li>Java, JPA, Dropwizard, JBoss, Javascript</li><li>Docker, Kubernetes, Linkerd, Consul</li><li>SQL Server, Oracle</li><li>Jenkins, Maven, Stash, Git</li><li>AWS EC2, Lambda, S3</li></ul><p><strong>Responsibilities:</strong></p><ul><li>Solving complex problems with elegant and maintainable solutions</li><li>Designing, implementing, and evaluating microservice architecture implementations to improve delivery and support new features</li><li>Delivering back-end and tooling solutions using modern Java frameworks</li><li>Developing and bringing security processes in line with current best practices</li><li>Integrating existing legacy Java enterprise system with microservice/mesh architecture based APIs</li><li>Working with the team to continuously improve security across all areas of the software project</li><li>Participating on an agile / scrum software delivery team</li></ul><p><strong>Qualifications</strong></p><ul><li>A strong foundation in computer security and authz &amp; authn best practices</li><li>5-10+ years software engineering experience</li><li>1-2+ years experience integrating with Identity and Access Management frameworks, or security policy and enforcement toolsets.</li><li>Secured APIs and services within SOA or microservice architectures</li><li>Experience with Kubernetes resource APIs and related CLI tools</li><li>Experience with running and defining Docker containers</li><li>Comfortable using and configuring software on Linux based operating systems</li><li>Familiar with service mesh proxies like Istio/Envoy or Linkerd</li><li>Understands best practices for JWT algorithm choice and token claim assertions</li><li>Capable of integrating security related components into CI/CD automation pipelines using tools like Spinnaker or Jenkins</li><li>BS in Computer Science or equivalent experience</li><li>Applicants&nbsp;<strong>MUST&nbsp;</strong>be US&nbsp;<strong>Citizens</strong>, due to the nature of the work</li><li>Applicants&nbsp;<strong>MUST&nbsp;</strong>live in the US, with a remote home office</li><li>This is a contract position to start</li></ul><p><strong>Additional Information</strong></p><p>Twin Technologies offers a competitive and comprehensive employee compensation and benefits package that includes medical, dental and vision insurance, LTD, STD, life insurance, 401k program with company match, and an unlimited PTO plan</p><p>Twin Technologies is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, or protected veteran status.</p>                </div>                                    <div>                                    <div>                                        <div>        <a href='http://smrtr.io/U9rkAQ' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Twin Technologies</h2>            <div><p>At Twin Technologies, Inc. we dream, create, and deliver digital solutions that transform what’s possible for enterprises, government institutions and organizations.&nbsp;We partner with our clients through every stage of digital transformation: from strategy- to activation - to delivery, while we decrease risk and increase speed-to-market.</p><p>Twin has been a “Remotely Awesome” company for the past 14+ years and continues to master best practices and strategies around collaboration, communication, and tools, across our high-performing distributed teams.</p><p>What’s does this mean for you?&nbsp;&nbsp;We will continue to grow and evolve with the market to provide an environment where creativity, leadership, mentoring, and some of the best resources are in place to achieve high standards in the consulting and digital space</p><p>You will work on a variety of projects that integrate digital designs into products, services and environments.&nbsp;</p><p>Twin Technologies offers a competitive and comprehensive employee compensation and benefits package, which includes medical, dental, and vision insurance, LTD, STD, life insurance, a 401k plan with company match, and an unlimited PTO plan.</p><p>Twin Technologies is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, or protected veteran status.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>annual stipend for hardware</span>                            </li>                            <li>                                <span></span>                                <span>progressive 401k matching plan</span>                            </li>                            <li>                                <span></span>                                <span>generous health and dental coverage</span>                            </li>                            <li>                                <span></span>                                <span>growth, support, and mentorship</span>                            </li>                            <li>                                <span></span>                                <span>company hosted and sponsored events</span>                            </li>                            <li>                                <span></span>                                <span>training and conferences stipend</span>                            </li>                            <li>                                <span></span>                                <span>telecommuting reimbursement program</span>                            </li>                            <li>                                <span></span>                                <span>unlimited PTO</span>                            </li>                            <li>                                <span></span>                                <span>work remote from home office</span>                            </li>                            <li>                                <span></span>                                <span>work with amazing people</span>                            </li>                    </ul>                "
  },
  {
    "id": "ie2u4B0BSvaPV9gKvh5YEA",
    "url": "https://stackoverflow.com/jobs/190239/security-contractor-surge?a=11NCcswYTVgQ",
    "title": "SECURITY CONTRACTOR at Surge  ",
    "tags": [
      "DBG:surround``5N(  OR( 2N(work,remot), work 2W from 2W home), 2N( OR(zero, no, avoid), commut)  )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 7:40:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>security</a>                    </div>                                            <h2>Job description</h2>                <div><ul><li>Excellent verbal and written communication skills</li><li>Strong knowledge of NIST SP 800-53 &amp; SP 800-30</li><li>Experience in conducting audits based on NIST Cyber Security Framework &amp; NIST security controls</li><li>Experience in developing technical risk management framework and managing security risk assessments</li><li>Must have CISSP</li></ul><p>Sorry, No Visas. Must be located in the US and/ or Canada.</p><p>Background verification required.</p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/190239?reset=False&amp;ra=11NCcswYTVgQ&amp;oqs=a%3D11NCcswYTVgQ' rel='nofollow'>Apply now</a></div>                                    </div>                        </div>        </div>            <h2>About Surge</h2>            <div><p>Surge is&nbsp;a leading provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies. Founded in 2007, and listed on the Inc. 5000 list of America's fastest-growing companies for five straight years, the Surge team has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals. Simply put, Surge offers America's best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Great Pay</span>                            </li>                            <li>                                <span></span>                                <span>Choose Your Hours</span>                            </li>                            <li>                                <span></span>                                <span>Work From Home</span>                            </li>                            <li>                                <span></span>                                <span>Work With Happy People</span>                            </li>                            <li>                                <span></span>                                <span>Zero Commute</span>                            </li>                            <li>                                <span></span>                                <span>See Your Family More</span>                            </li>                            <li>                                <span></span>                                <span>Travel While You Work</span>                            </li>                            <li>                                <span></span>                                <span>Software Provided</span>                            </li>                    </ul>                "
  },
  {
    "id": "VXD_39wlSVSoDUglOaERIw",
    "url": "http://jobmote.com/jobs/11874-engagement-security-lead-bristol-london-or-remote-100k",
    "title": "Engagement Security Lead Bristol, London or Remote £100k",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 4:20:25 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Engagement Security Lead Bristol, London or Remote £100k - Jobmote<div><div><h2>Engagement Security Lead Bristol, London or Remote £100k</h2><h5>Oliver James Associates</h5></div></div><div><div><div><div></div></div><div><div><div><p>Engagement Security Lead | An interesting opportunity has just opened up for an Engagement Security Lead to undertake a unique role with a FTSE 100 Financial Services organisation who have a global reach</p><p>Engagement Security Lead | Bristol, London or Remote| £100k</p><p>Engagement, Security, CISO, Stakeholder Engagement, Cyber, Security, Leadership, Experience.</p><p><strong>The Role</strong></p><p>Engagement Security Lead | An interesting opportunity has just opened up for an Engagement Security Lead to undertake a unique role with a FTSE 100 Financial Services organisation who have a global reach. The Engagement Security Lead can be based out of either Bristol, London or can work remotely and will be responsible for managing and contributing towards the delivery of change initiatives within the UK CISO function, whilst also providing guidance and oversight to ensure that all business areas remain compliant with security standards. This role will suit a self-starter who has previous experience within a leadership role, in a security and risk conscious environment.</p><p><strong>Engagement Security Lead Requirements</strong></p><ul><li>Excellent understanding of IT Risk and Risk Management</li><li>Experience of risk assessments across change initiatives</li><li>Ability to multi-task and to deliver against tight deadlines, under pressure</li><li>Ability to drive the right culture and behaviour in response to information around vulnerabilities etc</li><li>Extensive experience of working in a security-oriented role</li><li>Strong leadership skills</li><li>Stakeholder engagement and relationship building with C-suite professionals</li><li>Willingness to travel</li></ul><p>This role is urgent and we will be shortlisting for interview ASAP so do not miss out - please apply now for immediate consideration.</p><p>In addition to Bristol and London, this role can also be REMOTE. In exchange for your expertise, there is a salary of up to £100,000 on offer plus benefits.</p><p>Engagement, Security, CISO, Stakeholder Engagement, Cyber, Security, Leadership, Experience.</p><p>Engagement Security Lead | Bristol, London or Remote| £100k</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "uiuVp9Q3SMacFtuDqkGp-g",
    "url": "https://remote.com/jobs/browse/preview/security-risk-officer",
    "title": "Security Risk Officer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 10:10:24 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION: <br />Belgium<br /> (Partial remote)<br /><br />Anywhere in<br />Belgium<br /><br /><br />EXPERIENCE: intermediate<br /><br />COMPANY: Sogeti Belgium; 50-75 employees; 50-75% remote;<br /><br />You identify, analyse and report information security risks. You supply the Information Security requirements for IT projects and take care of the follow-up.<br /><br />Information Risk Management<br /><br />Setting up and maintaining an Information Risk Management framework<br />Incorporation of information risk management processes in the existing business and IT processes.<br />Setting up and maintaining an information risk registry.<br />The active execution, monitoring and adjusting of information risk analysis (Business Impact Assessments, Threat & Vulnerability Assessments)<br />Guiding business about their availability requirements versus active disaster recovery capabilities.<br /><br />IT Risk Management<br /><br />Setting up and maintaining an IT risk management framework<br />Defining, organizing and applying IT risk analysis, treatment and monitoring processes.<br />The active execution, monitoring and adjusting IT risk analyses.<br />Setting up and maintaining an IT risk register.<br />Setting up and maintaining relationships<br /><br />Information Security Management<br /><br />Develop and enhance Policies, Standards, Procedures and Guidelines<br />Leading in the adoption, approval and maintenance of this corporate Information Security framework<br />Operational coordination and follow-up of several projects and initiatives<br />Handling of information- or cybersecurity incidents and coordinate forensics activities<br /><br />- Bachelor's degree or equivalent experience<br />- 3+ years of relevant experience in risk management and information security<br />- Knowledge of ISO2700x, ISO31000, COBIT5, ITIL, …<br />- Experience with assessing and managing IT and/or Information Risk<br />- Broad knowledge of IT processes and technology<br />- Knowledge of security architectures and controls<br />- Knowledge of ISF IRAM is a plus<br />- Experience in managing and overseeing security in third party service providers.<br />- Certifications: CISSP, CISM, CISA or CRISC is a plus<br />- Problem analysis and conflict management<br />- You are client-oriented and you have good relational skills<br />- Spoken and written fluency in English and Dutch or French, with a passive understanding of Dutch and French<br /><br />What's in it for you?<br /><br />Sogeti is the perfect place to bring your passion for IT into play and learn new skills.<br /><br />You will be given the opportunity to develop your career through working on interesting projects, our internal training & development program, attend training courses to broaden your knowledge and obtain certifications. That’s how we boost your personal career and encourage life-long learning in your area of expertise!<br /><br />Your evolution will be monitored closely by your operations manager, a counselor and your own HR business partner.<br /><br />Sogeti is also known for lot of fun, an open minded company environment and where the informal communication culture are part of its DNA. You can also count on an attractive salary package and fringe benefits (e.g. company car, personal flex plan,…)."
  },
  {
    "id": "HLLoe3ALRA21FGlrUnfPMw",
    "url": "https://remote.com/jobs/browse/preview/security-architect-6",
    "title": "Security Architect",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 10:07:36 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION: <br />Belgium<br /> (Partial remote)<br /><br />Anywhere in<br />Belgium<br /><br /><br />EXPERIENCE: expert<br /><br />COMPANY: Sogeti Belgium; 50-75 employees; 50-75% remote;<br /><br />A Security Architect designs, builds and oversees the implementation of network and computer security for an organization.<br /><br />As a senior-level employee, you’ll be responsible for creating complex security structures – and ensuring they work.<br /><br />Since this is a “big-picture” job, you may be required to:<br /><br />Acquire a complete understanding of a company’s technology and information systems<br />Plan, research and design robust security architectures for any IT project<br />Perform vulnerability testing, risk analyses and security assessments<br />Research security standards, security systems and authentication protocols<br />Test final security structures to ensure they behave as expected<br />Provide technical supervision for (and guidance to) a security team<br />Define, implement and maintain corporate security policies and procedures<br />Respond immediately to security-related incidents and provide a thorough post-event analysis<br />Update and upgrade security systems as needed<br /><br />- You have a Master degree or equal by relevant experience<br />- 10+ years of relevant experience<br />- Knowledge of GDPR requirements<br />- Affinity with SAP & Microsoft Solutions<br />- Risk assessment procedures, policy formation, role-based authorization methodologies, authentication technologies and security attack pathologies<br />- Windows, UNIX and Linux operating systems<br />- Practices and methods of IT strategy, enterprise architecture and security architecture<br />- Network security architecture development and definition<br />- Knowledge of third party auditing and cloud risk assessment methodologies<br />- You’re a strategic problem-solver and have good communication skills<br />- You speak English and French or Dutch<br /><br />What's in it for you?<br /><br />Sogeti is the perfect place to bring your passion for IT into play and learn new skills.<br /><br />You will be given the opportunity to develop your career through working on interesting projects, our internal training & development program, attend training courses to broaden your knowledge and obtain certifications. That’s how we boost your personal career and encourage life-long learning in your area of expertise!<br /><br />Your evolution will be monitored closely by your operations manager, a counselor and your own HR business partner.<br /><br />Sogeti is also known for lot of fun, an open minded company environment and where the informal communication culture are part of its DNA. You can also count on an attractive salary package and fringe benefits (e.g. company car, personal flex plan,…)."
  },
  {
    "id": "hU91pW0KQZeo4zUeGDz02g",
    "url": "https://remote.com/jobs/browse/preview/technical-it-security",
    "title": "Technical IT Security",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 30, 2018 11:57:27 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION: <br />Belgium<br /> (Partial remote)<br /><br />Anywhere in<br />Belgium<br /><br /><br />EXPERIENCE: intermediate<br /><br />COMPANY: Sogeti Belgium; 50-75 employees; 50-75% remote;<br /><br />For our security practice we are currently looking for a Technical IT Security Expert. Your main activities are:<br /><br />- Address security expectations<br />- SOC level 3 Investigation and Follow-up of threats / events / incidents escalated from our Security Operations Center: SOC LEVEL 1 / 2<br />- Definining and implementing standards, procedures, tech-specs and security guidelines for the customers platforms and environments<br />- Keep a close collaboration during in order to setup security recommendations and have them implemented<br />- Analysis and manage firewalls request & privileged accesses<br />- Analysis of the security incidents : advise and follow-up on corrective measures to implement in order to resolve IT incidents compromising<br />- Identify and evaluate security risks<br />- Contribute to audit and compliance activities<br /><br />Profile<br /><br />For our security practice we are currently looking for a Technical IT Security Expert. Your main activities are:<br /><br />- Address security expectations<br />- SOC level 3 Investigation and Follow-up of threats / events / incidents escalated from our Security Operations Center: SOC LEVEL 1 / 2<br />- Definining and implementing standards, procedures, tech-specs and security guidelines for the customers platforms and environments<br />- Keep a close collaboration during in order to setup security recommendations and have them implemented<br />- Analysis and manage firewalls request & privileged accesses<br />- Analysis of the security incidents : advise and follow-up on corrective measures to implement in order to resolve IT incidents compromising<br />- Identify and evaluate security risks<br />- Contribute to audit and compliance activities<br /><br />What's in it for you?<br /><br />Sogeti is the perfect place to bring your passion for IT into play and learn new skills.<br /><br />You will be given the opportunity to develop your career through working on interesting projects, our internal training & development program, attend training courses to broaden your knowledge and obtain certifications. That’s how we boost your personal career and encourage life-long learning in your area of expertise!<br /><br />Your evolution will be monitored closely by your operations manager, a counselor and your own HR business partner.<br /><br />Sogeti is also known for lot of fun, an open minded company environment and where the informal communication culture are part of its DNA. You can also count on an attractive salary package and fringe benefits (e.g. company car, personal flex plan,…)."
  },
  {
    "id": "0_dYfHqiT9yEHu7zxeKsFw",
    "url": "https://remote.com/jobs/browse/preview/cloud-native-architect",
    "title": "Cloud Native Architect",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 30, 2018 10:03:36 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION: <br />Belgium<br /> (Partial remote)<br /><br />Anywhere in<br />Belgium<br /><br /><br />EXPERIENCE: expert<br /><br />COMPANY: Sogeti Belgium; 50-75 employees; 50-75% remote;<br /><br />Do or dare? What is your choice in the game?<br />Sogeti is looking for a cloud native architect. A real expert who is ready to become the right hand of our Digital department.<br /><br />You will be the counterpart of our automation expert.<br /><br />- Are you the architect we are looking for?<br /><br />Do you know everything about cloud native applications and are you technology agnostic about it? Meaning:<br /><br />Microsoft Stack towards Azure<br />Java to AWS<br />...<br /><br />- Discover your inner commercial superstar!<br /><br />Part of your daily job:<br /><br />Presales<br />Translate client processes into technical solutions<br />Take our chatbot to the next level by<br /><br />Building AI capabilities<br />Exploring the tooling and the platform possibilities for the integration of the chatbot<br /><br />- Do you have the right backpack?<br /><br />Development background<br />Experience with DevOps<br /><br />Hands-on experience with CI/CD<br />Jenkins is your best friend<br />You speak English, Dutch and French!<br /><br />- What’s in it for you?<br /><br />An attractive salary package – for real<br />Learning & Development opportunities<br />Open minded company<br />Informal communication culture<br />Fringe benefits"
  },
  {
    "id": "ND_cQ6OhT163OxZF8Mg0Dw",
    "url": "https://stackoverflow.com/jobs/189133/senior-php-developer-with-security-emphasis-defiant-inc?a=11qCoi5Dz8M8",
    "title": "Senior PHP Developer with Security Emphasis at Defiant Inc  ",
    "tags": [
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:laravel/php/8",
      "DBG_TECH1:k/t/w:php/php/15",
      "DBG_TECH1:k/t/w:wordpress/php/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=38, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 27, 2018 10:50:12 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Cybersecurity</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>php</a><a rel='nofollow'>wordpress</a><a rel='nofollow'>mysql</a><a rel='nofollow'>apache</a><a rel='nofollow'>nginx</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>DESCRIPTION</strong></p><p>Do you want to work in cyber security? How about being able to work anywhere on the Planet? On a beach in Hawaii, or taking your lunch break fly fishing a stream in Alaska.</p><p>We are one of the fastest growing cyber security companies in the World. You will be working for us remotely full-time, with full benefits including platinum level medical, dental, 401K, a generous stock options package, gym reimbursement, company paid security certifications (CISSP, Security+) and conferences.</p><p>We are a team of 33 talented and highly motivated people. We're fast moving, nimble, self managing and work in a relaxed atmosphere with a sense of humor. Rather than working for a mega-corp, you will be working in a company where your work has real impact in the fun high-growth stages of our evolution.</p><p>We use apps like Slack, Fogbugz, Github and Google Apps for our workflow. Each team member is world-class at what they do. We have flexible working hours and we are a diverse team ranging in age. Most of us are based in the USA and many are international including countries like Sweden, Bulgaria, the UK and many more.</p><p>Here are some of the core skills we look for in team members:</p><ul><li>A willingness to grab whatever task is required of you and run with it. This may include work outside of your core tasks. We are a small team and everyone needs to pitch in.</li><li>A high level of productivity and self-management.</li><li>Must be comfortable working remotely and interfacing with other team members using Slack and other remote tools.</li><li>Excellent analytical ability and problem solving skills.</li><li>A strong work ethic.</li><li>Effective communication skills. This is critical for remote workers and we can't emphasize this enough. You will spend a significant amount of time interfacing with our customers and/or other team members through your keyboard and it's critically important that you can effectively convey your thoughts.</li></ul><p><strong>REQUIREMENTS</strong></p><ul><li>PHP including object oriented PHP. Experience with Laravel is helpful. You need to write clean, high performance and maintainable code that is secure.</li><li>Knowledge of subversion and git, including github workflow is a requirement.</li><li>MySQL including the ability to write well performing SQL, ability to design schemas and an understanding of MySQL data types and performance.</li><li>Experiencing with Apache, Nginx and other web platforms like Lightspeed highly desirable.</li><li>Must be comfortable using Linux and comfortable with Linux administration.</li><li>HTML, CSS, Javascript and jQuery a requirement.</li><li>Understanding of common web vulnerabilities required.</li><li>Vulnerability research – ability to identify vulnerabilities in code is a requirement.</li><li>WordPress experience required – including ability to use the WordPress plugin API.</li><li>A keen interest in infosec. Credentials like Security+, CISSP or other is a strong plus.</li><li>Knowledge of other languages a strong plus.</li></ul><p>All positions require a trial period of approximately 2-3 weeks with a minimum commitment of 10 hours per week. You will be paid for this short-term contract, and it will be used to evaluate whether both parties want to pursue an ongoing, regular employment relationship.</p><p>All offers of employment are contingent on successful completion of a background check. The results of the background check are considered as they relate to the position and do not automatically disqualify someone from a offer of employment with the company.</p><p><strong>BENEFITS</strong></p><p>Full-time permanent positions include the following benefits:</p><ul><li>Platinum level PPO medical plan with dental and vision included. Company pays 100% of the premiums for employees and 50% for dependents.</li><li>21 days PTO per year</li><li>401k with matching contributions</li><li>Opportunities to attend security conferences and WordCamps (conferences vary but we have attended RSA, DefCon, BSides, Shmoocon and others)</li><li>Company paid local gym membership</li><li>Company paid fees and study time provided for work-related educational courses and security certifications such as Security+, CEH and CISSP.</li><li>You will receive a new laptop (MacBook Pro or equivalent) and any items needed to create a successful work environment at home.</li></ul><p><a href='https://defiant.workable.com/jobs/719212/candidates/new' rel='nofollow'>Click here to apply for this job now.</a></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://www.wordfence.com/careers/software-quality-assurance-engineer/' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Defiant Inc</h2>            <div><p>Defiant makes Wordfence, the&nbsp;most popular security product for WordPress. We protect over 1 million active websites from hackers, bots and spam. We are fast growing with a friendly and talented remote working team. We provide an excellent base package with full benefits that include 401k, awesome medical, dental, options, and 21 days of PTO. We make sure our team members have all the latest in laptop or workstation technology and everything else they need to do an awesome job from anywhere in the World.&nbsp;</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Remote working.</span>                            </li>                            <li>                                <span></span>                                <span>Friendly relaxed culture.</span>                            </li>                            <li>                                <span></span>                                <span>Fast paced.</span>                            </li>                            <li>                                <span></span>                                <span>Platinum level PPO medical plan.</span>                            </li>                            <li>                                <span></span>                                <span>21 days PTO per year.</span>                            </li>                            <li>                                <span></span>                                <span>401k with matching contributions.</span>                            </li>                            <li>                                <span></span>                                <span>Opportunities to attend security conferences and Wordcamps.</span>                            </li>                            <li>                                <span></span>                                <span>Company paid local gym membership.</span>                            </li>                            <li>                                <span></span>                                <span>Company paid fees &amp; study time for work-related courses/certifications</span>                            </li>                            <li>                                <span></span>                                <span>Hardware/software/gear provided for a successful home work environment</span>                            </li>                    </ul>                "
  },
  {
    "id": "UByTGr_MStWhAkNzLWbRWw",
    "url": "http://jobmote.com/jobs/11547-cybersecurity-senior-solutions-architect-remote",
    "title": "Cybersecurity Senior Solutions Architect - Remote",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 27, 2018 4:20:43 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Cybersecurity Senior Solutions Architect - Remote - Jobmote<div><div><h2>Cybersecurity Senior Solutions Architect - Remote</h2><h5>Slait Consulting</h5></div></div><div><div><div><div></div></div><div><div><div><p>SLAIT Consulting is currently seeking a Cybersecurity Senior Solutions Architect for our client in Dallas, TX. This is a remote position with some travel required. SUMMARY: The Cyber Security Solutions Architect is responsible for working with both BDS Business Development &amp; account/pursuit sales leadership to define security specific solution strategy. JOB DUTIES /RESPONSIBILITIES: * Responsible for leading the development of technical solutions in the area of cyber security services and offerings. * Ensure the soundness of an integrated security solution and proper BDS Delivery assurance signoff of any/all proposals. * Primary point contact responsible to ensure governance processes (Ex - Rainbow &amp; BDS Governance) are followed and managed pro-actively through the lifecycle of the pursuit/engagement. * Engages with the client, identifies cyber security needs/requirements, engages with SMEs and bid team to work on cyber security proposal and collect HL designs, and validates security solution to be proposed. * Works with engineers and SMEs in the development of the technical solution or offering, in translating the business needs into technical requirements, and is a key contributor in the value proposition. * Supports Bid &amp; Proposal solution development including technical design and development of complex proposals for Cyber Security solutions (managed services, System Integration and Consulting). * Run workshops and conduct security assessments to help the client understand their security and privacy issues, risks, exposure and vulnerabilities including architecting secure solutions to address specific security and privacy requirements. * Create high quality documentation such as Presentations, Risk Assessments, Reports and completing metrics and spreadsheets * Develop and deliver quality client presentations (both virtually and in person) * Evaluates and recommends future technologies and methodologies that will enhance our cyber security services and offerings. QUALIFICATIONS: * Minimum 5 years of Solution Architect experience. * Full lifecycle project experience as Security Consultant including design and implementation. * Client facing experience at a range of levels. * Several years of experience in IT security, compliance, and risk management including privacy and controls. * Implementation experience with enterprise security packages identity management and federation systems. * Familiarity with industry compliance and security standards including PCI DSS, ISO 27001, HIPAA, and NIST experience advising customers on architectures meeting industry standards such as SAS70, SOC1, and FISMA. * Preferred Certifications: QSA, CISSP, CISA, CISM, CRISC Why SLAIT? We have been growing since 1990 with offices in Virginia and Raleigh, NC. For over twenty-eight years, we have delivered customized, creative IT solutions for customers in the commercial, and state and local government sectors. * Staff Augmentation * Managed Services * Security Solutions * IT Consulting Thank you for your consideration, please submit your resume today! Visit us at * * Must be able to work for any employer in the United States. No Visa sponsorship.* * SLAIT Consulting is an Equal Opportunity Employer - provided by Dice </p><p>IT security </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "C6G3iQZBQNK8AuTnPRIA5w",
    "url": "http://jobmote.com/jobs/11399-cybersecurity-senior-solutions-architect-remote",
    "title": "Cybersecurity Senior Solutions Architect - Remote",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 26, 2018 1:21:36 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Cybersecurity Senior Solutions Architect - Remote - Jobmote<div><div><h2>Cybersecurity Senior Solutions Architect - Remote</h2><h5>Slait Consulting</h5></div></div><div><div><div><div></div></div><div><div><div><p>SLAIT Consulting is currently seeking a Cybersecurity Senior Solutions Architect for our client in Dallas, TX. This is a remote position with some travel required. SUMMARY: The Cyber Security Solutions Architect is responsible for working with both BDS Business Development &amp; account/pursuit sales leadership to define security specific solution strategy. JOB DUTIES /RESPONSIBILITIES: * Responsible for leading the development of technical solutions in the area of cyber security services and offerings. * Ensure the soundness of an integrated security solution and proper BDS Delivery assurance signoff of any/all proposals. * Primary point contact responsible to ensure governance processes (Ex - Rainbow &amp; BDS Governance) are followed and managed pro-actively through the lifecycle of the pursuit/engagement. * Engages with the client, identifies cyber security needs/requirements, engages with SMEs and bid team to work on cyber security proposal and collect HL designs, and validates security solution to be proposed. * Works with engineers and SMEs in the development of the technical solution or offering, in translating the business needs into technical requirements, and is a key contributor in the value proposition. * Supports Bid &amp; Proposal solution development including technical design and development of complex proposals for Cyber Security solutions (managed services, System Integration and Consulting). * Run workshops and conduct security assessments to help the client understand their security and privacy issues, risks, exposure and vulnerabilities including architecting secure solutions to address specific security and privacy requirements. * Create high quality documentation such as Presentations, Risk Assessments, Reports and completing metrics and spreadsheets * Develop and deliver quality client presentations (both virtually and in person) * Evaluates and recommends future technologies and methodologies that will enhance our cyber security services and offerings. QUALIFICATIONS: * Minimum 5 years of Solution Architect experience. * Full lifecycle project experience as Security Consultant including design and implementation. * Client facing experience at a range of levels. * Several years of experience in IT security, compliance, and risk management including privacy and controls. * Implementation experience with enterprise security packages identity management and federation systems. * Familiarity with industry compliance and security standards including PCI DSS, ISO 27001, HIPAA, and NIST experience advising customers on architectures meeting industry standards such as SAS70, SOC1, and FISMA. * Preferred Certifications: QSA, CISSP, CISA, CISM, CRISC Why SLAIT? We have been growing since 1990 with offices in Virginia and Raleigh, NC. For over twenty-eight years, we have delivered customized, creative IT solutions for customers in the commercial, and state and local government sectors. * Staff Augmentation * Managed Services * Security Solutions * IT Consulting Thank you for your consideration, please submit your resume today! Visit us at * * Must be able to work for any employer in the United States. No Visa sponsorship.* * SLAIT Consulting is an Equal Opportunity Employer - provided by Dice </p><p>IT security </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "k3DEK9yqQhe2OyajCP4Ufw",
    "url": "http://jobmote.com/jobs/11376-azure-developer-azure-service-bus-c-flexible-remote-work",
    "title": "Azure Developer - Azure Service Bus, C# (Flexible Remote Work)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c#/c/6",
      "DBG_TECH1:k/t/w:c#/dotnet/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=15, c=6, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 25, 2018 10:21:31 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Azure Developer - Azure Service Bus, C# (Flexible Remote Work) - Jobmote<div><div><h2>Azure Developer - Azure Service Bus, C# (Flexible Remote Work)</h2><h5>Nigel Frank International Ltd</h5></div></div><div><div><div><div></div></div><div><div><div><p><strong>Location: -</strong> Wolverhampton </p><p><strong>Rate: -</strong> £500-550 Per Day </p><p><strong>Length:</strong> - 3-6 month Contract<br><strong>Role:</strong><br>Immediate requirement to work on a cutting-edge Azure project, looking for a Senior Developer to join the expanding team to assist with an Azure Service Bus implementation...... click apply for full job details </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "F3uLN1xqRX2EdgiDAiIWRQ",
    "url": "https://stackoverflow.com/jobs/188116/solutions-engineer-ruby-youearnedit?a=115tjHmcuy8U",
    "title": "Solutions Engineer, Ruby at YouEarnedIt (Austin, TX) ",
    "tags": [
      "DBG:surround``5N( cultur, 2N(remot, OR(work,worker)) )",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby-developer/ruby/13",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=27, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 24, 2018 5:31:24 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>HR Services, SaaS</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>javascript</a><a rel='nofollow'>reactjs</a><a rel='nofollow'>flux</a><a rel='nofollow'>graphql</a><a rel='nofollow'>ruby-on-rails</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>About YouEarnedit:</strong></p><p><span>We are passionate about creating happiness for employees that translates into business results for our customers. We focus on employee engagement and improve all levels of recognition so work experience is elevated. Our goal is for the happiness we help create to spread to everyone in the form of increased engagement, improved morale, and greater profitability!</span></p><p><span>We are a growing company with a bunch of people who take work seriously, who have high levels of accountability and are tons of fun to work with. &nbsp;We live what we’re preaching.</span></p><p><strong>Overview of the role:</strong></p><p><span>We’re looking for a seasoned Ruby developer with a passion for technical problem-solving and customer relations to join our growing team. As a Solutions Engineer, you’d leverage your technical expertise and coding skills to solve our customers’ problems. You’d investigate, develop, automate, and communicate to get the job done. &nbsp;</span></p><p><strong>What you'll do:</strong></p><ul><li><span>Spend 50% of your time coding creative solutions to customers’ needs and the other 50% interfacing with customers to support their needs</span></li><li><span>Develop time-saving tools and automated processes to reduce integration setup overhead</span></li><li><span>Work with customers’ technical teams to plan, coordinate, and execute on integrations with 3rd party systems</span></li><li><span>Present YouEarnedIt’s technical capabilities and security features to customers in a pre-sales capacity</span></li><li><span>Work with our Customer Success team to triage, investigate, and resolve customer support issues</span></li><li><span>Influence our product’s direction with your ideas and insight into our customers’ needs</span></li></ul><p><strong>What we want from you:</strong></p><ul><li><span>A passion for helping customers find elegant solutions to their complex problems</span></li><li><span>Ability to juggle multiple tasks, reorganize/re-prioritize quickly, without feeling overwhelmed.</span></li><li><span>3+ years working with a web framework: Ruby on Rails a bonus</span></li><li><span>Excellent written and verbal communication skills for technical and non-technical audiences alike</span></li><li><span>Excellent problem-solving and debugging skills</span></li><li><span>High standards for quality and attention to detail</span></li><li><span>A solid understanding of web fundamentals (HTTP, HTML, CSS, JavaScript)</span></li><li><span>Proficiency in data mappers such as Mongoid or Active Record</span></li><li><span>Bonus: experience working in a technical, customer-oriented role</span></li></ul><p><span>To apply - please submit your resume and a cover letter describing why you were inspired to apply with us.</span></p><p><span>We look forward to hearing from you!</span></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://recruit.hirebridge.com/v3/Jobs/JobDetails.aspx?cid=7880&amp;jid=474213' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>                    <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Open Vacation</span>                            </li>                            <li>                                <span></span>                                <span>Leave it better days</span>                            </li>                            <li>                                <span></span>                                <span>401k</span>                            </li>                            <li>                                <span></span>                                <span>YouEarnedIt as a platform</span>                            </li>                            <li>                                <span></span>                                <span>Meaningful Rewards</span>                            </li>                            <li>                                <span></span>                                <span>Remote workers</span>                            </li>                            <li>                                <span></span>                                <span>Culture of continuous feedback</span>                            </li>                            <li>                                <span></span>                                <span>Transparency</span>                            </li>                            <li>                                <span></span>                                <span>Wellness</span>                            </li>                            <li>                                <span></span>                                <span>Learning &amp; Development</span>                            </li>                    </ul>                "
  },
  {
    "id": "Nv1vUVoSTYSSXZM6XQj0LA",
    "url": "https://weworkremotely.com/remote-jobs/amazix-security-manager",
    "title": "AmaZix: Security Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 17, 2018 2:03:33 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Security Manager</h2>      <h4>Posted May 16</h4>    <h3>      <span>AmaZix</span><br>      <span>Headquarters: Hong Kong (but entire team is distributed)</span><br>        <a href='https://www.amazix.com/' rel='nofollow'>https://www.amazix.com/</a>      <br>      <a rel='nofollow'>View all AmaZix jobs →</a>    </h3>  </div>    </div>  <div>    <div><b>Operational Security Manager (CISMP, CISM, CISSP)<span>&nbsp;</span></b></div><div><br></div><div></div><div><span>AmaZix is the leading provider of community management services for crypto projects. We specialise in helping projects running on the Ethereum blockchain, especially those building up to their ICOs. Projects we work on include Bancor, BANKEX, WePower, GBX and Cardstack.</span></div><div><br></div><div></div><div><span>We are growing extremely fast and from our founding nine months ago we now have over 100 team members and manage over 60 high level projects, with many more asking to come aboard than we can take. We are profitable and have been since day one.</span></div><div><br></div><div></div><div><span>If you are not technically familiar with blockchain based projects then no problem - it is not required. However some knowledge of what Ethereum is would be useful.</span></div><div><br></div><div></div><div><span>Though our company is based in Hong Kong our team is distributed around the world (primarily Europe).</span></div><div></div><div><br></div><div></div><div><span><b>Your position</b></span></div><div><br></div><div></div><div><span>We are looking for a candidate with extensive experience in an Operational Security Manager role, who can demonstrate ownership and accountability of delivering Security IT Services into a dynamic and remote business.<span>&nbsp;</span></span></div><div><br></div><div></div><ul><li><span></span><span>Minimum one of the following Security qualifications; IS027001 lead Auditor, CISMP, CISM or CISSP</span></li><li><span></span><span>Excellent communications skills &amp; be able to translate complex security information into layman's terms for those that are not conversant with security knowledge &amp; services</span></li><li><span></span><span>Good knowledge of British &amp; International security standards</span></li><li><span></span><span>Ability to work as part of a remote team</span></li><li><span></span><span>Ability to develop conceptual models for the delivery of security services</span></li><li><span></span><span>Security Risk Management</span></li></ul><div><br></div><div></div><div><span>Responsibilities for this role will include:</span></div><div><br></div><div></div><ul><li><span></span><span>Managing relationships with the business and with customers</span></li><li><span></span><span>Be responsible for all Security related aspects to maintain Security compliance</span></li><li><span></span><span>Proactively promote security services</span></li><li><span></span><span>Management of security incidents</span></li><li><span></span><span>Managing &amp; mitigating threats</span></li><li><span></span><span>Writing and maintaining security policies &amp; compliance</span></li><li><span></span><span>Adhere to 27001 compliances and develop roadmap to accreditation</span></li><li><span></span><span>Ensure operational security input &amp; governance is exercised over all new technical implementations</span></li><li><span></span><span>Raise security awareness within the business</span></li><li><span></span><span>Manage a security risk register</span></li><li><span></span><span>Review &amp; authorise change requests</span></li><li><span></span><span>Act as a security point of contact for the business</span></li><li><span></span><span>Ensure all security documents are maintained</span></li><li><span></span><span>Manage privilege access management</span></li><li><span></span><span>Ensure 3rd parties are Security compliant</span></li><li><span></span><span>Produce monthly Security report for your line manager</span></li><li><span></span><span>Chair &amp; Manage Security meetings &amp; maintain minutes</span></li><li><span></span><span>Produce and drive recommendations for security improvements</span></li></ul><div></div><div><br></div><div></div><div><span><b>Requirements:</b></span></div><div><br></div><div></div><div><span>Perfect command of English (written and spoken)</span></div><div><br></div><div></div><div><span>Invoicing structure and proper registration. Willingness to be paid in Ethereum would be a huge plus.</span></div><div><br></div><div></div><div><span>Able to work full-time.<span>&nbsp;</span></span></div><div><br></div><div></div><div><span></span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Go to our website: <a href='http://www.amazix.com' rel='nofollow'>www.amazix.com</a> and press the &quot;Join us&quot; button. Select option &quot;B&quot; and fill out the fields in the Typeform</p>  </div>"
  },
  {
    "id": "4_sVpwTJSzqjUFErnXphaw",
    "url": "http://jobmote.com/jobs/9928-demandware-salesforce-commerce-cloud-solution-architect-remote",
    "title": "Demandware / Salesforce Commerce Cloud Solution Architect (Remote)",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 9, 2018 11:22:51 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Demandware / Salesforce Commerce Cloud Solution Architect (Remote) - Jobmote<div><div><h2>Demandware / Salesforce Commerce Cloud Solution Architect (Remote)</h2><h5>ConSol Partners</h5></div></div><div><div><div><div></div></div><div><div><div><p>Demandware / Salesforce Commerce Cloud Solution Architect - (Remote anywhere USA) - up to $200K total package - rapidly growing eCommerce specific agency</p><p><strong>T</strong>** HE **** COMPANY**</p><p>One of the USA's fastest growing digital agencies specific to the eCommerce sector. They work with some of the world's biggest and most well-known retailers and brands. Their global projects allow an individual to work on large scale platforms and implementations alongside some of the leading SFCC professionals in the country.</p><p><strong>THE ROLE</strong></p><ul><li>The role will offer the opportunity to work on a SFCC platform on multiple client projects in a fast paced exciting environment</li><li>Working as a hands on technical expert working with development teams, client requirements and high level roadmaps</li><li>Joining a growing team at an early stage offering solid career progression</li><li>Working on multiple client projects and implementations</li></ul><p><strong>THE INDIVIDUAL</strong></p><ul><li>2+ years' experience in SFCC / Demandware platform</li><li>1-2 years' experience at an architect level (someone with a sold technical background on SFCC stepping up into an Architect role could also be a great fit)</li><li>Software development background (5+ years) ideally around SFCC / Java or related technologies</li><li>SFCC / Demandware implementation experience highly desirable</li><li>Strong experience and understanding of HTML/CSS, Javascript, JQuery, XML, Java</li><li>Ideally worked in an Agile environment</li></ul><p><strong>SALARY:</strong> up to$200K total package</p><p><strong>LOCATION:</strong> Remote (anywhere in the USA)</p><p><strong>CONSOL PARTNERS</strong></p><p>ConSol Partners provide permanent and contract staffing solutions to FTSE &amp; Fortune 500 companies, global brands and start-ups in the technology domains of Communications , Cloud and Digital . Founded in 2008, ConSol Partners have quickly established themselves as one of the world's leading technology recruitment brands.</p><p>With headquarters in the City of London and international offices in Los Angeles' &quot;Silicon Beach&quot; and central Boston. Our niche recruitment offering, coupled with an in-depth expert knowledge of our core markets, enables us to offer a true global recruitment solution and we have made placements in over 55 countries.</p><ul><li>provided by Dice Demandware / Salesforce Commerce Cloud Solution Architect (Remote) up to $200k package - top eCommerce specific agency </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "wYdg0wdwQyezj44VNkE2Ww",
    "url": "http://jobmote.com/jobs/9927-cybersecurity-senior-solutions-architect-remote",
    "title": "Cybersecurity senior Solutions Architect - Remote",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 9, 2018 11:22:50 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Cybersecurity senior Solutions Architect - Remote - Jobmote<div><div><h2>Cybersecurity senior Solutions Architect - Remote</h2><h5>Slait Consulting</h5></div></div><div><div><div><div></div></div><div><div><div><p>SLAIT Consulting is currently seeking a Cybersecurity Senior Solutions Architect for our client in Dallas, TX and Richmond, VA.</p><p>This is a remote position with some travel required (10%).</p><p>SUMMARY:</p><p>The Cyber Security Solutions Architect is responsible for working with both BDS Business Development &amp; account/pursuit sales leadership to define security specific solution strategy.</p><p>JOB DUTIES /RESPONSIBILITIES:</p><ul><li><p>Responsible for leading the development of technical solutions in the area of cyber security services and offerings.</p></li><li><p>Ensure the soundness of an integrated security solution and proper BDS Delivery assurance signoff of any/all proposals.</p></li><li><p>Primary point contact responsible to ensure governance processes (Ex - Rainbow &amp; BDS Governance) are followed and managed pro-actively through the lifecycle of the pursuit/engagement.</p></li><li><p>Engages with the client, identifies cyber security needs/requirements, engages with SMEs and bid team to work on cyber security proposal and collect HL designs, and validates security solution to be proposed.</p></li><li><p>Works with engineers and SMEs in the development of the technical solution or offering, in translating the business needs into technical requirements, and is a key contributor in the value proposition.</p></li><li><p>Supports Bid &amp; Proposal solution development including technical design and development of complex proposals for Cyber Security solutions (managed services, System Integration and Consulting).</p></li><li><p>Run workshops and conduct security assessments to help the client understand their security and privacy issues, risks, exposure and vulnerabilities including architecting secure solutions to address specific security and privacy requirements.</p></li><li><p>Create high quality documentation such as Presentations, Risk Assessments, Reports and completing metrics and spreadsheets</p></li><li><p>Develop and deliver quality client presentations (both virtually and in person)</p></li><li><p>Evaluates and recommends future technologies and methodologies that will enhance our cyber security services and offerings.</p></li></ul><p>QUALIFICATIONS:</p><ul><li><p>Minimum 5 years of Solution Architect experience.</p></li><li><p>Full lifecycle project experience as Security Consultant including design and implementation.</p></li><li><p>Client facing experience at a range of levels.</p></li><li><p>Several years of experience in IT security, compliance, and risk management including privacy and controls.</p></li><li><p>Implementation experience with enterprise security packages identity management and federation systems.</p></li><li><p>Familiarity with industry compliance and security standards including PCI DSS, ISO 27001, HIPAA, and NIST experience advising customers on architectures meeting industry standards such as SAS70, SOC1, and FISMA.</p></li><li><p>Preferred Certifications: QSA, CISSP, CISA, CISM, CRISC</p></li></ul><p>Why SLAIT?</p><p>We have been growing since 1990 with offices in Virginia and Raleigh, NC. For over twenty-eight years, we have delivered customized, creative IT solutions for customers in the commercial, and state and local government sectors.</p><ul><li>Staff Augmentation * Managed Services * Security Solutions * IT Consulting</li></ul><p>Thank you for your consideration, please submit your resume today! Visit us at</p><ul><li>* Must be able to work for any employer in the United States. No Visa sponsorship.* * </li></ul><p>SLAIT Consulting is an Equal Opportunity Employer</p><ul><li>provided by Dice IT security, risk management, compliance </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "w34kDpgyQKyziFkT94h2Yg",
    "url": "http://jobmote.com/jobs/8544-microsoft-data-analytics-solution-architect-remote",
    "title": "Microsoft Data/Analytics Solution Architect (Remote)",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:sql-server/dotnet/3",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=3, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=5, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 1, 2018 10:22:51 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Microsoft Data/Analytics Solution Architect (Remote) - Jobmote<div><div><h2>Microsoft Data/Analytics Solution Architect (Remote)</h2><h5>BlueGranite</h5></div></div><div><div><div><div></div></div><div><div><div><p>BlueGranite's Solution Architect position is a senior role for individuals with at least twelve years of professional, hands-on experience designing and building business intelligence or data warehouse solutions on the Microsoft platform.</p><p>BlueGranite's Solution Architects are expert industry leaders with SQL Server, Power BI, and Azure platforms. They are part of BlueGranite's premier consulting team, leading small-team engagements to design, implement, and support analytics solutions. They demonstrate strong technical leadership skills across components of SQL Server, Power BI and Azure platforms and are able to mentor others with these technologies. Solution Architects may support pre-sales client discussions, project scoping and estimating tasks, and writing statements of work together with our account leadership team.</p><p>This full-time, work-from-home consultant position is for individuals who enjoy leading project teams while continuing to work hands-on, building data and analytics solutions using the Microsoft platform.</p><p>At a minimum, we're looking for:</p><ul><li>At least twelve years of hands-on, professional experience with Microsoft data/analytics platforms</li><li>Knowledge of data warehouse concepts and dimensional modeling techniques</li><li>Experience developing reports or dashboards</li><li>Strong aptitude with T-SQL statements and DAX functions</li><li>Self-starter, quick learner, with a positive, collaborative, and team-based attitude</li><li>Excellent communication skills, with interests in presenting and blogging</li><li>Degree in information technology, computer science, business, or engineering</li><li>Ability to travel across the U.S., with an average of 25% travel to client locations per year</li><li>Ability to work from home when not on-site at client locations</li><li>Authorization to work in the U.S., without the requirement for an employment visa<br></li></ul><p>In addition, these score you extra points:</p><ul><li>Microsoft or other industry certifications for BI, DW, or analytics</li><li>Microsoft Azure, Power BI, or big data knowledge/experience</li><li>Interest in advanced analytics, machine learning, and languages including R and Python</li><li>Demonstration of thought leadership, community volunteering, recognition or awards</li><li>Master's degree in technology or business<br></li></ul><p>Your primary responsibilities would include:</p><ul><li>Lead discovery, planning, and architecture design of data and analytics solutions using Microsoft SQL, Power BI, and Azure platforms</li><li>Lead the development of informative and interactive data visualizations/models with SSRS or Power BI</li><li>Work hands-on with data and analytics components of SQL Server (such as SSIS, SSAS, SSRS, MDS/DQS, or ML Services)<br></li><li>Leverage Azure Data Services and Power BI to deliver cloud solutions</li><li>Write relational, tabular and multidimensional database queries, flows and movements</li><li>Obtain and maintain technical certifications in these core areas of expertise</li><li>Add value to each project through effective leadership and team collaboration</li></ul><p>BlueGranite is the driving force of data innovation for our customers. We are trusted advisors who use our aptitude and experience to deliver value to our clients. We invest in our team to become better at who we are and what we do. Our core strategy is to lead with offers for data, insights, and analytics that deliver business value on the Microsoft platform.</p><p>This position is predominantly remote, work from home, with an average of 25% overnight travel per year. BlueGranite employees are located in Michigan, Illinois, Indiana, Ohio, Colorado, Texas, Minnesota, Georgia, South Carolina, North Carolina, New York, New Hampshire, Florida, or Massachusetts only.</p><p>The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  }
]
}
