{
 "items": [
  {
    "id": "rOOHCOUsQGmVOfCYWKCwsA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/65982/customer-happiness-executive-weekends-at-your-parking-space/",
    "title": "Customer Happiness Executive, Weekends",
    "content": "We're looking for someone to join our customer service team working a minimum of 16 hours over Saturday and Sunday, but with the opportunity to expand to more hours if required. The role is primarily home-based, but there will be some compulsory training based in Canary Wharf at the beginning of the role and at various times throughout your employment.<br /><br />YourParkingSpace, recently named as one of the UK’s fastest growing companies by Leap 100, is looking for an enthusiastic and driven Customer Happiness Executive with a passion for the sharing economy to join our rapidly growing tech start-up company and drive our customer experience. We are aiming to transform the parking industry by providing a platform that enables motorists to find and book parking online. We’re fast-growing and looking for someone to join us in our Canary Wharf office to assist us in our constant growth.<br /><br />As a Customer Happiness Executive, it is your responsibility to ensure that every customer leaves with a positive impression of YourParkingSpace. <br /><br />Whether a customer has contacted us with a general query or a complaint you will need to be fast- acting, stay calm under pressure and remain positive throughout the interaction to ensure an exceptional customer experience is provided. <br /><br />It’s necessary to expect the unexpected as unanticipated issues occur, you will need to be a keen problem-solver in order to handle any difficult situations which may arise. <br /><br />You will play a crucial role within the team so as a remote operator you will need to be highly motivated, driven and passionate about the role. As a start-up we are still growing and learning as a company, therefore it is important to have the confidence to notify us of any recurring issues so that we can work to resolve these on mass to provide a better experience for all users.<br /><br />The Role<br />Acting as the first point of contact for most customers <br />Communicating with users and potential users to give advice and answer any queries, in addition to resolving any complaints, often through thorough investigation.<br />Providing prompt responses, within set service level agreements, using our customer support software, Zendesk <br />Driving sales by negotiating terms with users of the site <br />Achieving monthly sales targets as part of a team effort <br /><br />The Right Person<br />Experience in a customer-facing role<br />Able to communicate to an excellent standard both written and verbally<br />Exceptional computer skills<br />Keen attention to detail<br />Focused with the ability to self-motivate ",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 2:29:33 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "cXu1Jh8lTV2fyajQYLKs7A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/schedugram-lead-engineer-head-of-engineering-mean-stack",
    "title": "Schedugram: Lead Engineer / Head of Engineering (MEAN Stack)",
    "content": "<div>  <div>    <h2>Lead Engineer / Head of Engineering (MEAN Stack)</h2>      <h4>Posted Feb  7</h4>    <h3>      <span>Schedugram</span><br>      <span>Headquarters: Melbourne, Australia</span><br>        <a href='https://schedugr.am' rel='nofollow'>https://schedugr.am</a>    </h3>  </div>    </div>  <div>    <div>We are Schedugram, a company based in Australia but with a global remote team. We help marketing managers and agencies schedule their Instagram content. Our customers range from small businesses to Fortune 500 companies around the globe.</div><div><br></div><div>We have been growing significantly for the last 4 years.&nbsp;</div><div><br></div><div>Now, we’re searching for a lead engineer who will turbocharge our existing team, hire more talent when it’s needed, streamline our development output and take responsibility for our code base.</div><div><br></div><div>Our whole company works remotely, so you will be working with people from across the globe every day.</div><div><br></div><div><b>Our stack:</b></div><div><br></div><div>We use a MEAN stack.</div><div><br></div><ul><li>NodeJS / Express<br></li><li>MongoDB<br></li><li>AngularJS (1)<br></li><li>Redis for session management<br></li><li>RabbitMQ for messaging</li></ul><div><br></div><div>We also have a mobile application in React Native.</div><div><br></div><div>We use AWS extensively, from Lambda functions to S3 and of course EC2.&nbsp;</div><div><br></div><div>For VCS and issue management we use GitHub. We use Slack to communicate within the team.&nbsp;</div><div><br></div><div><b>What we’re looking for</b></div><div><br></div><div>You will help our team to grow and provide best practice guidance to make sure we are building the right software at the right time.&nbsp;</div><div><br></div><div>You:&nbsp;</div><div><br></div><ul><li>understand that the job of a tech startup is to ship product that customers use and love<br></li><li>love to write code, because that’s your main job with us<br></li><li>have deep expertise in our stack so that you can hit the ground running<br></li><li>will create decision matrices for major architectural decisions<br></li><li>will maintain a clean code base<br></li><li>will maintain documentation as needed (although we are not over documenting)<br></li><li>will create and enforce code guidelines<br></li><li>will manage the team and help them improve their coding skills<br></li><li>take ownership of our whole technical stack and delivery<br></li><li>are able to discuss technical issues with our non-technical teams<br></li><li>will be excited to celebrate success as you and your team release products and features that customers around the globe love</li></ul><div><br></div><div>You're not a middle manager – you aren't afraid to roll up your sleeves and cut code, and you do it often. You demonstrate best practice first hand by showing it, rather than talking about it.</div><div><br></div><div><b>Your background</b></div><div><br></div><div>Our ideal candidate will have:</div><div><br></div><ul><li>5+ years in software development<br></li><li>Deep experience with the MEAN stack recently<br></li><li>2+ years experience leading (managing) and growing a small engineering team<br></li><li>Experience working remotely, including communicating with a remote team spread across the world<br></li><li>Experience at a small rapidly growing startup (B2B SaaS preferred)<br></li><li>Knowledge in agile best practice development methods and delivery technologies<br></li><li>Experience teaching others best practices and mentoring junior developers<br></li><li>Full time availability – this role is 'all in', and you will be responsible for all of the moving parts of our technology</li></ul><div><br></div><div>We'd love to chat more about how you can be part of Schedugram's next phase of growth.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply at the link: <a href='https://schedugr.freshteam.com/jobs/qxM_dgrcKC0f/lead-engineer-head-of-engineering-mean-stack' rel='nofollow'>https://schedugr.freshteam.com/jobs/qxM_dgrcKC0f/lead-engineer-head-of-engineering-mean-stack</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 9:12:54 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/Asia"
    ],
    "tagsNames1": [
      "100% remote",
      "Asia time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "GA9P-qU_SpGe0n-_H3nqbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160721/lead-software-developer-technical-project-maplarge?a=RTQP59Rpwm4",
    "title": "Lead Software Developer / Technical Project Manager at MapLarge () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Business Intelligence, Data &amp; Analytics, Developer APIs</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>100% Remote:&nbsp;</strong>This role allows working remotely 100% of the time from anywhere in the US.&nbsp; Workers must be authorized to work in the US (No Non US Applicants Please).&nbsp;</p><p><strong>Who We Need: </strong>We are looking for talented software developers to act as lead developers in a customer facing, technical project manager role. &nbsp;Applicants should have a strong history as a lead software developer (no non-technical project managers, please) and should be a top notch C# and JavaScript programmer. &nbsp;We are looking for sophisticated team members who are passionate about not only how UI is used, but also how the APIs, ontology, data structures, documentation, and examples come together to make both the UI components and technical APIs a pleasure for customers to use.</p><p><strong>Typical Tasks: </strong>Typical Tasks include both writing code and leading planning activities. &nbsp;You will often be acting as the lead technical point of contact on customer engagements, running internal and external planning meetings, helping to wireframe user interfaces, creating specs for the public facing APIs that drive them, doing deep dive code reviews with developers, and writing code for key portions of the deployed application.</p><p><strong>Skills:</strong> While we hire all kinds of people and invent roles to fit them, these are the key traits we prefer for this role:</p><ol><li><strong>Smart &amp; High Energy Engineer</strong> - We work at a very fast pace on cutting edge hard problems and we need people who can keep up. &nbsp;&nbsp;We need people who really love producing results for customers and who enjoy programming and exhibit the energy and creativity that comes from being fully engaged in the technical side of what we do.</li><li><strong>Strong Software Development background</strong> - This job is definitely NOT for non technical project managers. Recent, hands-on experience coding both server side (C#) and client side (JavaScript) are strongly suggested, and 5+ years work experience as a professional programmer is required. &nbsp;</li><li><strong>Experience Wireframing UI &amp; Designing APIs -</strong> You do not have to have strong artistic skills, but you should be comfortable not only spec-ing out UI wireframes but also designing the supporting technical web service API’s and/or client side component API’s.</li><li><strong>Technical Project Management</strong>: &nbsp;You should be highly organized with a strong history in either technical project management or as the lead developer for complex software development projects.&nbsp;&nbsp;</li><li><strong>Customer Facing</strong>: comfortable meeting with sophisticated customers and managing expectations on large high value projects.</li></ol>                    </div>                            <h2>                About MapLarge            </h2>            <div><p>MapLarge provides Big Data Analytics and Visualization to make&nbsp;the world safer, more productive, and more efficient.&nbsp; The MapLarge API provides real time geospatial and predictive analytics for over 15 billion location events per day and trillions of historical events. Analysts using our geospatial visualization capability can instantly query and visualize data on any desktop, mobile or tablet device. &nbsp;All of our UI components are re-usable, data driven, event driven, API powered (client and server side), scriptable, re-configurable, savable, deep linkable, shareable etc. &nbsp;We also have editor components, and data visualization wizards that allow non-technical users to import, automatically visualize data patterns (with sensible defaults that “just work”), conduct predictive analysis and also re-configure more advanced detailed settings with “what you see is what you get” editor tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours (work whenever you like)                            </div>                            <div>                                 No Commute (work from home 100%)                            </div>                            <div>                                 Technically Excellent A+ Team solving very hard interesting problems                            </div>                            <div>                                 Friendly People - Postitive attitude is our #1 criteria                            </div>                            <div>                                 401k                            </div>                            <div>                                 We like all kinds of people                            </div>                            <div>                                 Unlimited Vacation                            </div>                            <div>                                 Family Friendly                            </div>                            <div>                                 Top Notch Health Care                            </div>                            <div>                                 Cutting Edge Tech                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH2/amazon-web-services",
      "TECH2/api",
      "TECH2/c#",
      "TECH2/geolocation",
      "TECH2/typescript",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "api",
      "c#",
      "dotnet",
      "geolocation",
      "typescript"
    ]
  },
  {
    "id": "j1T0ImzMQiimLO4Zi9DRXQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162942/account-manager-platformsh?a=SE22LLorCAE",
    "title": "Account Manager at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Company presentation :</strong></p><p>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). To reinforce our technical prowess, we are looking to grow our Customer Solutions team with an engineer that also enjoys customer relations. If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem, and our marketing director programs Haskell.</p><p>We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers.</p><p>We're looking for strong technologists who are good at providing valuable services directly to customers.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem, and our marketing director programs Haskell.</p><p>We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers.</p><p>We're looking for strong technologists who are good at providing valuable services directly to customers.</p><p><strong>Mission :</strong></p><p><span>Our Account Managers are the ambassadors for the Platform.sh brand. They know the intricate needs and challenges of the customers in their portfolio and deeply care about their success. They lead communications in times of change or problem resolution, and foster a healthy working relationship with the customer.</span></p><p><strong>Mission :</strong></p><p><span>Sales activity for existing customers:</span></p><ul><li><span>ensure renewal of contracts, including up and cross sells</span></li><li><span>report on renewal activity</span></li><li><span>liaise with sales team when necessary</span></li></ul><p><span>Customer care: </span></p><ul><li><span>be involved in the customer’s journey from on-boarding to continued partnership</span></li><li><span>monitor and measure Customer satisfaction (eg. Net Promoter Score) through regular health checks</span></li><li><span>coordinate the involvement of company personnel, including support, service, and management resources, in order to meet account performance objectives and customers’ expectations</span></li><li><span>solve conflicts and concerns that were not solved at Customer Support level</span></li><li><span>build and manage workflows for handling complaints</span></li></ul><p><strong>Technical Skills :</strong></p><ul><li><span>SaaS business acumen </span></li><li><span>relational and negotiation skills</span></li><li><span>ability to effectively prioritize and escalate customer issues as required</span></li><li><span>ability to learn and assimilate technical information quickly</span></li><li><span>fluent written and verbal English</span></li><li><span>basic knowledge of web application architecture and services (DNS, CDN, web servers, databases, cache layers, etc.) and distributed systems.</span></li><li><span>basic knowledge of web development workflows and tools (git, CI tools)</span></li><li><span>knowledge of common web applications and frameworks: Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3 (a lot of our customers run those)</span></li><li><span>knowledge of cloud services (AWS, Azure)</span></li></ul><p><strong>Soft Skills :</strong></p><ul><li><span>customer orientation</span></li><li><span>sense of service</span></li><li><span>energetic and self-motivated</span></li><li><span>communication and listening skills</span></li><li><span>analytical, problem solving and troubleshooting expertise</span></li><li><span>organization </span></li><li><span>pragmatism</span></li><li><span>capacity to work remotely in an international fast growing environment</span></li><li><span>high degree of ownership over one’s work</span></li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TECH2/cloud",
      "TECH2/magento",
      "TECH2/saas",
      "TECH2/symfony2",
      "TECH2/web-services",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "cloud",
      "magento",
      "php",
      "saas",
      "symfony2",
      "web-services"
    ]
  },
  {
    "id": "x9EtwpRxSROwtdo2jxB7Lg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285656",
    "title": "Dataquest | SF | Director of Marketing | Remote, Full-time | $90k - $130k | https://www.dataquest.io",
    "content": "<div>                  <span>Dataquest | SF | Director of Marketing | Remote, Full-time | $90k - $130k | <a href='https://www.dataquest.io' rel='nofollow'>https://www.dataquest.io</a><p>At Dataquest, we teach data science interactively online to hundreds of thousands of students worldwide. We're focused on teaching skills and building intuition from the ground up with our project based curriculum. Unlike most educational options, we focus on motivating students to learn, not just content delivery.  We have students go from no programming knowledge to jobs at companies like SpaceX, Amazon, and Microsoft, and you can read their stories here -- <a href='https://www.dataquest.io/stories' rel='nofollow'>https://www.dataquest.io/stories</a> .</p><p>Help us build awareness of Dataquest by scaling our marketing team, analyzing metrics, and running experiments with new growth channels.  This is a chance to help students around the world learn while having a lot of ownership over the direction and messaging of the company.  Ideally, you'll have experience with running and optimizing ads, analyzing data, and optimizing conversion funnels.</p><p>We're a bootstrapped team of 11, and we've been growing 2-3x per year since we launched in 2015, primarily through content marketing.  We're looking for someone who can meaningfully increase this growth rate.</p><p>If you're burnt out doing work that doesn't feel like it has a direct impact, you have a passion for data science, or you want to peek inside a profitable bootstrapped company, this role could be a good fit.</p><p>Please email vik@dataquest.io if you're interested.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:42:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "GcNBxIv9Txeo1v6ytvRbXg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/world-business-and-executive-coach-summit-wbecs-marketing-director",
    "title": "World Business and Executive Coach Summit (WBECS): Marketing Director",
    "content": "<div>  <div>    <h2>Marketing Director</h2>      <h4>Posted Feb  1</h4>    <h3>      <span>World Business and Executive Coach Summit (WBECS)</span><br>      <span>Headquarters: Milton Keynes, UK</span><br>        <a href='http://www.wbecs.com/wbecs2017/' rel='nofollow'>http://www.wbecs.com/wbecs2017/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Imagine being a leader in the team behind the world’s largest online event for professional </span><span>Coaches. Working with the very top thought leaders in Business and Executive Coaching </span><span>including professors from Harvard University and leading academic institutes. Working directly with the coaches of thought leaders like Richard Branson, Steve Jobs, Elon Musk, NASA, the President of the World Bank and other world leaders. Those are the coaches we work with personally to help get their amazing thought leadership out to the world and due to our fast growth we are looking for an exceptional new team member to join us.</span></div><div><br></div><div><span>Following running the world’s largest online event for coaches with 50 of the top thought leaders for the coaching industry we then identify one or two of the very best to work with on an individual project to launch one of their programs to the world. The last project we worked on was Narrative Coach, see </span><a href='http://www.ciqcoach.com' rel='nofollow'><span>www.narrativecoach.com</span></a><span>. The project you would start working on would be </span><a href='http://www.ciqcoach.com' rel='nofollow'><span>www.ciqcoach.com</span></a><span> followed by </span><a href='http://www.wbecs.com' rel='nofollow'><span>www.wbecs.com</span></a><span>. </span></div><div><br></div><div><span>The role of Marketing Director is incredibly important and will involve developing the marketing efforts behind major launches of high class educational programs and learning environments for Business &amp; Executive Coaches. You will be greatly supported by our senior leaders, as well as an incredible launch team -- </span><span><b>and must have experience planning, building marketing campaigns and have extensive experience in Digital Marketing &amp; Management. </b></span></div><div><br></div><div><span>This is not your typical office job. Our passionately engaged team works 100% remote &nbsp;and collaborates vigorously. The lifestyle design is flexible, but full on and the culture is fast-paced. We consider our work our “art” and strive for excellence in everything we do.</span><br></div><div></div><div><span></span></div><div><br></div><div><span><b>You are the person we are looking for if you: </b></span></div><div><br></div><ul><li><span>Have a minimum of 3-5 years of digital marketing project management experience.</span><br></li><li><span>2-4 years building, testing and optimizing effective sales conversion funnels.</span><br></li><li><span>Love the idea of getting deep inside a world leading brand and developing its meaning, impact and perception in our global marketplace.</span><br></li><li><span>Have a deep love for online sales and digital marketing.</span><br></li><li><span>Have an understanding and hands-on experience with online funnel-based marketing.</span><br></li><li><span>Are tech savvy, can find your way around anything online and have mastered Google Applications and preferably Google Analytics.</span><br></li><li><span>Have a working knowledge of the web development process.</span><br></li><li><span>Ability to manage a database with careful attention to detail. </span><br></li><li><span>Have in-depth marketing automation experience. </span><br></li><li><span>Love the personal growth and development industry and want to make a positive impact on the world through the work you do. </span><br></li><li><span>Care about the world and people in it and want to support them in becoming successful in helping others.</span><br></li><li><span>Are a confident, resourceful and a highly motivated self-starter who can work independently and don’t require someone looking over your shoulder all day. </span><br></li><li><span>Thrive on problem-solving and have excellent team collaboration skills. </span><br></li><li><span>Have high standards for your work. Details matter to you. Results matter to you. Excellence matters to you. </span><br></li><li><span>Are invigorated by the constant change of a high-growth organization with bold and audacious goals.</span><br></li><li><span>Have a very high standard of quality to maintain, a very particular brand voice and work fast.</span><br></li><li><span>Speak English at an idiomatic level.</span><br></li><li><span>Are highly organized, with lots of initiative to stay on top of deadlines. </span><br></li><li><span>Have the ability to run a motivated and talented team across the globe.</span><br></li><li><span>Have the ability to delegate effectively and efficiently while keep a team passionate and motivated.</span><br></li><li><span>Marketing agency experience a bonus.</span><br></li><li><span>Above else, a willingness to learn as this is not an exhaustive list of what you will be working on!</span><br><br></li></ul><div><span><b>What you’ll do: </b></span></div><div><br></div><ul><li><span>Create and maintain world-class brands to drive community members into our desired action.</span><br></li><li><span>Build, optimize and drive the execution of a digital marketing campaign from start to finish.</span><br></li><li><span>Manage and meet all deadlines for a successful launch of a high-impact, high ticketed program.</span><br></li><li><span>Maintain a clean, segmented database inside Infusionsoft and create behaviorally triggered marketing automation to engage and grow our client community.</span><br></li><li><span>Ensure accurate, consistent data management and reporting in Infusionsoft and other reporting platforms for all sales and marketing related activities.</span><br></li><li><span>Continually develop, test, measure, and optimize campaigns to drive significant</span><span><br></span><span>membership growth and maximize retention over time.</span><br></li><li><span>Analyze campaign performance data through reporting tools and communicate the results to the team.</span><br><br></li></ul><div><b>Compensation</b><b>:</b> Better than competitive base (70-80k) with bonuses and unlimited growth opportunities, PLUS the most unique work environment that includes bonuses in the form of amazing trips to Countries like Costa Rica, Thailand, Croatia, and beyond as a reward for successful launches! &nbsp;</div><div><span><br></span></div><div>***Most importantly, you will be working with our team that considers itself a family of people who will welcome you with open arms. We are based around the globe, so this position is <b>100% remote</b>. &nbsp;Primary working hours are US Eastern Time based and require flexible hours during program launches.</div><div><br></div><div><b><span>To apply, p</span><span>lease send:</span></b></div><ol><li><span>Answers to the questions listed here: &nbsp;</span><a href='https://docs.google.com/forms/d/e/1FAIpQLSdE2rddzYx6AcsLYVonZ4ep1z9PmtAPpySJN-RHiRajlaYnNg/viewform' rel='nofollow'><span>https://docs.google.com/forms/d/e/1FAIpQLSdE2rddzYx6AcsLYVonZ4ep1z9PmtAPpySJN-RHiRajlaYnNg/viewform</span></a></li><li><span>A cover letter explaining why you are an excellent fit for this role and this epic team</span><b><br></b></li><li><span>Your resume to </span><span>annemarie@wbecs.com</span><span> with the subject line:</span><span> Marketing Director</span><br><br></li></ol><div><span>NOTE: &nbsp;Applicants who do not answer the questionnaire or submit a cover letter will not be considered. </span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Follow instructions in job description.</p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:09:52 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "tQ3NlTPzSYSQMO2iiOopIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/the-art-of-applying-executive-assistant-to-founder-ceo",
    "title": "The Art of Applying: Executive Assistant to Founder & CEO",
    "content": "<div>  <div>    <h2>Executive Assistant to Founder &amp; CEO</h2>      <h4>Posted Feb  1</h4>    <h3>      <span>The Art of Applying</span><br>      <span>Headquarters: New York, NY (formerly Austin, TX)</span><br>        <a href='http://theartofapplying.com/ea' rel='nofollow'>http://theartofapplying.com/ea</a>    </h3>  </div>    </div>  <div>    <div><h2>Work from Home for a Woman Entrepreneur Helping Make People’s Dreams Come True</h2></div><div><strong><br></strong></div><div><strong>Position:</strong>&nbsp;Executive Assistant to the Founder &amp; CEO of The Art of Applying<br></div><div></div><div><strong><br></strong></div><div><strong>Compensation:</strong>&nbsp;$30,000 per year with 10 paid vacation days<br></div><div></div><div><strong><br></strong></div><div><strong>Work hours:</strong>&nbsp;Full Time: Monday - Friday 9 am – 6 pm Eastern Time with an unpaid one-hour lunch.<br></div><div></div><div>Please note that working part-time or working nights and weekends only is not an option.<br></div><div></div><div><strong><br></strong></div><div><strong>Location:</strong>&nbsp;Remote (must be located in the United States or Canada)<br></div><div></div><div><strong><br></strong></div><div><strong>Deadline to apply:&nbsp;</strong>Wednesday, February 7 at 8 am Eastern Time</div><div><strong><br></strong></div><div><strong>Start Date:&nbsp;</strong>March 1, 2018</div><div><br></div><div>The Art of Applying is a fast-growing education company that helps people from all over the world get admitted to their dream graduate schools with funding to pay for it.<br></div><div></div><div><br></div><div>We’re looking for an&nbsp;<strong>enthusiastic, reliable self-starter</strong>&nbsp;with&nbsp;<strong>excellent communication skills</strong>&nbsp;and a&nbsp;<strong>willingness to learn user-friendly technology</strong>&nbsp;such as WordPress, Google Docs, Google Sheets, Basecamp, and Zoom to<strong>&nbsp;join our 100% remote team (yes, you’d get to work from home!)</strong>&nbsp;as the&nbsp;<strong>Executive Assistant</strong>&nbsp;to the Founder &amp; CEO.<br></div><div></div><div><br></div><div>How would you like to be with a company that helps people get into their dream graduate schools with funding that is at the&nbsp;<strong>very beginning of a significant growth phase</strong>?<br></div><div></div><div><br></div><div>A company that is willing and able to&nbsp;<strong>teach you everything you need to know to succeed</strong>?<br></div><div></div><div><br></div><div>A company that is&nbsp;<strong>more concerned about who you are as a person</strong>&nbsp;than about your job history or your experience?<br></div><div></div><div><br></div><div>A company that wants to&nbsp;<strong>give you the training and the opportunity</strong>&nbsp;you’ve been looking for?<br></div><div></div><div><br></div><div>A company that has<strong>&nbsp;twice-yearly all expenses paid company retreats</strong>? Our last retreat was in Austin, Texas and included beating a difficult Escape Game, a dessert reception with some of our clients, touring the city, one-hour massages, and eating the world’s best BBQ. Yeehaw!<br></div><div></div><div><br></div><div>With hard work and a willingness to learn, you will have the opportunity to&nbsp;<strong>build your skills</strong>,&nbsp;<strong>contribute to an amazing mission</strong>,&nbsp;<strong>have fun with like-minded people</strong>, and do it all while working from home.<br></div><div></div><div><strong><br></strong></div><div><strong>Examples of job duties:</strong><br></div><div></div><div><strong><br></strong></div><ul><li>respond to incoming email inquiries from prospective clients using Helpscout</li><li>listen to one call recording per week of our Breakthrough Coaches to check that they are providing the absolute best service possible to prospective clients during their free 90-minute Breakthrough Calls</li><li>schedule professional and personal meetings for the CEO</li><li>conduct 45-minute onboarding calls with new clients via Zoom to help them understand how everything works in their client portal</li><li>manage the company’s business Facebook and Twitter accounts using a tool such as Edgar</li><li>help create the schedule and then serve as the logistics point person for the next team retreat (It will most likely be in New York City in June 2018)</li></ul><div><span><br></span></div><div><b>Who we aren’t looking for:</b><br></div><div></div><ul><li>people afraid of technology or who are proud to be “not computer savvy”</li><li>people interested in a remote role so they can travel several months out of the year</li><li>people who want to start their own business or build their own brand</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your application here: <a href='http://theartofapplying.com/ea' rel='nofollow'>http://theartofapplying.com/ea</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 4:56:37 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "7Qiq7rtLRm6qxnE4D0HmRw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Senior+Clinical+Project+Manager&c=Barrington+James&l=Remote&jk=9b33f6220b781d8e&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Senior Clinical Project Manager / Program... - Barrington James - Remote",
    "content": "<div><b>Senior Clinical Project Manager / Program...</b><br><span>Barrington James</span>     -<span>Remote</span>    <div>        <span>Permanent</span>        </div></div><span><b>Position:</b> Senior Clinical Project Manager / Program Manager<br><br><b>Location:</b> London, however flexible with home based working<br><br><b>Reporting Line:</b> VP, Clinical Development<br><br><b>Size:</b> Small yet growing!<br><br>Retained Search<br><br>Our client is an attractive, stable (yet small), fast-growing organisation based in the UK &amp; US that focus on the development of Urological and Gastroenterology fields. This is an extremely exciting time for the company following a huge investment from various venture capitalist firms, therefore they have the platform to continue to grow across various indications and phases.<br><br>This is a great opportunity to join a young and exciting company from the get go and have the autonomy to truly impact the organization. This company have a truly talented senior management team with experience across blue chip pharma and small pharmaceutical companies, therefore the selected individual will have regular access to proven pharmaceutical professional enabling you to expand your portfolio!<br><br>Due to the companies unique stance in the market (huge financial backing, yet small in size), the selected candidate will have the opportunity to make a real difference! (i.e. small team culture and entrepreneurial environment where decisions are made quickly without red tape, while also having the stability/financial backing through there series A funding)<br><br><b>Attractive Features:</b><br><ul><li>Huge financial backing = opportunity &amp; stability</li><li>Experience yet transparent senior management team</li><li>Growth potential – due to several project ongoing, the company is going from strength to strength!</li><li>Opportunity to experience further development in Program Management</li><li>location &amp; flexibility</li></ul><b>Position Summary:</b><br>The Senior Clinical Project Manager (SCPM) will work closely with the VP, Clinical, to manage assigned global clinical studies of varying complexity (Phase 1 – 3). The SCPM is responsible for the management of all sites and vendors (e.g. Clinical Research Organisation, CRO) for each assigned clinical study and resolution of operational issues.<br><br>Main Responsibilities (please ask for full JD to see extended responsibilities)<br><br><ul><li>Program Management</li><li>Clinical Study Management</li><li>Vendor Oversight</li><li>Budget Responsibilities</li><li>Stakeholder Responsibilities</li><li>Cooperate Responsibilities</li></ul><b>Minimum experience requirements:</b><br><ul><li>Clear track record of successful execution of clinical studies from Phase 1 through Phase 3 including:</li></ul>o Detailed understanding of all aspects of clinical protocol design and implementation and overall drug development.<br><br>o Strong vendor management skills, e.g. CRO, Laboratory and Clinical Supply logistics.<br><br>o Management of clinical study to budget and timelines.<br><br>o Ability to write and edit technical documents such as protocols, protocol amendments, informed consent and other study-related documents.<br><br><ul><li>Strong people-management skills and ability to interact and influence successfully at all levels and externally with Board Members, partners and others as necessary.</li><li>Knowledge of ICH guidelines, GxP regulations, FDA guidance documents, EU directives.</li></ul>For more information, please reach out to me directly!<br><br>wpenticost@barringtonjames.com<br><br>+44 1293 77 66 44<br><br>Barrington James is a uniquely successful specialist life science recruitment company and has recently been recognised as a BEST COMPANY To Work For by the Sunday Times. It has enjoyed an exceptional growth trajectory since its launch in 2002, and is now established in the heartlands of the international pharma, medical devices and healthcare industry with consultant staff already approaching 140, and planned to be 180 by the end of 2017.<br><br>Recruitment companies succeed by matching the specific needs of clients with the true capabilities of candidates. We believe there are 2 reasons for our outstanding performance over the past decade, which benefit our clients and our candidates equally; People &amp; Knowledge Barrington James’ exceptional people and their depth of experience are ready to work for you, now.</span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 4:52:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "V-szqmc6T9eYx87bXivHjw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Senior+Clinical+Project+Manager&c=Barrington+James&l=Remote&jk=9b33f6220b781d8e&rtk=1c5gchuka92paene&from=rss",
    "title": "Senior Clinical Project Manager / Program... - Barrington James - Remote",
    "content": "<div><b>Senior Clinical Project Manager / Program...</b><br><span>Barrington James</span>     -<span>Remote</span>    <div>        <span>Permanent</span>        </div></div><span><b>Position:</b> Senior Clinical Project Manager / Program Manager<br><br><b>Location:</b> London, however flexible with home based working<br><br><b>Reporting Line:</b> VP, Clinical Development<br><br><b>Size:</b> Small yet growing!<br><br>Retained Search<br><br>Our client is an attractive, stable (yet small), fast-growing organisation based in the UK &amp; US that focus on the development of Urological and Gastroenterology fields. This is an extremely exciting time for the company following a huge investment from various venture capitalist firms, therefore they have the platform to continue to grow across various indications and phases.<br><br>This is a great opportunity to join a young and exciting company from the get go and have the autonomy to truly impact the organization. This company have a truly talented senior management team with experience across blue chip pharma and small pharmaceutical companies, therefore the selected individual will have regular access to proven pharmaceutical professional enabling you to expand your portfolio!<br><br>Due to the companies unique stance in the market (huge financial backing, yet small in size), the selected candidate will have the opportunity to make a real difference! (i.e. small team culture and entrepreneurial environment where decisions are made quickly without red tape, while also having the stability/financial backing through there series A funding)<br><br><b>Attractive Features:</b><br><ul><li>Huge financial backing = opportunity &amp; stability</li><li>Experience yet transparent senior management team</li><li>Growth potential – due to several project ongoing, the company is going from strength to strength!</li><li>Opportunity to experience further development in Program Management</li><li>location &amp; flexibility</li></ul><b>Position Summary:</b><br>The Senior Clinical Project Manager (SCPM) will work closely with the VP, Clinical, to manage assigned global clinical studies of varying complexity (Phase 1 – 3). The SCPM is responsible for the management of all sites and vendors (e.g. Clinical Research Organisation, CRO) for each assigned clinical study and resolution of operational issues.<br><br>Main Responsibilities (please ask for full JD to see extended responsibilities)<br><br><ul><li>Program Management</li><li>Clinical Study Management</li><li>Vendor Oversight</li><li>Budget Responsibilities</li><li>Stakeholder Responsibilities</li><li>Cooperate Responsibilities</li></ul><b>Minimum experience requirements:</b><br><ul><li>Clear track record of successful execution of clinical studies from Phase 1 through Phase 3 including:</li></ul>o Detailed understanding of all aspects of clinical protocol design and implementation and overall drug development.<br><br>o Strong vendor management skills, e.g. CRO, Laboratory and Clinical Supply logistics.<br><br>o Management of clinical study to budget and timelines.<br><br>o Ability to write and edit technical documents such as protocols, protocol amendments, informed consent and other study-related documents.<br><br><ul><li>Strong people-management skills and ability to interact and influence successfully at all levels and externally with Board Members, partners and others as necessary.</li><li>Knowledge of ICH guidelines, GxP regulations, FDA guidance documents, EU directives.</li></ul>For more information, please reach out to me directly!<br><br>wpenticost@barringtonjames.com<br><br>+44 1293 77 66 44<br><br>Barrington James is a uniquely successful specialist life science recruitment company and has recently been recognised as a BEST COMPANY To Work For by the Sunday Times. It has enjoyed an exceptional growth trajectory since its launch in 2002, and is now established in the heartlands of the international pharma, medical devices and healthcare industry with consultant staff already approaching 140, and planned to be 180 by the end of 2017.<br><br>Recruitment companies succeed by matching the specific needs of clients with the true capabilities of candidates. We believe there are 2 reasons for our outstanding performance over the past decade, which benefit our clients and our candidates equally; People &amp; Knowledge Barrington James’ exceptional people and their depth of experience are ready to work for you, now.</span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 4:52:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "oJ6uX9tWSo6Kf6EVSZXbZQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Senior+Clinical+Project+Manager&c=Barrington+James&l=Remote&jk=9b33f6220b781d8e&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Senior Clinical Project Manager / Program... - Barrington James - Remote",
    "content": "<div><b>Senior Clinical Project Manager / Program...</b><br><span>Barrington James</span>     -<span>Remote</span>    <div>        <span>Permanent</span>        </div></div><span><b>Position:</b> Senior Clinical Project Manager / Program Manager<br><br><b>Location:</b> London, however flexible with home based working<br><br><b>Reporting Line:</b> VP, Clinical Development<br><br><b>Size:</b> Small yet growing!<br><br>Retained Search<br><br>Our client is an attractive, stable (yet small), fast-growing organisation based in the UK &amp; US that focus on the development of Urological and Gastroenterology fields. This is an extremely exciting time for the company following a huge investment from various venture capitalist firms, therefore they have the platform to continue to grow across various indications and phases.<br><br>This is a great opportunity to join a young and exciting company from the get go and have the autonomy to truly impact the organization. This company have a truly talented senior management team with experience across blue chip pharma and small pharmaceutical companies, therefore the selected individual will have regular access to proven pharmaceutical professional enabling you to expand your portfolio!<br><br>Due to the companies unique stance in the market (huge financial backing, yet small in size), the selected candidate will have the opportunity to make a real difference! (i.e. small team culture and entrepreneurial environment where decisions are made quickly without red tape, while also having the stability/financial backing through there series A funding)<br><br><b>Attractive Features:</b><br><ul><li>Huge financial backing = opportunity &amp; stability</li><li>Experience yet transparent senior management team</li><li>Growth potential – due to several project ongoing, the company is going from strength to strength!</li><li>Opportunity to experience further development in Program Management</li><li>location &amp; flexibility</li></ul><b>Position Summary:</b><br>The Senior Clinical Project Manager (SCPM) will work closely with the VP, Clinical, to manage assigned global clinical studies of varying complexity (Phase 1 – 3). The SCPM is responsible for the management of all sites and vendors (e.g. Clinical Research Organisation, CRO) for each assigned clinical study and resolution of operational issues.<br><br>Main Responsibilities (please ask for full JD to see extended responsibilities)<br><br><ul><li>Program Management</li><li>Clinical Study Management</li><li>Vendor Oversight</li><li>Budget Responsibilities</li><li>Stakeholder Responsibilities</li><li>Cooperate Responsibilities</li></ul><b>Minimum experience requirements:</b><br><ul><li>Clear track record of successful execution of clinical studies from Phase 1 through Phase 3 including:</li></ul>o Detailed understanding of all aspects of clinical protocol design and implementation and overall drug development.<br><br>o Strong vendor management skills, e.g. CRO, Laboratory and Clinical Supply logistics.<br><br>o Management of clinical study to budget and timelines.<br><br>o Ability to write and edit technical documents such as protocols, protocol amendments, informed consent and other study-related documents.<br><br><ul><li>Strong people-management skills and ability to interact and influence successfully at all levels and externally with Board Members, partners and others as necessary.</li><li>Knowledge of ICH guidelines, GxP regulations, FDA guidance documents, EU directives.</li></ul>For more information, please reach out to me directly!<br><br>wpenticost@barringtonjames.com<br><br>+44 1293 77 66 44<br><br>Barrington James is a uniquely successful specialist life science recruitment company and has recently been recognised as a BEST COMPANY To Work For by the Sunday Times. It has enjoyed an exceptional growth trajectory since its launch in 2002, and is now established in the heartlands of the international pharma, medical devices and healthcare industry with consultant staff already approaching 140, and planned to be 180 by the end of 2017.<br><br>Recruitment companies succeed by matching the specific needs of clients with the true capabilities of candidates. We believe there are 2 reasons for our outstanding performance over the past decade, which benefit our clients and our candidates equally; People &amp; Knowledge Barrington James’ exceptional people and their depth of experience are ready to work for you, now.</span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 4:52:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ElNXWGaHSjCs_531WP8mvg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Senior+Clinical+Project+Manager&c=Barrington+James&l=Remote&jk=9b33f6220b781d8e&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Senior Clinical Project Manager / Program... - Barrington James - Remote",
    "content": "<div><b>Senior Clinical Project Manager / Program...</b><br><span>Barrington James</span>     -<span>Remote</span>    <div>        <span>Permanent</span>        </div></div><span><b>Position:</b> Senior Clinical Project Manager / Program Manager<br><br><b>Location:</b> London, however flexible with home based working<br><br><b>Reporting Line:</b> VP, Clinical Development<br><br><b>Size:</b> Small yet growing!<br><br>Retained Search<br><br>Our client is an attractive, stable (yet small), fast-growing organisation based in the UK &amp; US that focus on the development of Urological and Gastroenterology fields. This is an extremely exciting time for the company following a huge investment from various venture capitalist firms, therefore they have the platform to continue to grow across various indications and phases.<br><br>This is a great opportunity to join a young and exciting company from the get go and have the autonomy to truly impact the organization. This company have a truly talented senior management team with experience across blue chip pharma and small pharmaceutical companies, therefore the selected individual will have regular access to proven pharmaceutical professional enabling you to expand your portfolio!<br><br>Due to the companies unique stance in the market (huge financial backing, yet small in size), the selected candidate will have the opportunity to make a real difference! (i.e. small team culture and entrepreneurial environment where decisions are made quickly without red tape, while also having the stability/financial backing through there series A funding)<br><br><b>Attractive Features:</b><br><ul><li>Huge financial backing = opportunity &amp; stability</li><li>Experience yet transparent senior management team</li><li>Growth potential – due to several project ongoing, the company is going from strength to strength!</li><li>Opportunity to experience further development in Program Management</li><li>location &amp; flexibility</li></ul><b>Position Summary:</b><br>The Senior Clinical Project Manager (SCPM) will work closely with the VP, Clinical, to manage assigned global clinical studies of varying complexity (Phase 1 – 3). The SCPM is responsible for the management of all sites and vendors (e.g. Clinical Research Organisation, CRO) for each assigned clinical study and resolution of operational issues.<br><br>Main Responsibilities (please ask for full JD to see extended responsibilities)<br><br><ul><li>Program Management</li><li>Clinical Study Management</li><li>Vendor Oversight</li><li>Budget Responsibilities</li><li>Stakeholder Responsibilities</li><li>Cooperate Responsibilities</li></ul><b>Minimum experience requirements:</b><br><ul><li>Clear track record of successful execution of clinical studies from Phase 1 through Phase 3 including:</li></ul>o Detailed understanding of all aspects of clinical protocol design and implementation and overall drug development.<br><br>o Strong vendor management skills, e.g. CRO, Laboratory and Clinical Supply logistics.<br><br>o Management of clinical study to budget and timelines.<br><br>o Ability to write and edit technical documents such as protocols, protocol amendments, informed consent and other study-related documents.<br><br><ul><li>Strong people-management skills and ability to interact and influence successfully at all levels and externally with Board Members, partners and others as necessary.</li><li>Knowledge of ICH guidelines, GxP regulations, FDA guidance documents, EU directives.</li></ul>For more information, please reach out to me directly!<br><br>wpenticost@barringtonjames.com<br><br>+44 1293 77 66 44<br><br>Barrington James is a uniquely successful specialist life science recruitment company and has recently been recognised as a BEST COMPANY To Work For by the Sunday Times. It has enjoyed an exceptional growth trajectory since its launch in 2002, and is now established in the heartlands of the international pharma, medical devices and healthcare industry with consultant staff already approaching 140, and planned to be 180 by the end of 2017.<br><br>Recruitment companies succeed by matching the specific needs of clients with the true capabilities of candidates. We believe there are 2 reasons for our outstanding performance over the past decade, which benefit our clients and our candidates equally; People &amp; Knowledge Barrington James’ exceptional people and their depth of experience are ready to work for you, now.</span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 4:52:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "FxLjn4oHS7SSYdUsRK2d1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Outbound+Telesale+Executive&c=Onify&l=Remote&jk=48eb0b3289498823&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Outbound Telesales Executive - Onify Ltd - Remote",
    "content": "<div><b>Outbound Telesales Executive</b><br><span>Onify Ltd</span>     -<span>Remote</span>    <div>        <span>                £18,000 - £25,000 a year - </span>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Fancy yourself as a telesales Rockstar? Do you want to be part of the core team in a new startup with huge ambitions? If you answered yes, read on. We have something very exciting to tell you about.</p><p>ONIFY is a fast growing startup built around loyalty, customer retention and rewards. Ever wondered why you keep all those loyalty cards? Now you don’t have to. ONIFY rewards your loyalty without you having to carry, collect and locate all those annoying paper cards. Now, you can keep them all on one simple-to-use app and access them at any time.</p><p>For businesses, this gives them a complete marketing and customer retention system, with no technology required in-store. No longer are these tools just available to the big players, we are putting them in that hands of everybody so businesses can focus on what they do best. We help them get their customers back through the door time and time again. We believe that we everyone should be rewarded for being loyal to local, independent businesses and ONIFY provides the tools to do just that.</p><p>We love our product, and businesses and customers love it as well. We now need to get it in the hand in as many businesses as possible and need somebody to contact potential customers and guide them through the FREE sign up process. This role will be a mix of cold calling, building and maintaining a sales pipeline.</p><p>Our team have built marketplaces from scratch before, and we are doing it again with ONIFY. In a brand new role for us, you will be working under the direction of the CEO (founder of fillmybelly.com and Ex Just Eat director), whilst gaining a valuable insight into what it takes to build a company from the ground up, as well as understanding how everything we do affects the growth of the company.</p><p>Key skills required:</p><ul><li>Experience within a sales or telesales environment is a must</li><li>Self-motivation and ability to work remotely</li><li>Must be energetic and love what you do</li><li>A pleasant and confident telephone manner, able to speak to people at various levels of business</li><li>Able to demonstrate first-class, effective business to business communication</li><li>Able to handle rejection with the desire to hit targets</li><li>You will have good literacy and numeracy skills</li><li>Good IT skills and knowledge of CRM.</li><li>Monitor and update all sales related KPI’s</li></ul><p>ONIFY are looking for an individual who is passionate about sales and can work hard and think positive in a fast-paced sales environment. A strategic thinker, with the ability to work effectively under pressure and be able to prioritise and meet sales targets and KPI's.</p><p>We are a remote business, which means all our employees currently work from a location that suits them. If you've never worked remotely before, don’t worry, you’ll soon grow to love it. We have daily video catch ups, weekly meetings and regular chat on our communication networks, so you won’t ever feel on your own for the day.</p><p>This position is full time, however, your hours can be flexible to fit around your personal circumstances and needs of the business. Access to a computer, fast internet and a quiet place to work from are essential. There will be a solid basic salary as well as tiered commision levels to really help incentivise your sales ability.</p><p>If this sounds perfect for you, please apply with a covering letter explaining why you would be perfect for the role along with your current CV. We will not be reviewing applications that don’t have a covering letter attached, so please include one if you are seriously interested in becoming part of our team.</p><p>We look forward to hearing from you soon.</p><p>Job Types: Full-time, Permanent</p><p>Salary: £18,000.00 to £25,000.00 /year</p><p>Required experience:</p><ul><li>telesales: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 2:43:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "dDwkh5saQMecrkW3m61r4w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Outbound+Telesale+Executive&c=Onify&l=Remote&jk=48eb0b3289498823&rtk=1c5gchuka92paene&from=rss",
    "title": "Outbound Telesales Executive - Onify Ltd - Remote",
    "content": "<div><b>Outbound Telesales Executive</b><br><span>Onify Ltd</span>     -<span>Remote</span>    <div>        <span>                £18,000 - £25,000 a year - </span>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Fancy yourself as a telesales Rockstar? Do you want to be part of the core team in a new startup with huge ambitions? If you answered yes, read on. We have something very exciting to tell you about.</p><p>ONIFY is a fast growing startup built around loyalty, customer retention and rewards. Ever wondered why you keep all those loyalty cards? Now you don’t have to. ONIFY rewards your loyalty without you having to carry, collect and locate all those annoying paper cards. Now, you can keep them all on one simple-to-use app and access them at any time.</p><p>For businesses, this gives them a complete marketing and customer retention system, with no technology required in-store. No longer are these tools just available to the big players, we are putting them in that hands of everybody so businesses can focus on what they do best. We help them get their customers back through the door time and time again. We believe that we everyone should be rewarded for being loyal to local, independent businesses and ONIFY provides the tools to do just that.</p><p>We love our product, and businesses and customers love it as well. We now need to get it in the hand in as many businesses as possible and need somebody to contact potential customers and guide them through the FREE sign up process. This role will be a mix of cold calling, building and maintaining a sales pipeline.</p><p>Our team have built marketplaces from scratch before, and we are doing it again with ONIFY. In a brand new role for us, you will be working under the direction of the CEO (founder of fillmybelly.com and Ex Just Eat director), whilst gaining a valuable insight into what it takes to build a company from the ground up, as well as understanding how everything we do affects the growth of the company.</p><p>Key skills required:</p><ul><li>Experience within a sales or telesales environment is a must</li><li>Self-motivation and ability to work remotely</li><li>Must be energetic and love what you do</li><li>A pleasant and confident telephone manner, able to speak to people at various levels of business</li><li>Able to demonstrate first-class, effective business to business communication</li><li>Able to handle rejection with the desire to hit targets</li><li>You will have good literacy and numeracy skills</li><li>Good IT skills and knowledge of CRM.</li><li>Monitor and update all sales related KPI’s</li></ul><p>ONIFY are looking for an individual who is passionate about sales and can work hard and think positive in a fast-paced sales environment. A strategic thinker, with the ability to work effectively under pressure and be able to prioritise and meet sales targets and KPI's.</p><p>We are a remote business, which means all our employees currently work from a location that suits them. If you've never worked remotely before, don’t worry, you’ll soon grow to love it. We have daily video catch ups, weekly meetings and regular chat on our communication networks, so you won’t ever feel on your own for the day.</p><p>This position is full time, however, your hours can be flexible to fit around your personal circumstances and needs of the business. Access to a computer, fast internet and a quiet place to work from are essential. There will be a solid basic salary as well as tiered commision levels to really help incentivise your sales ability.</p><p>If this sounds perfect for you, please apply with a covering letter explaining why you would be perfect for the role along with your current CV. We will not be reviewing applications that don’t have a covering letter attached, so please include one if you are seriously interested in becoming part of our team.</p><p>We look forward to hearing from you soon.</p><p>Job Types: Full-time, Permanent</p><p>Salary: £18,000.00 to £25,000.00 /year</p><p>Required experience:</p><ul><li>telesales: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 2:43:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "kBp_t6CtT6utdk7ArS5oew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Outbound+Telesale+Executive&c=Onify&l=Remote&jk=48eb0b3289498823&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Outbound Telesales Executive - Onify Ltd - Remote",
    "content": "<div><b>Outbound Telesales Executive</b><br><span>Onify Ltd</span>     -<span>Remote</span>    <div>        <span>                £18,000 - £25,000 a year - </span>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Fancy yourself as a telesales Rockstar? Do you want to be part of the core team in a new startup with huge ambitions? If you answered yes, read on. We have something very exciting to tell you about.</p><p>ONIFY is a fast growing startup built around loyalty, customer retention and rewards. Ever wondered why you keep all those loyalty cards? Now you don’t have to. ONIFY rewards your loyalty without you having to carry, collect and locate all those annoying paper cards. Now, you can keep them all on one simple-to-use app and access them at any time.</p><p>For businesses, this gives them a complete marketing and customer retention system, with no technology required in-store. No longer are these tools just available to the big players, we are putting them in that hands of everybody so businesses can focus on what they do best. We help them get their customers back through the door time and time again. We believe that we everyone should be rewarded for being loyal to local, independent businesses and ONIFY provides the tools to do just that.</p><p>We love our product, and businesses and customers love it as well. We now need to get it in the hand in as many businesses as possible and need somebody to contact potential customers and guide them through the FREE sign up process. This role will be a mix of cold calling, building and maintaining a sales pipeline.</p><p>Our team have built marketplaces from scratch before, and we are doing it again with ONIFY. In a brand new role for us, you will be working under the direction of the CEO (founder of fillmybelly.com and Ex Just Eat director), whilst gaining a valuable insight into what it takes to build a company from the ground up, as well as understanding how everything we do affects the growth of the company.</p><p>Key skills required:</p><ul><li>Experience within a sales or telesales environment is a must</li><li>Self-motivation and ability to work remotely</li><li>Must be energetic and love what you do</li><li>A pleasant and confident telephone manner, able to speak to people at various levels of business</li><li>Able to demonstrate first-class, effective business to business communication</li><li>Able to handle rejection with the desire to hit targets</li><li>You will have good literacy and numeracy skills</li><li>Good IT skills and knowledge of CRM.</li><li>Monitor and update all sales related KPI’s</li></ul><p>ONIFY are looking for an individual who is passionate about sales and can work hard and think positive in a fast-paced sales environment. A strategic thinker, with the ability to work effectively under pressure and be able to prioritise and meet sales targets and KPI's.</p><p>We are a remote business, which means all our employees currently work from a location that suits them. If you've never worked remotely before, don’t worry, you’ll soon grow to love it. We have daily video catch ups, weekly meetings and regular chat on our communication networks, so you won’t ever feel on your own for the day.</p><p>This position is full time, however, your hours can be flexible to fit around your personal circumstances and needs of the business. Access to a computer, fast internet and a quiet place to work from are essential. There will be a solid basic salary as well as tiered commision levels to really help incentivise your sales ability.</p><p>If this sounds perfect for you, please apply with a covering letter explaining why you would be perfect for the role along with your current CV. We will not be reviewing applications that don’t have a covering letter attached, so please include one if you are seriously interested in becoming part of our team.</p><p>We look forward to hearing from you soon.</p><p>Job Types: Full-time, Permanent</p><p>Salary: £18,000.00 to £25,000.00 /year</p><p>Required experience:</p><ul><li>telesales: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 2:43:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "xap6XWlZSAmMAxlkDlzH6A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Outbound+Telesale+Executive&c=Onify&l=Remote&jk=48eb0b3289498823&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Outbound Telesales Executive - Onify Ltd - Remote",
    "content": "<div><b>Outbound Telesales Executive</b><br><span>Onify Ltd</span>     -<span>Remote</span>    <div>        <span>                £18,000 - £25,000 a year - </span>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Fancy yourself as a telesales Rockstar? Do you want to be part of the core team in a new startup with huge ambitions? If you answered yes, read on. We have something very exciting to tell you about.</p><p>ONIFY is a fast growing startup built around loyalty, customer retention and rewards. Ever wondered why you keep all those loyalty cards? Now you don’t have to. ONIFY rewards your loyalty without you having to carry, collect and locate all those annoying paper cards. Now, you can keep them all on one simple-to-use app and access them at any time.</p><p>For businesses, this gives them a complete marketing and customer retention system, with no technology required in-store. No longer are these tools just available to the big players, we are putting them in that hands of everybody so businesses can focus on what they do best. We help them get their customers back through the door time and time again. We believe that we everyone should be rewarded for being loyal to local, independent businesses and ONIFY provides the tools to do just that.</p><p>We love our product, and businesses and customers love it as well. We now need to get it in the hand in as many businesses as possible and need somebody to contact potential customers and guide them through the FREE sign up process. This role will be a mix of cold calling, building and maintaining a sales pipeline.</p><p>Our team have built marketplaces from scratch before, and we are doing it again with ONIFY. In a brand new role for us, you will be working under the direction of the CEO (founder of fillmybelly.com and Ex Just Eat director), whilst gaining a valuable insight into what it takes to build a company from the ground up, as well as understanding how everything we do affects the growth of the company.</p><p>Key skills required:</p><ul><li>Experience within a sales or telesales environment is a must</li><li>Self-motivation and ability to work remotely</li><li>Must be energetic and love what you do</li><li>A pleasant and confident telephone manner, able to speak to people at various levels of business</li><li>Able to demonstrate first-class, effective business to business communication</li><li>Able to handle rejection with the desire to hit targets</li><li>You will have good literacy and numeracy skills</li><li>Good IT skills and knowledge of CRM.</li><li>Monitor and update all sales related KPI’s</li></ul><p>ONIFY are looking for an individual who is passionate about sales and can work hard and think positive in a fast-paced sales environment. A strategic thinker, with the ability to work effectively under pressure and be able to prioritise and meet sales targets and KPI's.</p><p>We are a remote business, which means all our employees currently work from a location that suits them. If you've never worked remotely before, don’t worry, you’ll soon grow to love it. We have daily video catch ups, weekly meetings and regular chat on our communication networks, so you won’t ever feel on your own for the day.</p><p>This position is full time, however, your hours can be flexible to fit around your personal circumstances and needs of the business. Access to a computer, fast internet and a quiet place to work from are essential. There will be a solid basic salary as well as tiered commision levels to really help incentivise your sales ability.</p><p>If this sounds perfect for you, please apply with a covering letter explaining why you would be perfect for the role along with your current CV. We will not be reviewing applications that don’t have a covering letter attached, so please include one if you are seriously interested in becoming part of our team.</p><p>We look forward to hearing from you soon.</p><p>Job Types: Full-time, Permanent</p><p>Salary: £18,000.00 to £25,000.00 /year</p><p>Required experience:</p><ul><li>telesales: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 2:43:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Uxmo-IROSQuYdTrgo30SlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Business+Development+Manager&c=Tompkins+International&l=Remote&jk=dd8e2d36c43c5501&rtk=1c5gcht2e51d7fnl&from=rss",
    "title": "Business Development Manager - Tompkins International - Remote",
    "content": "<div><b>Business Development Manager</b><br><span>Tompkins International</span>     -<span>Remote</span>    </div><span><b>Business Development Manager</b><b>Group</b>: MonarchFx | Sales and Business Development<b>Location:</b> Remote Office<b>Position Type:</b> Full Time | ExemptThe Business Development Manager is responsible for new customer acquisition and to accelerate revenue achievement. The primary function of this position is to focus on new client business development and growing the qualified sales opportunities. The Business Development Manager will focus on expanding the Company’s pipeline with new business opportunities and requires cold calling on new clients to generate sales. This position promotes the Company’s initiatives to grow our brand image and industry awareness through educating prospects on MonarchFx Alliance’s services.<b>Essential Job Functions:</b><ul><li>Develop new business growth strategies to continuously identify leads and prospects for new customers clients using multiple channels.</li><li>Analyze and research the Company’s market to identify opportunities and develops relationships with high-level contacts at prospective customers.</li><li>Communicate with prospects by phone and/or written correspondence.</li><li>Research and qualify select leads from partners and other sources.</li><li>Schedule introductory meetings by phone or onsite.</li><li>Organize and tracks all business development leads and maintains accurate data files on prospects in CRM software.</li><li>Continually target companies and individuals with the excellent long-term potential to grow future prospective pipelines.</li><li>Work with team members to help develop and maintain a targeted prospect list and execute business development campaigns with active and qualified prospects.</li><li>Performs related duties as assigned to grow revenue.</li><b>Qualifications and competencies</b><b>:</b></ul><ul><li>A Bachelor’s Degree in Communications, Liberal Arts, Finance, Business, or related field and a minimum of 5 to 8 years of business development or lead generation experience in a B2B environment is required.</li><li>Hunter mentality is an absolute MUST.</li><li>Experience in the logistics, supply chain, 3PL, software or technology sector is preferred.</li><li>Proficient in Social Media platforms</li><li>Knowledge of Microsoft Office applications including Outlook, Word, PowerPoint and Excel.</li><li>Skilled in persuasive oral and written communications, including the ability to engage in meaningful conversations with all levels of an organization.</li><li>Strong ability to build and manage a strategic network, and create rapport with all levels of an organization.</li><li>Ability to take a leadership role to drive change within the organization and for external engagements. Leadership: Integrity, honesty, accountability, creativity, a commitment to the team environment, and the ability to lead change.</li><li>Ability to plan, organize, execute, document and communicate goals/activities.</li><li>Ability to think, plan and execute the effective penetration of vertical markets, prospective accounts, and upper management.</li><li>Ability to take the initiative and act independently as appropriate situations dictate.</li><b>Monarch</b><b>Fx</b> is a smarter logistics solution comprised of best-in-class supply chain companies focused on delivering cost-effective, high service level fulfillment solutions to brands and retailers.<b>Tompkins International</b> is a supply chain consulting and implementation firm that maximizes supply chain performance and value creation. We enable clients to be more profitable and valuable, while also becoming more agile, flexible, and adaptive to the marketplace. Tompkins collaborates with client teams to develop improved operations strategies, supply chain planning, and execution across all the Mega Processes of supply chains (Plan- Buy- Make- Move- Distribute- Sell).</ul></span>",
    "urlFetchPending": false,
    "published": "Jan 27, 2018 4:21:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "L-VijkH4ShmXExJ1zEsf8g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Enterprise+Program+Manager&c=Agfa&l=Home+Based&jk=4f5ac81b312075a7&rtk=1c5gsur1c40gvbl3&from=rss",
    "title": "Enterprise Program Manager - Healthcare 1 - Agfa - Home Based",
    "content": "<div><b>Enterprise Program Manager - Healthcare 1</b><br><span>Agfa</span>     -<span>Home Based</span>    </div><span><p>Agfa HealthCare, a member of the Agfa-Gevaert Group, is a leading global provider of diagnostic imaging and healthcare IT solutions. The company has nearly a century of healthcare experience and has been a pioneer on the healthcare IT market since the early 1990's. Today, Agfa HealthCare designs, develops and delivers state-of-the-art systems for capturing, managing and processing diagnostic images and clinical/administrative information for hospitals and healthcare facilities, as well as contrast media solutions to enable effective medical imaging results. The company has sales offices and agents in over 100 markets worldwide.</p><p>Serving as the face of Agfa, the Enterprise Program Manager must gain visibility to the customer’s strategy and competing projects then leverage that knowledge to identify risks and opportunities. Additionally, must build relationships with customer key stakeholders outside of IT or the core team focused solely on Enterprise Imaging (EI). Leveraging positive customer relationships into new opportunities that aligns with strategic direction of both the customer and Agfa Healthcare</p><p><b>This is a home based position and can be located in any of the following cities and surrounding areas, close to a major airport. Travel is required to meet with clients and other stake holders.</b></p><p>Salt Lake City,UT, Nashville, TN, Denver, CO, Los Angeles, CA, Atlanta, GA, Boston, MA, Philadelphia, PA, Chicago, IL</p><p><b>Major responsibilities:</b></p><ul><li>Gain an understanding of the overall EI platform and leverages that knowledge to ensure continued distribution of the solution capabilities across the customer’s organization.</li><li>Ensure all aspects of project success are met through the execution of project work plans in accordance with project’s Statement of Work (SOW). Revising the SOW as appropriate to meet changing needs and requirements.</li><li>Manage activities of Project Team members, ensuring completion of assigned tasks in accordance with schedule, resources, cost, performance, and quality objectives.</li><li>Meet and collaborate with internal and external stake holders to effectively communicate project expectations in a timely and clear manner.</li><li>Efficiently identify and solve project issues as they arise in a proactive manner.</li><li>Identify and manage project dependencies and critical path.</li><li>Ensure all Agfa Healthcare quality documents required for the project’s deployment type are accurately completed, signed and posted.</li><li>Meet on-time commitments for project’s Service Acceptance and Final Acceptance.</li></ul><p><b>Knowledge &amp; Skills:</b></p><ul><li>Advanced knowledge of current IT and Healthcare technologies</li><li>Working knowledge of hospital departmental workflow is required</li><li>Specific experience with EMR and/or RIS deployments for multi-site institutions.</li><li>Inspires others to meet deadline and work according to project management principles.</li><li>Goes beyond resolving immediate problem and takes initiative to identify like situations where the problem has not occurred, but could, and implements preventative measures.</li><li>Creates and acts on opportunities for interactions that lead to strong partnerships within and external to the organization.</li><li>Is a master presenter and draws a crowd, leaving them with the sense that his or her presentation was well worth their time.</li><li>Strong interpersonal skills with excellent negotiation, facilitation and conflict resolution skills</li><li>Proven presentation preparation and delivery skills to a diverse audience from C-suite to end users</li><li>Exemplary written and verbal communication skills</li><li>Strong executive presence</li></ul><p><b>Education:</b></p><ul><li>Bachelor’s Degree in Engineering, MIS, Computer Science, Healthcare or related field. MBA, MPA, MHA or related Master’s degree is preferred</li></ul><p><b>Certifications:</b></p><ul><li>PMP (Project Management Professional) Certification required</li><li>CIIP, ITIL or related industry certifications are beneficial</li></ul><p><b>Experience:</b></p><ul><li>5-10 years project management with 3-5 years in healthcare IT project management</li><li>Successfully deployed complete PACS system and RIS <em>or</em> Cardiology suite</li><li>Change Management know-how, C-Suite expertise, and Executive management skills</li><li>Experience translating a SOW into an actionable plan</li><li>Experience leading conversations with steering committees</li></ul><p>We offer a rewarding career in a field that impacts lives, the opportunity to work with a talented and committed team of individuals, training and career development programs, and a competitive compensation and benefits package. If you want to be part of this experience, we'll take you there!</p><p>Learn more about Agfa HealthCare and follow us on Twitter.</p><p>Agfa HealthCare Corporation is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.</p></span>",
    "urlFetchPending": false,
    "published": "Jan 27, 2018 12:31:31 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "QcfzVFc4QOqIc7g3onJzfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Enterprise+Sales+Executive&c=Cordial&l=Remote&jk=405f92f4b1a881f5&rtk=1c5gcht2e51d7fnl&from=rss",
    "title": "Enterprise Sales Executive (SoCal) - Cordial - Remote",
    "content": "<div><b>Enterprise Sales Executive (SoCal)</b><br><span>Cordial</span>     -<span>Remote</span>    </div><span><b>Enterprise Sales Executive (SoCal)</b><b>Location: Can be in LA or Orange County</b><br>Cordial is next-generation email platform built on real-time data. We solve the problems that legacy ESP’s create for marketers by simplifying data management and empowering brands to create rich personalized experiences across email and mobile. Founded in 2013 by some of the brightest minds in marketing, Cordial has significant funding from investors like Upfront Ventures and High Alpha. Cordial is helping companies like La Quinta, Teleflora, and Revolve Clothing change how they communicate with their customers. We’ve also been featured as one of San Diego’s best places to work by DMN. We’re looking for other passionate, collaborative, opinionated people to join our burgeoning team!. We believe in hard work and uncapped earning potential in a high-growth environment. We’re expanding our sales machine in the Western US, the candidate will be located in Los Angeles or Orange County.<br><br><b>WHAT WE’RE LOOKING FOR</b>Cordial is looking for a savvy, well connected Enterprise sales professional with deep experience in the email marketing, ecommerce platform or mobile messaging to expand our growth in the West. The perfect candidate will have been a repeated top performer in their region, be an excellent communicator both written and verbal (yes... words matter….), have sold technical products, run their own demos and have been successful in previous roles breaking into a territory with limited brand exposure. If you are ready to disrupt a legacy industry, compete head to head with enterprise cloud platforms and be part of next generation innovations in email, mobile and connected products, you should reach out. We have a deep pedigree in Enterprise email, data management and CRM technology, but early enough for this role to have a big impact on our growth.<br><br><b>RESPONSIBILITIES</b><ul><li>Identify and quantify customer needs and opportunities (Enterprise targets)</li><li>Exceed quarterly and annual revenue targets with consultative sales or challenger sales approach</li><li>Develop a territory, develop 5x quota in pipeline with viable opportunities, and be able to forecast accurately</li><li>Strategically within and across marketing, IT and leadership functions within the target accounts</li><br><b>REQUIREMENTS</b></ul><ul><li>5-10 years complex Saas/ software sales experience running deals as quarterback</li><li>Prior Enterprise sales experience in email, ecommerce or mobile required</li><li>Working in a fast-paced growing company environment where self-starters can excel</li><li>Excellent sales, lead development, qualification and presentation skills</li><li>Stable record with 2+ years in each organization or upward growth within the same</li><li>BA/BS or equivalent</li><br><b>CORDIAL BENEFITS:</b></ul><ul><li>Stock options for all employees</li><li>Paid Holidays, Sick leave and Self-Managed Vacation policy (we don’t cap time off)</li><li>Gym membership reimbursement</li><li>Dedicated “learning” budget for expanding skills/expertise</li><li>Medical, Dental/Vision, FSA plans</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 25, 2018 2:03:19 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "HQ1bLjc3TDKFB-9xu60kbQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/carrum-health/jobs/70649-vp-of-employer-sales",
    "title": "VP of Employer Sales",
    "content": "<div><h2>VP of Employer Sales at Carrum Health</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Sales Strategy and Management, Customer Acquisition, Healthcare Expertise, Sales and Marketing, Enterprise Sales, Sales/Marketing and Strategic Partnerships, Employee Benefits</div><div>Compensation</div><div>$150K–$225K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>At Carrum, we live and breathe our mission of transforming our healthcare system to create an unmatched experience for patients. If you are passionate about making a positive impact on the evolution of the healthcare industry and thrive in an entrepreneurial, cutting-edge environment, we would love to talk to you. You will be responsible for leading Carrum Health’s self-insured employer sales function by driving rapid client growth and revenue-generating opportunities. This leadership role will build a winning go-to-market strategy for acquiring employer clients through direct and distribution partner (e.g., broker and benefit consultant) channels. You will source demand for Carrum’s product, cultivate relationships with employers and channel partners, close deals and take full ownership of sales targets and results.</p><p>Your Impact:<br> Design and execute Carrum’s go-to-market strategy to drive revenue opportunities <br> Autonomously identify, engage, scope, and execute sales opportunities with sophisticated buyers <br> Lead the sales process including phone/web/in-person meetings, follow-through, contracting, and transition to implementation teams <br> Institutionalize best practices and process improvements to decrease sales cycle time and cost to acquire new clients <br> Establish mechanisms to effectively manage and report on the sales pipeline<br>Collaborate with the CEO to reflect the company’s vision for growth and<br>expansion into an actionable sales plan<br> Provide substantial strategic leadership and guidance within the company<br> Coordinate cross-functionally to ensure effective messaging of Carrum’s value<br>proposition, product features and partnership expectations to new clients<br> Drive Carrum’s market expansion by continuously recruiting and developing top<br>sales talent<br> Enjoy getting your hands dirty</p><p>You Will Be Successful If You Have:<br> 8+ years sales experience with 3+ years in a management or formal leadership<br>role at VP or Director level<br> Extensive experience selling into large employer groups (5000+ employees),<br>either directly or through channel partners (e.g., brokers and benefit consultants)<br> Impeccable customer focus and professionalism. Proactively asserts, clarifies and<br>validates client needs on an ongoing basis<br> Demonstrated ability in developing and successfully implementing sales and<br>marketing strategy (e.g., customer segmentation, sales process and organization<br>design, performance management and sales incentives)<br> Expertise in all aspects of the sales process including: performing initial outreach,<br>developing relationships, negotiating and closing contracts, and managing<br>ongoing relationships<br> Outstanding communication, presentation, negotiation and relationship-building<br>skills; able to engage with all levels of an organization<br> Bachelor’s Degree in business or related field</p><p>You Will Excel If You Have:<br> Experience selling health IT, medical insurance, enterprise benefits, SaaS or<br>consulting solutions into the self-insured employer market targeting CFO, HR or<br>Benefits professionals<br> Highly motivated, high-energy, must-win approach<br> Entrepreneurial vigor – you bring structure to undefined problems, identify<br>sources of value in complex environments, and convey those to diverse<br>stakeholders in a simple and compelling way<br> Deep knowledge of healthcare benefits, the healthcare industry, and the<br>employee benefits space; background in a Health Plan, Benefits Consulting or<br>Management Consulting is a plus<br> Experience successfully recruiting, developing and managing sales teams</p><p>What We Offer:<br> Competitive salary<br> Stock options<br> Open, collaborative workspace at our waterside office in South San Francisco<br> Flexible vacation policy<br> Medical insurance, 401K, free lunches and one day per week to work from home</p></div>",
    "urlFetchPending": false,
    "published": "Jan 24, 2018 10:13:33 PM",
    "tags": [
      "Customer Acquisition",
      "Employee Benefits",
      "Enterprise Sales",
      "Full Time",
      "Healthcare Expertise",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Sales and Marketing",
      "Sales/Marketing and Strategic Partnerships",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "M4Sp1cxXTuOmildygjIX0g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4106-director-demand-generation-logicmonitor",
    "title": "Director, Demand Generation @ LogicMonitor",
    "content": "<h2>              Director, Demand Generation<small> @ LogicMonitor</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-24 04:03</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us:</strong></p><p>LogicMonitor is the leading SaaS based performance monitoring platform for enterprise IT.</p><p>We love going to work and think you should too. We hold our company culture near and dear – it represents an intermix between passion for rock star work output and passion for an active, healthy life centered around family and friends. LogicMonitor represents community, collaboration and camaraderie.</p><p>This is a remote-based position where you may work from a local or home-based office. </p><p><strong>What You'll Do:</strong></p><p>Ready to ride a rocketship?   LogicMonitor, the leading enterprise hybrid monitoring solution, seeks a seasoned demand generation expert to help fuel our growth as we blast into the enterprise space.</p><p>This key leadership role will develop and execute a variety of integrated marketing programs including always on campaigns, new new logo acquisition programs, installed base expansion programs and campaigns to grow our managed service provider business.</p><p>The successful candidate will have experience growing, nurturing and mentoring high performing managers and individual contributors, working cross functionally, pushing creative boundaries and building strong relationships.</p><p>Demonstrated success growing pipeline across segments and creating new revenue streams for a SaaS business is critical.</p><p><strong>Responsibilities:</strong></p><ul><li>Own the orchestration of our drip nurture programs leveraging Marketo and Salesforce.</li><li>Manage our SEM and SEO efforts, constantly optimizing spend and analyzing results. </li><li>Drive the creation of high quality, externally facing integrated campaigns and go-to-market programs.</li><li>Work with sales to inspire, motivate and ultimately win flagship brands.</li><li>Track, measure and report against objectives.</li><li>Create assets and offers that nurture prospects and customers throughout the sales cycle.</li><li>Create, execute, measure and optimize quarterly demand generation plans.</li></ul><p><strong>Desired Skills and Experience:</strong></p><ul><li>12+ years of experience in enterprise software with a deep understanding of technology </li><li>12+ years of experience in demand generation through integrated campaigns</li><li>Must be high energy, passionate, innovative and creative</li><li>A dynamic, confident personality with the ability to successfully drive projects with minimal guidance</li><li>Proven creative thinker that can generate and execute on innovative &quot;breakout&quot; marketing ideas for integrated campaigns.</li><li>Proven track record in working successfully in a fast pace environment to effectively manage multiple projects.</li><li>BA required, MBA preferred</li></ul><p><strong>Bonus skills:</strong></p><ul><li>Expertise with Marketo, Salesforce, Powerpoint and/or Apple Keynote are huge</li><li>5+ years people management skills</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 24, 2018 5:59:23 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "5qr6hOndToW5jHqDYP7V0w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/65405/bilingual-training-executive-german-at-altus-group/",
    "title": "Bilingual Training Executive, German",
    "content": "Who we are<br /><br />Altus Analytics, a business of Altus Group, is the leading global technology partner to the commercial real estate industry and is poised for significant growth and expansion over the next three years.<br /><br />Altus Analytics brings together the collective expertise of ARGUS and Voyanta as the leading provider of CRE solutions worldwide. Our technology and industry expertise empowers commercial real estate clients and partners to work collaboratively to enhance decision making, drive performance and optimize transactional efficiency. From property budgeting, making strategic decisions about acquisitions or working with different teams, different organisations and different data, we can bring it all together.<br /><br />The opportunity<br /><br />As we focus on expanding adoption of and engagement with our ARGUS AE product across Europe, we need a new Bilingual Training Executive to join our London office. As a member of the Education team, you’ll be instructing our clients in virtual and classroom settings across the world.<br /><br />Who you are<br /><br />You are a Trainer and in-class Facilitator looking to move into the fast-paced software training world; or, you have software training experience and, you recognize the potential, excitement and opportunities at Altus Analytics. We are disrupting the #PropTech sector and joining us now is a chance to work for a market leader who is responsive to client needs, on the cutting edge of tech and supports the £10 trillion CRE industry.<br /><br />What’s in it for you<br /><br />Impact. This is a newly created role and an opportunity for someone who has been there-done that to take on the rewards of driving client growth and engagement through education.<br /><br />Career development. The experience and exposure gained as our new Training Executive, EMEA is a significant boost on a career path as you learn our product from all angles, leading to possibilities in sales, product management, consulting or other areas that fit your interests and skill set.<br /><br />Here’s just a glimpse at what you will be doing:<br />• Facilitating in-classroom training at training facilities and client sites across EMEA.<br />• Continuously changing your training methods during sessions to maintain attention.<br />• Creating custom training plans based on available technology - one size doesn’t fit all.<br />• Talking to clients, answering their questions and helping them understand our products.<br />• Working with universities to expand ARGUS’ certification program.<br /><br />So, how do we know that’s you? You have:<br />• The expertise. You have proven experience in corporate adult education and training.<br />• The education and the interest. You have a university degree and expertise in MS Office.<br />• The passion for math and technology. You are able to explain complicated financial concepts, new terminology and technical processes to a variety of audiences. You learn new software, tools and concepts easily.<br />• The flexibility. You have a valid passport and driver’s license. You are able and willing to travel up to 70% through the EMEA region.<br />• The language. You are fluently bilingual in English and German.<br />• The relationship building skills. You can easily make and nurture connections with your teammates and your clients.<br /><br />Need any more reasons to want to work with us?<br /><br />As we continue to grow, the possibilities for the people that join Altus are significant. From professional growth to innovation to collaboration we are committed to continuing to foster the right environment to help our people realize their full potential. We give our people the freedom and responsibility to take charge of their career path, bring new ideas to the forefront and work on critical projects that will shape the success of our clients.<br /><br />We thank you in advance for taking the time to learn more about what makes Altus a great place to grow your career and do some of your best work. Apply now, refer a friend or stay on top of what’s new by following us on LinkedIn.",
    "urlFetchPending": false,
    "published": "Jan 22, 2018 6:15:03 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "0qS7TZueTy-QvKHf0tSAtw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/head-of-people-operations-status",
    "title": "Head of People Operations",
    "content": "<p><strong>Status</strong></p><p>Status is building powerful decentralized apps on Ethereum that change the way we do things on the web. Our rapidly growing team is made up of self-motivated individuals who prosper in a fast-paced environment and value the ability to work from anywhere.As a product, Status is an open source discovery tool for the Ethereum blockchain that makes it easy for anyone to access apps and services built on the decentralized web. Status also allows users to browse, chat, make payments and more.</p><p><strong>Opportunity</strong></p><p>Although still in its infancy, blockchain technology is developing rapidly and is poised to have a profound impact on our social, financial and legal systems. By joining us, you’ll help to craft the way people interact with these technologies.</p><p><strong>Job role</strong></p><p>We are looking for a Head of People Operations to support the company scale.&nbsp;The role will focus on developing the culture and processes while managing all benefits and HR initiatives in our distributed team.</p><p><strong>Responsibilities</strong></p><ul><li>Development of our internal performance management, including compensation structure/normalization, promotion process, performance reviews, handling poor performance, etc.</li><li>Improvement and nurture of our Company Culture, scaling and optimizing the company culture while in a distributed team</li><li>Managing the onboarding, namely scalable onboarding for a distributed team</li><li>Identifying and proposing company benefits</li></ul><p><strong>Requirements</strong></p><ul><li>Compulsory 3+ years working experience in a remote team</li><li>Hands-on experience scaling remote teams preferably in a high-growth start-up environment</li><li>Experience implementing HR Performance, compensation and promotion processes remotely</li><li>Experience developing innovative approaches to improve organizational culture.</li><li>Trustworthy with attention to detail</li><li>Excellent active listening skills, clear communication style, and high intercultural awareness</li></ul><p><strong>Working at Status</strong></p><p>We're a remote team of made up of 55 people scattered around the globe. Everyone at Status works from a location of their choosing - and we all meet up twice a year to strategize and strengthen our relationships.</p><p>We care deeply about open source software, and our organizational structure does away with a strict hierarchy and fixed work hours. We believe in working with a high degree of autonomy while supporting the team's priorities.</p>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 10:31:46 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "kPqipOoqTRywM_H3LIA7Ow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4095-head-of-people-operations-status",
    "title": "Head of People Operations @ Status",
    "content": "<h2>              Head of People Operations<small> @ Status</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-17 08:28</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Status</strong></p><p>Status is building powerful decentralized apps on Ethereum that change the way we do things on the web. Our rapidly growing team is made up of self-motivated individuals who prosper in a fast-paced environment and value the ability to work from anywhere.As a product, Status is an open source discovery tool for the Ethereum blockchain that makes it easy for anyone to access apps and services built on the decentralized web. Status also allows users to browse, chat, make payments and more.</p><p><strong>Opportunity</strong></p><p>Although still in its infancy, blockchain technology is developing rapidly and is poised to have a profound impact on our social, financial and legal systems. By joining us, you’ll help to craft the way people interact with these technologies.</p><p><strong>Job role</strong></p><p>We are looking for a Head of People Operations to support the company scale.&nbsp;The role will focus on developing the culture and processes while managing all benefits and HR initiatives in our distributed team.</p><p><strong>Responsibilities</strong></p><ul><li>Development of our internal performance management, including compensation structure/normalization, promotion process, performance reviews, handling poor performance, etc.</li><li>Improvement and nurture of our Company Culture, scaling and optimizing the company culture while in a distributed team.</li><li>Managing the onboarding, namely scalable onboarding for a distributed team.</li><li>Identifying and proposing company benefits</li></ul><p><strong>Requirements</strong></p><ul><li>Compulsory 3+ years working experience in a remote team</li><li>Hands-on experience scaling remote teams preferably in a high-growth start-up environment</li><li>Experience implementing HR Performance, compensation and promotion processes remotely</li><li>Experience developing innovative approaches to improve organizational culture</li><li>Trustworthy with attention to detail</li><li>Excellent active listening skills, clear communication style, and high intercultural awareness</li></ul><p><strong>Working at Status</strong>We're a remote team of made up of 55 people scattered around the globe. Everyone at Status works from a location of their choosing - and we all meet up twice a year to strategize and strengthen our relationships.</p><p>We care deeply about open source software, and our organizational structure does away with a strict hierarchy and fixed work hours. We believe in working with a high degree of autonomy while supporting the team's priorities.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote (Anywhere)</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 10:27:49 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "2LETXqoLSxiJrhrg8MXnlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/status-head-of-people-operations",
    "title": "Status: Head of People Operations",
    "content": "<div>  <div>    <h2>Head of People Operations</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>Status</span><br>      <span>Headquarters: Zug, Switzerland </span><br>        <a href='https://status.im' rel='nofollow'>https://status.im</a>    </h3>  </div>    </div>  <div>    <div><strong>Status</strong></div><div><br></div><div>Status is building powerful decentralized apps on Ethereum that change the way we do things on the web. Our rapidly growing team is made up of self-motivated individuals who prosper in a fast-paced environment and value the ability to work from anywhere.As a product, Status is an open source discovery tool for the Ethereum blockchain that makes it easy for anyone to access apps and services built on the decentralized web. Status also allows users to browse, chat, make payments and more.</div><div><br></div><div><strong>Opportunity</strong></div><div><br></div><div>Although still in its infancy, blockchain technology is developing rapidly and is poised to have a profound impact on our social, financial and legal systems. By joining us, you’ll help to craft the way people interact with these technologies.</div><div><br></div><div><strong>Job role</strong></div><div><br></div><div>We are looking for a Head of People Operations to support the company scale.&nbsp;The role will focus on developing the culture and processes while managing all benefits and HR initiatives in our distributed team.</div><div><br></div><div><strong>Responsibilities</strong></div><div><br></div><ul><li>Development of our internal performance management, including compensation structure/normalization, promotion process, performance reviews, handling poor performance, etc.</li><li>Improvement and nurture of our Company Culture, scaling and optimizing the company culture while in a distributed team</li><li>Managing the onboarding, namely scalable onboarding for a distributed team</li><li>Identifying and proposing company benefits</li></ul><div><br></div><div><strong>Requirements</strong></div><div><br></div><ul><li>Compulsory 3+ years working experience in a remote team</li><li>Hands-on experience scaling remote teams preferably in a high-growth start-up environment</li><li>Experience implementing HR Performance, compensation and promotion processes remotely</li><li>Experience developing innovative approaches to improve organizational culture.</li><li>Trustworthy with attention to detail</li><li>Excellent active listening skills, clear communication style, and high intercultural awareness</li></ul><div><h4><strong><span><br></span></strong></h4></div><div><h4><strong><span>Working at Status</span></strong></h4></div><div>We're a remote team of made up of 55 people scattered around the globe. Everyone at Status works from a location of their choosing - and we all meet up twice a year to strategize and strengthen our relationships.</div><div><br></div><div>We care deeply about open source software, and our organizational structure does away with a strict hierarchy and fixed work hours. We believe in working with a high degree of autonomy while supporting the team's priorities.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please visit the following link to apply: <a href='http://grnh.se/mdlabr1' rel='nofollow'>http://grnh.se/mdlabr1</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 10:20:43 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "x6ERuvm6QXWafkC_DMPq2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/65085/head-of-digital-marketing-at-harley-therapy/",
    "title": "Head of Digital Marketing",
    "content": "This role is a unique opportunity to transform lives by spearheading our digital marketing to bring psychotherapy to a worldwide audience. The role requires leadership and vision to drive our digital strategy, but also hands-on delivery of all our campaigns to maximise the take up and effectiveness of our marketplace.<br /><br />Our vision is to put a positive spin on accessing quality help. It’s our belief that everyone can benefit from professional support - not only individuals with complex psychological conditions but people wishing to maximise their fulfilment in life.<br /><br />We are looking for a proficient marketer-designer to create and execute digital marketing strategies to promote our ground-breaking work.<br /><br />The role requires the ability to convert business objectives into marketing initiatives that are clear, attractive and deliver our conversion goals.<br /><br />In addition to creating the overarching strategy, the role is responsible for all design, production and upgrading of print and digital assets.<br /><br />Specific responsibilities will include:<br /><br />•    creating and optimising AdWords campaigns with a target on conversion <br />•    delivering SEO optimisation to drive customer acquisition on both Harley Therapy websites <br />•    producing landing pages and adverts for social media - Facebook, Instagram, Twitter etc.<br />•    creating and producing video content for digital campaign usage<br /><br />ABOUT YOU:<br /><br />•    you have experience in building a complete digital marketing channel.<br />•    you can demonstrate a track record achieving results through digital campaigns across a range of media<br />•    you are obsessed with using data to drive and inform decisions with specific experience in using Analytics tools to track and manage campaign effectiveness. <br />•    you have great copywriting skills and impeccable attention to detail<br />•    you are competent with simple CSS and HTML and have experience with content management systems (we use WordPress and MODx).<br />•    you have demonstrated ability to optimise digital campaigns across different devices &amp;amp;amp; screens.<br />•    you have prior experience in an agency or in-house team <br />•    you have a growth mindset - failures are a springboard to improvement<br />•    you are self-motivated and self-directed with a keen eye for detail<br />•    you work swiftly and smartly.<br />•    you love to learn and thrive on challenges.<br /><br />If you also have experience on Sketch &amp;amp;amp; Canvas and can use SQL you will be at an advantage.<br /><br />BENEFITS:<br /><br />Be involved with the growth of this exciting, social impact initiative at its early stage as a chief marketer. We are a small, supportive, tight-knit team passionate about improving people’s emotional wellbeing.<br /><br />•    Work remotely anywhere you like. <br />•    Work part-time around your commitments with scope for full-time hours<br />•    Invitation to two social events a year<br /><br />Additional Information<br /><br />'A small team of A+ players can run circles around a giant team of B and C players.'  Steve jobs<br /><br />We work remotely though assemble for in-person team meetings several times a year. We are looking for a UK candidate who can travel to central London when needed. <br /><br />We are an internally funded and stable startup umbrella organisation - not dependent on VC (though we use resources conservatively!)<br /><br />If you would like to be a part of this exciting movement and meet the criteria above, please submit your CV and a covering note with examples of your work/portfolio.<br /><br /><br />Closing date: We will close the post once the role is suitably filled.<br /><br />No agencies please.<br /><br />Only successful applicants will be contacted - within 2 weeks of applying.",
    "urlFetchPending": false,
    "published": "Jan 14, 2018 1:41:42 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  },
  {
    "id": "d6kO6x4JQZSmmJenkSg7qw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/4d-pipeline-python-django-javascript-developer-needed-for-multi-month-project",
    "title": "4D Pipeline: Python Django & Javascript developer needed for multi-month project",
    "content": "<div>  <div>    <h2>Python Django &amp; Javascript developer needed for multi-month project</h2>      <h4>Posted Jan 10</h4>    <h3>      <span>4D Pipeline</span><br>      <span>Headquarters: San Jose</span><br>        <a href='http://www.4Dpipeline.com/jobs' rel='nofollow'>www.4Dpipeline.com/jobs</a>    </h3>  </div>    </div>  <div>    <div>We are looking for a:<br></div><div><b>Python Django &amp; Javascript developer needed for globalization / localization of an existing project. Must have <i>at least</i> three years experience working with recent Django versions (including models and views) and JS frontends, as well as at least one successful project involving localization (going from English to other languages) in Python and JS . Basic understanding of Japanese is a bonus.</b></div><div><b>In your application, please outline how the localization solutions you worked on previously were structured.</b></div><div><br></div><div>Conditions:<br></div><div></div><div>- Work from anywhere in the world (Europe or Eastern Europe is highly preferred).<br></div><div></div><div>- Unless otherwise stated, a minimum of 30 hours per week - must be able to work week days - not just weekends. If you have a fulltime job please do not apply.<br></div><div></div><div>- Must be an individual not an agency/firm.<br></div><div></div><div>- As part of our hiring process you will have a video interview and a programming test.&nbsp;<br></div><div></div><div>- Working English required</div><div><br></div><div>Having a Great Team has been our simple formula for our success.<br></div><div>We are looking for seasoned and experienced developers who are brilliant at what they do.<br></div><div>In return - we will give you great work, great clients, great team, and a long term great profitable relationship.<br></div><div>We work with some of the best Brands and companies in the world, clients include Epic Games, AUDI, AMD, Intel, NVIDIA, IKEA, BMW Mini, VANS, Unity Technology, Xerox PARC, and many others, including fast growing startups.</div><div><br></div><div>Any questions - happy to answer.</div><div><br></div><div>&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send in your CV and/or LinkedIN profile to:<a href='mailto:awesomejob@4Dpipeline.com' rel='nofollow'>awesomejob@4Dpipeline.com</a>- Please state your location- Please provide some examples of past Django projects- Please outline any past localizations you worked on</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 9, 2018 12:21:03 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "5d_ThvRFSFKoN1DPa9qp_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4076-vp-of-operations-kindly-care",
    "title": "VP of Operations @ Kindly Care",
    "content": "<h2>              VP of Operations<small> @ Kindly Care</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-08 03:30</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us:</strong></p><p>Kindly Care helps families find, hire, and manage private caregivers so that their elderly loved ones can age in their homes rather having to move into assisted living facilities. We take pride in the fact that we’re working on one of the most pressing problems in our society: ensuring that our seniors are taken care of despite seemingly endless challenges caused by fiscal and labor shortages.</p><p>We’re a geographically distributed company, with 4 team members working out of our office in San Francisco and about 40 others working from all over the US, Canada, Mexico and a number of other countries. We have built all products and processes to equally accommodate on-site and remote team members, and we highly value this ability to attract the best talent from across the world.</p><p><strong>About This Role:</strong></p><p>We’re looking for a VP of Operations to ensure flawless execution of all of our teams. You will be reporting to our CEO, and your success will be measured in the quality of our service and our ability to scale our processes. Your scope of work will cover the conceptual design of our process maps, budget planning, as well as management of our client- and caregiver-facing operational departments. Specifically, your direct reports will include team leads from these areas:</p><ul><li>Talent Operations – responsible for sourcing, vetting, and retention of our caregivers</li><li>Client Operations – following up on all client requests</li><li>Support – resolving all tickets filed by our clients and caregivers</li><li>Accounting – assistance with timesheets and billing</li></ul><p>While you don’t have to be an expert in any of the above areas, you will have to get comfortable with the subject matter in order to create efficiencies across all those teams.</p><p>Due to the high volume of inbound and outbound calls across all of our departments, special consideration will be given to the candidate who has experience in call center operations. Specifically, we’d like to hear about your experience with various telephony software solutions, task workflows, ticketing systems, quality assurance processes, and general training best practices.</p><p><strong>About You:</strong></p><p>The ideal candidate will have already proven their ability to grow and manage operational teams, although we will consider all applicants who can demonstrate extraordinary achievement in their careers. We value relevant experience, but we are equally intrigued by generalists who are able to take a first-principles approach and come up with creative solutions. Below are the general qualifications we’re looking for:</p><ul><li>5+ years of experience in building and scaling teams</li><li>Thorough understanding of call center best practices</li><li>Proven ability to resolve conflicts and win over clients</li><li>Exposure to entrepreneurial environments and startup mentality</li><li>Familiarity with process mapping tools and best practices</li></ul><p>Last but not least, you need to have the leadership skills that will help you motivate your teams and energize them to do the best work of their lives.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 8, 2018 5:30:33 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "gKW4yYNHRcuk1wPgeyV4KA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/taxjar-head-of-partnerships",
    "title": "TaxJar: Head of Partnerships",
    "content": "<div>  <div>    <h2>Head of Partnerships</h2>      <h4>Posted Jan  6</h4>    <h3>      <span>TaxJar</span><br>      <span>Headquarters: Boston, MA</span><br>        <a href='http://www.taxjar.com/jobs' rel='nofollow'>www.taxjar.com/jobs</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttp%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fwww.taxjar.com%2525252525252525252525252F' rel='nofollow'><span>TaxJar</span></a><span> has an immediate opening for an enthusiastic, experienced, and driven Head of Partnerships to help small and medium sized eCommerce businesses save time and money on sales tax compliance.</span></div><div><br></div><div><span><b>This is a full-time remote position, available to folks located in the continental US only.</b></span></div><div><br></div><div><span><b>About TaxJar</b></span></div><div><br></div><div><span>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 10,000 businesses. We were founded to help eCommerce owners spend less time on sales tax and more time growing the businesses they love. We’re passionate about creating simple solutions and leveraging technology to solve complicated sales tax issues. We're not just about sales tax though, we're a technology-driven company focused on providing a great experience for both merchants and developers.</span></div><div><br></div><div><span>We offer </span><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttps%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fwww.taxjar.com%2525252525252525252525252Fsales-tax-reporting' rel='nofollow'><span>TaxJar Reports</span></a><span> , a simple web-based reporting tool that organizes sales tax data into return-ready reports by state; </span><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttps%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fwww.taxjar.com%2525252525252525252525252Fautofile' rel='nofollow'><span>AutoFile</span></a><span>, a service that automatically files sales tax returns; and </span><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttps%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fwww.taxjar.com%2525252525252525252525252Fapi' rel='nofollow'><span>SmartCalcs API</span></a><span>, a modern, accurate, sales tax API for developers to outsource sales tax rates and calculations. For developers, we have created an helpful </span><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttps%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fdevelopers.taxjar.com%2525252525252525252525252Fdemo%2525252525252525252525252F' rel='nofollow'><span>API demo environment</span></a><span> and also are fanatics about creating and maintaining great API </span><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fworkable.com%2525252525252525252Fnr%2525252525252525253Fl%2525252525252525253Dhttp%252525252525252525253A%252525252525252525252F%252525252525252525252Fworkable.com%252525252525252525252Fnr%252525252525252525253Fl%252525252525252525253Dhttp%25252525252525252525253A%25252525252525252525252F%25252525252525252525252Fworkable.com%25252525252525252525252Fnr%25252525252525252525253Fl%25252525252525252525253Dhttps%2525252525252525252525253A%2525252525252525252525252F%2525252525252525252525252Fdevelopers.taxjar.com%2525252525252525252525252Fapi%2525252525252525252525252Freference%2525252525252525252525252F' rel='nofollow'><span>documentation</span></a><span>.</span></div><div><br></div><div><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttps%252525252525253A%252525252525252F%252525252525252Flife.taxjar.com%252525252525252F' rel='nofollow'><span>We’re a happy team</span></a><span> and we all really love what we do. We've created a space where high-achievers can succeed, but are also safe to fail. We're profitable and focused on growing TaxJar sustainably. We're always learning how to make TaxJar the best place to work for all of us, and not just another tech startup. We’re always looking for an amazing new teammates to come share in the excitement of solving real-world problems with technology.</span></div><div><br></div><div><span><b>About TaxJar’s Growth Team: </b></span></div><div><br></div><div><span>The mission of TaxJar’s growth team consists of sales, marketing, content, and partnerships, and our mission in is clear: get more eCommerce businesses in the US to experience using TaxJar for managing their sales tax reporting, filing and calculations, and to help show those businesses the tremendous value in cost and time-savings in choosing to fully automate their sales tax needs.</span></div><div><br></div><div><span>The team’s goal is to maximize the number of qualified customers that begin our free trial and ensure the highest percentage of those folks end up as a customers on the other side. Our team is small, but we have a huge impact on the business. We work very closely with &nbsp;the customer success and product development teams in order to deliver on these goals.</span></div><div><br></div><div><span>We are looking to expand the team with a talented and experienced Head of Partnership that fully understands how to own and grow the relationships with our partners.</span></div><div><br></div><div><span><b>Areas of focus for this role will be</b></span></div><div><br></div><div><span>1. Working with our existing eCommerce and channel partners to increase TaxJar’s exposure in their ecosystems, and develop plans to create mutual success. These partnerships include eCommerce carts, marketplaces, and key influencers of these channels.</span></div><div><br></div><div><span>2. Establish and grow a program to work with the eCommerce channel partners, including systems integrators and digital agencies who build, deploy and maintain eCommerce sites for merchants, and develop a process to measure success of the channel.</span></div><div><br></div><div><span>3. Own the strategy for future partnerships and TaxJar integrations, and execute on a partner roadmap. This will also include building our in-house and third party integrations strategy, developing our affiliate program, and building plans to work with CPAs and tax professionals.</span></div><div><br></div><div><span>4. Build a partnerships team. This role will begin as a very hands-on execution role with no direct reports, but expect that a successful team member will develop the processes including establishment of KPIs and dashboards, reporting, and ultimately build out a partnerships team based on his or her recommended growth plan, and primarily funded through revenue growth generated through partnerships.</span></div><div><br></div><div><span><b>10 things About You…</b></span></div><div><br></div><ol><li><span>You have a track record of building strong relationships</span><span>. You’ve been able to build a large partner &amp; channel marketing base in previous roles of customers and partners that know and trust you. You’ve demonstrated results delivering on partner KPIs in the past.</span></li><li><span>You can see the full-picture</span><span>. You’re thoughtful and organized. Before beginning a project, you take the time to understand both “why we’re doing this” and “why it makes sense to do this now”.</span></li><li><span>You’re a pro at communicating</span><span>. When working with the team and externally with customers, you’re a pro at both communicating clearly and listening to feedback. You have excellent visual and verbal communication skills. You’re a great writer who can effectively and creatively communicate TaxJar’s value to businesses across a variety of formats and platforms.</span></li><li><span>You’re a self-starter with an entrepreneurial mindset</span><span>, able to build and execute a plan with imperfect data. You’re resourceful and scrappy and able to leverage content and tools to get programs started quickly. You have an understanding of complete go-to-market planning and execution.</span></li><li><span>You have a strong work ethic with the ability to prioritize</span><span>, you meet deadlines and requirements of internal and external customers by responding promptly and thoroughly with all types of requests.</span></li><li><span>You’re an excellent project manager</span><span> who can be counted on to deliver quality results for multiple projects to completion on a deadline.</span></li><li><span>You’re a team player, and a team builder</span><span>. You step in to help when others need you and your job is to make “all boats rise” on our team. You’re also fully open to giving and receiving thoughtful, constructive straightforward feedback as you learn and grow. You have experience in building out a high performing team.</span></li><li><span>You understand the role of education in the sales process</span><span>. You’ve had experience designing and implementing programs and scaleable trainings to help educate channel partners on your product’s value and purpose.</span></li><li><span>You’ve closely partnered with sales</span><span> or have worked in a sales environment in previous roles. You’re able to provide consultative sales support and training/demonstrations for partners and customers.</span></li><li><span>You’ve managed and grown a partner program from the ground up</span><span> and have shown the ability to initiate processes, effectively manage partners, build materials and structure a program build strong relationships and drive additional leads.</span></li></ol><div><br></div><div><span><b>If that sounds like you, here’s what we need you to help with:</b></span></div><div><br></div><ul><li><span>Develop and maintain multi-level relationships with key partner brands, customers, and influencers. Collaborate with partners to identify and creative high-value co-marketing opportunities.</span><br><br></li><li><span>Build a playbook to launch and grow the channel marketing program, and then execute on it.</span><br><br></li><li><span>Take ownership of the TaxJar affiliate program. Create opportunities and incentives for new partners to join our channel and affiliate programs.</span><br><br></li><li><span>Build a plan to expand TaxJar’s data integration partners, including additional eCommerce and ERP integrations, and considering internally build and third party integrations</span><br><br></li><li><span>Develop a plan for building a channel of CPAs and Tax Professionals, and work closely with product development to build the features they need in TaxJar.</span><br><br></li><li><span>Work closely with marketing to define and craft messaging, positioning, and core marketing collateral for programs.</span><br><br></li><li><span>Proactively drive all internal and partner communications for channel programs, including sharing of best practices and case studies to drive further buy-in and adoption of TaxJar across channels.</span><br><br></li><li><span>Manage demand generation programs like webinars, blogs, white papers, etc. for partners and work closely with growth team to optimize effectiveness of campaigns.</span><br><br></li><li><span>Develop and execute sales tax education programs for the TaxJar partner community.</span><br><br></li><li><span>Follow channel programs through to completion by working closely with sales to qualify leads. and completing post-program ROI analysis. Always be willing to dive into our data and help the team understand how we’re doing and where we can improve.</span><br><br></li><li><span>Willingness to travel and attend in-person trade shows and live events with customers and communicate with partners through various channels including social media, slack, etc</span><br></li></ul><div><br></div><div><span><b>Preferred Qualifications</b></span></div><div><br></div><ul><li><span>5+ years with partnerships experience in the tech space, </span><span>preferably in marketing SaaS technologies to eCommerce audiences</span></li><li><span>2+ years of leading a team or managing people</span><br><br></li><li><span>Strong, existing relationships in eCommerce is a big plus</span><br></li></ul><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://taxjar.workable.com/jobs/636571' rel='nofollow'>https://taxjar.workable.com/jobs/636571</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 5, 2018 11:43:22 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "KUA03sjNSpWSrKtSLZ6y3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/lean-startup-co-executive-producer",
    "title": "Lean Startup Co: Executive Producer",
    "content": "<div>  <div>    <h2>Executive Producer</h2>      <h4>Posted Jan  6</h4>    <h3>      <span>Lean Startup Co</span><br>      <span>Headquarters: United States</span><br>        <a href='https://lean-startup-co.breezy.hr/p/2a753223c89d01-executive-producer?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/2a753223c89d01-executive-producer?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div><span>ABOUT US:</span><br></div><div>Born from the global movement spawned by Eric Ries’ book,&nbsp;<a href='http://theleanstartup.com/book' rel='nofollow'>The Lean Startup</a>,&nbsp;<a href='http://leanstartup.co/' rel='nofollow'>Lean Startup Company</a>&nbsp;offers the most exciting education solutions in modern management available today. We bring the entrepreneurial spirit to all types of organizations and help them transform how they work. Our education efforts, media and live events serve every size company and sector of the economy - from the the aspiring entrepreneur to high-growth startups, nonprofits, and large bureaucratic institutions.</div><div><br></div><div>A cutting-edge methodology, Lean Startup principles provide a scientific approach to problem-solving and a&nbsp;<span>framework for innovation</span><span>,</span>&nbsp;so you can learn what your customers really want. It’s about testing your vision continuously, so you can effectively adapt and adjust before it’s too late.</div><div></div><div></div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div>Our&nbsp;<a href='https://leanstartup.co/2017-conference/' rel='nofollow'><span>annual Lean Startup Conference</span></a>&nbsp;brings the big ideas from Eric Ries’s books off the page to show how organizations are making them real around the world. Alongside keynotes and case studies, we offer workshops for an immersive experience, breaking off a chunk of practice and working through it with seasoned experts. We bring the world’s brightest minds in entrepreneurial management together with entrepreneurs and corporate innovators, in one place, to share challenges, inspiration and and learning.</div><div><br></div><div>As the Lean Startup movement grows, there’s a growing need to connect those who want to learn with those who want to help them move towards working the&nbsp;<a href='http://www.thestartupway.com/' rel='nofollow'>Startup Way</a>.</div><div><br></div><div>And&nbsp;<a href='https://leanstartup.co/' rel='nofollow'>Lean Startup Co</a>&nbsp;is the answer.</div><div><br></div><div>As the seasoned full-time&nbsp;<span>Executive Producer</span>&nbsp;for Lean Startup Co, you’ll lead and design the aforementioned flagship conference. You’ll connect entrepreneurs and corporate innovators with inspiring Lean Startup experts. You’ll design an unforgettable experience that’ll have them signing up year after year.</div><div><br></div><div>You’re our ideal candidate if you’re excited to practice what we preach and help us identify&nbsp;<span><em>how we can reach more people, make more impact and solve the world’s biggest problems.</em></span></div><div><br></div><div><span></span></div><div><br></div><div><span>As our in-house Executive Producer you will own and drive the following major initiatives:</span></div><div><br></div><ul><li>Annual flagship conference (executive producer)</li><li>International partner summits (strategy and advisory)</li></ul><div></div><div><br></div><div><span>You’ll thrive in this role if you have a high level of success in these five areas of core competency:</span></div><div><br></div><ol><li><em>Track record of complete ownership of all aspects of major event production</em></li><li>Proven ability to oversee concept, design, operations, finance, editorial, marketing, media, coordination of production and technical aspects, and directing of staff (venues, clients, vendors, technicians, internal team, etc.)</li></ol><div><li><em>Track record of creativity and innovation in major event production</em></li></div><ul><li>You’ve created a program and experience for a 1,000+ person conference that attracts new attendees, addresses emerging trends, and features high-quality speakers and industry experts.</li><li>Although you can demonstrate that you always nail both the quantitative and technical aspects, you also pride yourself on your ability to impress attendees with the visual aspects of an event.</li></ul><div><li><em>Track record of leading and managing a successful event team</em></li></div><ul><li>You have significant experience with and enjoy recruiting, hiring and developing a high performing team</li></ul><div><li><em>Demonstration of business acumen and financially savvy</em></li></div><ul><li>Not only are you an event extraordinaire, but you are also financially savvy. You set and manage realistic budgets, utilize a PO system and believe in and practice financial stewardship.</li><li>You understand the importance of metrics, leading indicators and how to tie ticket sales, sponsorship goals, and your team’s performance to achieve revenue goals.</li></ul><div><li><em>Data-Driven Marketing</em></li></div><ul><li>You have a marketing mindset and love using data to make smart decisions and achieve desired outcomes.</li></ul><div></div><div><br></div><div><span>As the Executive Producer, you will champion addressing the needs of our community through:</span></div><div><br></div><ul><li>Managing and overseeing all event production, including live 2,000+-person Annual Flagship Conference (next scheduled conference is Fall 2018).</li><li>Produce all events from conception to execution, with livestream.</li><li>Oversee strategy to support the success of international summit partner events.</li></ul><div><li>Managing and overseeing a marketing team to</li></div><ul><li>Ensure our global community of entrepreneurs understands the value proposition of our live experiences by leveraging editorial content.</li><li>Conduct customer development, analyze past conference data and trends, run experiments, and set milestones and outcomes.</li><li>Leverage relevant tools to promote events such as social channels, digital marketing plan and logistics, event website, AMAs, webcasts, blogs, etc.</li></ul><div></div><div><br></div><div><span>You’ll fit right into this role and our team if:</span></div><div><br></div><ul><li>You thrive in a fast-paced environment where we love challenging ourselves (in Lean Startup fashion) to build, measure, and learn.</li><li>You LOVE solving problems and aren’t afraid to admit you are obsessed with getting the details right.</li><li>You believe in and practice financial stewardship and have a deep understanding of the business side of production.</li><li>You believe in the importance of aligning your work with company goals, and the integrity of the brand.</li><li>You possess high levels of integrity, autonomy, and self-motivation.</li><li>You are a natural leader and have a track record of developing and mentoring teams:</li><li>You are assertive, fair, and capable of directing others and implementing projects with little to no supervision.</li><li>You have a keen ability to set priorities across functions, to lead and work well with cross-functional teams.</li><li>You have a positive leadership style, hold yourself accountable for your actions, encourage the team to learn from mistakes, and recognize your team for their efforts.</li><li>You have experience with and enjoy managing a remote team and leading team onsites.</li></ul><div></div><div><br></div><div><span>Requirements:</span></div><div><br></div><ul><li>BA/BS in Marketing or Business preferred</li><li>5-8+ years of experience leading creative and production teams</li><li>5+ years in managing Corporate Events or Tech events</li><li>Executive level communication, interpersonal and delegation skills.</li><li>Must have experience with and enjoy recruiting, hiring and developing a high performing team.</li><li>Must have ability to juggle and prioritize many different tasks simultaneously, and enjoy collaborating with a wide range of teams.</li><li>Familiarity with and enjoy working collaboratively (Slack, Zoom, Google apps).</li><li>Experience working with union regulations.</li><li>Bonus if you have experience in Lean Startup, tech and innovation space.</li></ul><div></div><div></div><div><br></div><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ul><li><em>We encourage growth.</em></li><li>You’ll have your very own Lean Startup coach to support practicing Lean Startup methods in achieving event outcomes (i.e., A/B testing, leading indicators, actionable metrics, etc.)</li></ul><div><li><em>You can work from wherever you want, as long as you have a working laptop and solid internet connection.</em></li></div><ul><li>We’re a 100% remote team using fun collaborative tools.</li><li>We encourage unplugging and prefer you don’t check email while you’re away.</li></ul><div><li><em>Big impact.</em></li></div><ul><li>If you’ve ever wanted to be in the middle of it all and leave a legacy, this is it. The work we do will go down in history as powerfully-transformative.</li><li>We are a startup with&nbsp;<span>global brand recognition&nbsp;</span>headquartered in San Francisco, CA. Our global community will give you a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li></ul><div></div><div><br></div><div>The&nbsp;<span>position is full-time remote,</span>&nbsp;but we ask that you’re 1) located in&nbsp;<span>the U.S.&nbsp;</span>and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div><span>Compensation</span>: Base DOE + participation in the financial success of your events</div><div>*Note - We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/2a753223c89d01-executive-producer?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/2a753223c89d01-executive-producer?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 5, 2018 6:13:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "lx3YT40MSl-YZ5w8Qe2KOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164336/senior-project-manager-professional-services-scrapinghub?a=T7189lLpyUw",
    "title": "Senior Project Manager - Professional Services at Scrapinghub () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Product Manager</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><strong>About the Job:</strong>We are seeking a Project Manager to join our Professional Services team. &nbsp;Our Enterprise business is growing and as Project Manager you will be responsible for leading one or more teams in delivering end-to-end Projects and Solutions to our existing and new customers.As People Manager you will lead and motivate a team of Software Developers. &nbsp;<p><strong>Responsibilities:</strong></p><ul><ul><li>Successful execution and management of customer projects</li><li>People management and team leadership to Software Engineers</li><li>Work collaboratively with Development, Product, QA and Sales teams to ensure we provide the best solutions to our customers</li><li>Work closely with our Sales and Customer Success Teams for ongoing Services management post launch</li></ul></ul><strong>About You:</strong>Focus on customer and service delivery metricsDeliver and manage high-quality projects to our customersComfortable &nbsp;working within a collaborative start-up cultureA natural leader who takes initiative and gets things done<p><strong>Required Skills:</strong></p><ul><ul><li>4+ years of technical project management experience, coupled with People Management responsibility</li><li>Strong working knowledge of Project Management &nbsp;methodologies, &nbsp;Agile desirable</li><li>An excellent communicator with demonstrated influencing and negotiating skills</li><li>Natural ability to work independently and without boundaries</li><li>Flexibility to meet work demands within international time zones</li><li>Disciplined in planning and execution to achieve goals</li><li>Customer and commercial awareness &nbsp;</li></ul></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of over 100 Scrapinghubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Scrapinghubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Autonomy to make the role your own, supported by great people</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                            <div>                                 Global team meet ups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 4, 2018 10:12:25 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "i4IwfayHSBy3vC_J7TJuNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64076",
    "title": "Head of Marketing",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Head of Marketing</strong><br>Remote // Full Time<br><br><strong>Join one of the largest and fastest growing yoga and fitness platforms on the web.</strong><br><br>DOYOUYOGA is looking for an experienced project lead with a marketing or operations background to join our fun and ambitious team from around the world.<br><br><strong>About DOYOUYOGA</strong><br><br>DOYOUYOGA is a young and rapidly growing brand serving millions of lifestyle­ conscious consumers worldwide. With over 400,000 members and millions of workouts logged, DYY is one of the most recognized brands in its space. But this is just the beginning...<br><br><strong>About the position</strong><br><br>We’re a small but ambitious team that’s ready to take on the world. And that’s where you come into play. We’re looking for an experienced doer. Somebody who’s not afraid to get her/his hands dirty and work across various disciplines to achieve great things together with a passionate team. Our new Head of Marketing will lead our content creation, social media, and onsite marketing efforts. She/he will furthermore manage team operations and spearhead a variety of existing and new projects.<br><br>The truth is, we’re not looking for a specific candidate. This role will inevitably be tailored to the individual who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you love leading digital projects, working with and leading remote teams, and building a brand that millions love.<br><br><strong>Requirements</strong><br><br></p><ul><li>You have proven, senior expertise (3+ years) in one or more of the following: Digital marketing, digital project management, operations;<br></li><li>You’ve managed interdisciplinary teams and you’re very comfortable doing it;<br></li><li>You’re a goal-oriented, creative leader who thinks outside the box to reach our strategic goals;<br></li><li>You’re self-confident, modest, and have the ability to receive and give constructive feedback;<br></li><li>You have outstanding communication and interpersonal skills;<br></li><li>You’re based in Europe or Asia (American and Australian time zones do not work. This is a strict requirement.);<br></li><li>You have a passion for healthy and active living (no yoga knowledge required);<br></li><li>Heads up “digital nomads”: We’re a remote team, so you can work from anywhere. However, we do not hire “digital nomads” who spend most of their time traveling. We’re working on achieving great things, so do not apply if you don’t have a permanent place to stay or change your location every couple of weeks.<br><br><strong>What you get</strong><br><br></li><li>Challenging and rewarding projects with fast decision making, flat hierarchies, and quick results that impact millions of users;<br></li><li>Fun and ambitious colleagues that will support, challenge, and inspire you;<br></li><li>Work remotely with flexible hours;<br></li><li>24 vacation days per year;<br></li><li>Competitive salary package (incl. profit sharing plan);<br></li><li>Long-term contract. We want you to stay with us!<br></li><li>If you are based in Hong Kong, you will be hired as a regular employee. If you are not based in Hong Kong, you will be hired as a full time contractor. Either way, all benefits listed here are the same.<br><br><strong>Important: Please tell us your permanent location (City and Country).</strong><br><br>Sounds good? Then apply :-)</li></ul></span></td><td></td><td></td><td><a href='mailto:jobs%40skyrocket.cc?subject=Application%20for%20Head%20of%20Marketing%20at%20Doyouyoga&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Head%20of%20Marketing%20at%20Doyouyoga' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 5:12:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "PN9ZKAReSPO9GHsLiZMqWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16060524",
    "title": "MyDataProvider.com | Business Development Manager | Minsk, Belarus | REMOTE OK",
    "content": "<div>                  <span>MyDataProvider.com | Business Development Manager | Minsk, Belarus | REMOTE OK<p><a href='https://MyDataProvider.com' rel='nofollow'>https://MyDataProvider.com</a> builds web scraping services for ecommerce &amp; business.</p><p>- data extraction</p><p>- price monitoring</p><p>- master data management</p><p>- repricing</p><p>- products import &amp; sync : shopify, prestashop, woocommerce, opencart etc</p><p>- bot development</p><p>- databases sync</p><p>- orders processing (automatic)</p><p>- no-API integrations</p><p>- suppliers integration</p><p>Find more here : <a href='https://mydataprovider.com/careers/' rel='nofollow'>https://mydataprovider.com/careers/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 2:50:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "iNhTY22bTYaQmVwl0FpUtw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16059022",
    "title": "Kindly Care | San Francisco | VP of Operations | REMOTE | https://www.kindlycare.com",
    "content": "<div>                  <span>Kindly Care | San Francisco | VP of Operations | REMOTE | <a href='https://www.kindlycare.com' rel='nofollow'>https://www.kindlycare.com</a><p>Kindly Care helps families find, hire, and manage private caregivers so that their elderly loved ones can age in their homes rather having to move into assisted living facilities. We take pride in the fact that we’re working on one of the most pressing problems in our society: ensuring that our seniors are taken care of despite seemingly endless challenges caused by fiscal and labor shortages.</p><p>We’re a geographically distributed company, with 4 team members working out of our office in San Francisco and about 40 others working from all over the US, Canada, Mexico and a number of other countries. We have built all products and processes to equally accommodate on-site and remote team members, and we highly value this ability to attract the best talent from across the world.</p><p>We’re looking for a VP of Operations to ensure flawless execution of all of our teams. You will be reporting to our CEO, and your success will be measured in the quality of our service and our ability to scale our processes. Your scope of work will cover the conceptual design of our process maps, budget planning, as well as management of our client- and caregiver-facing operational departments.</p><p>More info: <a href='https://www.kindlycare.com/vp-operations/' rel='nofollow'>https://www.kindlycare.com/vp-operations/</a></p><p>Let's chat! I am Igor and you can reach me at hr@kindlycare.com.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 9:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "VnLfx893QW-UneUqC0SCtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64062",
    "title": "Director Engineering",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Director, Engineering</strong></p><br><p><em><span>Location: </span></em><em><span>Flexible (Boston preferred)</span></em></p><br><p><em><span>Position is available: Immediately</span></em></p><br><p><strong><strong>THE OPPORTUNITY</strong></strong></p><br><p><span>Reporting to the Vice President, Technology, the Director, Engineering is responsible for managing members of the Engineering Team who create the software products and tools that best support our mission. They will partner closely with various internal teams while managing the team responsible for building the capabilities and features for a web application (myANet) that provides access to data reports and instructional materials that teachers and school leaders use to help shape excellent instruction for students. The Director, Engineering &nbsp;will oversee the development of our software solutions, creating the capabilities and enhancements that are needed to support our work by leveraging a combination of custom software applications and integration of 3rd party services into our technical platform. &nbsp;</span></p><br><p><span>ANet is flexible to remote working with appropriate experience and a history of successfully mentoring other developers remotely. Occasional travel to ANet’s National Office in Boston will be necessary, so proximity to the New England area and eastern time zone is preferable. </span></p><br><p><strong><strong>WHAT YOU’LL DO</strong></strong></p><br><ul><br><li><span>Build, develop, and retain a high-performing and highly engaged team of engineers</span></li><br><li><span>Lead the development of our software applications and tools</span></li><br><li><span>Manage software deployments (DevOps), manage our AWS environment</span></li><br><li><span>Represent Engineering in strategic product discussions, helping to scope solutions to meet both timing needs as well as business requirements</span></li><br><li><span>Build relationships and collaborate with cross-functional peers, ensuring strong communication and coordination </span></li><br><li><span>Work with the Vice President of Technology to manage our Engineering budget, allocate resources, and to ensure the team is delivering high quality products on-time and within budget</span></li><br><li><span>Improve our technical infrastructure; Obsesses about technical debt</span></li><br><li><span>Work with VP, Product Management on overall software development processes</span></li><br><li><span>Lead the team in executing the development sprints</span></li><br><li><span>Champion ANet’s core values</span></li><br></ul><br><p><strong><strong>WHO YOU ARE AND WHAT YOU BRING</strong></strong></p><br><p><strong><span>In order to be successful in this role, candidates </span><strong>must </strong><span>demonstrate the following:</span></strong></p><br><ul><br><li><span>You have a track record of building and managing successful Agile engineering teams and are energized by developing and coaching others to do their best work</span></li><br><li><span>You have direct experience in a combination of the following:</span></li><br></ul><br><ul><br><ul><br><li><span>Scrum or other Agile development processes</span></li><br><li><span>Cloud-based infrastructure on AWS, including continuous integration and deployment</span></li><br><li><span>RESTful Web Services</span></li><br><li><span>Cloud-based data services, preferably with both SQL and NoSQL</span></li><br><li><span>Java, Angular, and/or Go programming language</span></li><br></ul><br><li><span>You know what it takes to develop and release large, high-quality software applications and have demonstrated exceptional judgment regarding resource tradeoffs</span></li><br><li><span>You are adept at project and time management, with experience leading long-term projects alongside changing priorities in both project and product requirements</span></li><br></ul><br><ul><br><li><span>You are an exceptional communicator, both written and verbal, and are skilled in communicating with audiences that have varying levels of technical expertise</span></li><br><li><span>You believe in ANet’s mission and share our passion for increasing opportunities for children in underserved communities while operating with a sense of urgency in the support of schools</span></li><br><li><span>You are committed to living out ANet’s Core Values daily and are open to examining personal archetypes and bias while discussing topics related to race, class, and privilege, all of which relate to our Advance Equity and People Matter values.</span></li><br></ul><br><p><span>Ideal candidates may also demonstrate the following </span><strong>preferred </strong><span>qualifications:</span></p><br><ul><br><li><span>You have prior software development experience in an education, EdTech, and/or nonprofit setting</span></li><br><li><span>You bring exposure to building products or services for the education market, ideally for teachers </span></li><br><li><span>You have a Bachelor’s Degree in Computer Science, Math, Engineering or related degree </span></li><br><li><span>For candidates interested in working remotely, you bring demonstrated experience and previous success working remotely</span></li><br></ul><br><br><p><strong><strong>WHAT WE OFFER</strong></strong></p><br><p><span>ANet offers highly competitive compensation based on prior experience and qualifications as well as comprehensive benefits in order to best support our people. Benefits we offer include: health, dental and vision insurance where ANet pays 80% of the cost of these benefits for employees and their families/domestic partner; 3 weeks of vacation (4 weeks after two years with ANet); 10 paid holidays with paid days off between the Christmas and New Year’s holidays; a paid floating holiday; paid sick &amp; personal days; paid parental leave; retirement plan options; commuter benefits; tuition reimbursement; &nbsp;flexible spending accounts; short and long-term disability coverage; and basic life and personal accident insurance.</span></p><br><p><strong><strong>HOW TO APPLY</strong></strong></p><br><p><span>We are accepting applications for this position immediately. &nbsp;To apply, please visit our Job Board (</span><a href='http://www.achievementnetwork.org/careers/' rel='nofollow'><span>http://www.achievementnetwork.org/careers/</span></a><span>). After clicking on the title associated with this role, you will be prompted to create an application and upload a resume and thoughtful cover letter.</span><span> In your cover letter, please outline why you are interested in working for ANet and how your skills and experience meet the qualifications of the position. Applications will be reviewed on a rolling and urgent basis.</span></p><br><p><strong><em>ANet is committed to maximizing the diversity of our organization. We are an equal opportunity employer and encourage individuals of all ethnic and racial backgrounds and gender identities to apply to our positions.</em></strong></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 11:32:34 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "50% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "5Gq5tUX5Tp-KnoU9GfGgKA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16054941",
    "title": "Origin (https://www.originprotocol.com) is a blockchain project focused on building the sharing economy without intermediaries. We're creating ...",
    "content": "<div>                  <span>Origin (<a href='https://www.originprotocol.com' rel='nofollow'>https://www.originprotocol.com</a>) is a blockchain project focused on building the sharing economy without intermediaries. We're creating protocols to allow buyers and sellers of fractional usage assets and services (think Airbnb, Getaround, Fiverr, Taskrabbit) to transact without paying middlemen 20-30%. We're excited by the opportunity to build censorship resistant marketplaces and redistribute value to the contributors to the network instead of just the founders and VCs. We believe the open source protocols we're developing could ultimately replace dozens of existing multimillion or multibillion dollar businesses.<p>We're experienced founders who have built and sold multiple businesses in the past. Origin is the most ambitious idea we've tackled to date (hopefully on the right side of crazy). We currently have a working MVP built on Ethereum and IPFS. We're looking for all sorts of people to join our team, whether you code in react, python or solidity. We're a distributed team and open to remote.</p><p>Ping us at founders@originprotocol.com if you're interested.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 9:54:09 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "pCT1lLQJQC6iIfX-kPvFvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64589/management-consultant-software-project-delivery-munich-germany-at-mongoose-gray/",
    "title": "Management Consultant. Software Project Delivery | Munich, Germany",
    "content": "*HOW WILL A TYPICAL DAY BE SPENT?*<br /><br />* Engaging with developers, change professionals, business analysts and project managers.<br />* Executing proof of concepts before architecting and deploying appropriate technical solutions.<br />* Using your business acumen to ensure technical implementations are fit for purpose.<br />* Designing, implementing and testing component reusability models.<br />* Supporting clients, giving demos, training, mentoring, providing consultancy services.<br />* Showcasing solutions, outlining benefits, identifying potential future business opportunities.<br /><br />*WHAT'S THE WORKING CULTURE LIKE?*<br /><br />Passionate, driven, ambitious, collaborative. Personal career journeys are firmly aligned to the corporate roadmap. Big company ambitions with a small company feel. Consultants are fiercely loyal to the company and this is borne out by a very low attrition rate.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, flexible and able to travel extensively throughout Europe and across the globe. The role will bring lots of autonomy including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, adviser. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment and be looking to move (or have recently moved) into a more strategic, consultative, client-facing role such as business analysis or project management.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a company that has world-class ambitions. In many ways progression will be what you make it.<br /><br />*WHAT ARE THE NUMBERS?*<br /><br />Up to EUR 85,000 + excellent benefits + share options.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:38:09 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "UIHLDdjYQSa0ZglU4MdeRQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64589/project-manager-software-delivery-c-net-excellence-at-mongoose-gray/",
    "title": "Project Manager. Software Delivery (C# .NET) Excellence.",
    "content": "*HOW WILL A TYPICAL DAY BE SPENT?*<br /><br />* Engaging with developers, change professionals, business analysts and project managers.<br />* Executing proof of concepts before architecting and deploying appropriate technical solutions.<br />* Using your business acumen to ensure technical implementations are fit for purpose.<br />* Designing, implementing and testing component reusability models.<br />* Supporting clients, giving demos, training, mentoring, providing consultancy services.<br />* Showcasing solutions, outlining benefits, identifying potential future business opportunities.<br /><br />*WHAT'S THE WORKING CULTURE LIKE?*<br /><br />Passionate, driven, ambitious, collaborative. Personal career journeys are firmly aligned to the corporate roadmap. Big company ambitions with a small company feel. Consultants are fiercely loyal to the company and this is borne out by a very low attrition rate.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, flexible and able to travel extensively throughout Europe and across the globe. The role will bring lots of autonomy including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, adviser. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment and be looking to move (or have recently moved) into a more strategic, consultative, client-facing role such as business analysis or project management.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a company that has world-class ambitions. In many ways progression will be what you make it.<br /><br />*WHAT ARE THE NUMBERS?*<br /><br />Up to EUR 85,000 + excellent benefits + share options.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:38:09 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "AqrJW3riTvWyIi_7MBwdSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64589/project-manager-software-delivery-eur-85000-bonus-stock-options-munich-germany-at-mongoose-gray/",
    "title": "Project Manager. Software Delivery. EUR 85,000 + bonus + stock options | Munich (GERMANY)",
    "content": "*HOW WILL A TYPICAL DAY BE SPENT?*<br /><br />* Engaging with developers, change professionals, business analysts and project managers.<br />* Executing proof of concepts before architecting and deploying appropriate technical solutions.<br />* Using your business acumen to ensure technical implementations are fit for purpose.<br />* Designing, implementing and testing component reusability models.<br />* Supporting clients, giving demos, training, mentoring, providing consultancy services.<br />* Showcasing solutions, outlining benefits, identifying potential future business opportunities.<br /><br />*WHAT'S THE WORKING CULTURE LIKE?*<br /><br />Passionate, driven, ambitious, collaborative. Personal career journeys are firmly aligned to the corporate roadmap. Big company ambitions with a small company feel. Consultants are fiercely loyal to the company and this is borne out by a very low attrition rate.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, flexible and able to travel extensively throughout Europe and across the globe. The role will bring lots of autonomy including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, adviser. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment and be looking to move (or have recently moved) into a more strategic, consultative, client-facing role such as business analysis or project management.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a company that has world-class ambitions. In many ways progression will be what you make it.<br /><br />*WHAT ARE THE NUMBERS?*<br /><br />Up to EUR 85,000 + excellent benefits + share options.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:38:09 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "hQjcohWoQ66P-OBMCJODwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cartonomy/jobs/137724-social-media-intern",
    "title": "Social Media Intern",
    "content": "<div><h2>Social Media Intern at Cartonomy</h2><div>New York City, Remote · Internship</div><div></div></div><div><div>Skills</div><div>Graphic Design, Twitter, Content Strategy, Linkedin, Content Creation, Facebook</div><div>Compensation</div><div>$1K–$5K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Cartonomy is transforming the experience of shopping online with friends and family with our next generation shopping cart tools.</p><p>We are seeking a social media intern for Summer 2016 and possibly beyond to assist in the content creation for our company pages on Twitter, Facebook, and LinkedIn.</p><p>The internship is a part-time, paid position, open to students at any U.S. university.  The position is based in NYC but remote work arrangements are possible on a per case basis.</p><p>Please refer to our website, <a href='http://www.cartonomy.com' rel='nofollow'>www.cartonomy.com</a>, for more background on Cartonomy and to read our press coverage.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 21, 2017 9:54:44 PM",
    "tags": [
      "Content Creation",
      "Content Creator",
      "Content Strategy",
      "Facebook",
      "Graphic Design",
      "Internship",
      "Linkedin",
      "New York City",
      "REMOTE1/50",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Twitter"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "bGjPYIlyTWaFzCwAhvKJFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64543/creative-manager-director-paid-in-equity-at-clikd-limited/",
    "title": "Creative Manager/ Director (paid in Equity)",
    "content": "Creative Manager <br /><br />About us<br /><br />We are an award winning dating app, www.clikapp.com who cater for creatives.  We won an award at the UK DatinG Awards for Innovation, were listed as one of the best dating apps for men 2017 in the telegraph and have enjoyed some great traction.   We are now looking for a creative director / manager to help us keep on brand cool, creative and fun. We are a startup, so we want someone who is keen to join us on this journey.<br /><br />I should say that we are fundraising at the moment, and as such have limited funds, which is why we are keen to bring someone in who is keen to enter the world of startups and wants to grow with the company, payment will be in the form of equity within the company and we will cover expenses and travel to and from the office so you are not out of pocket. However this is for someone who is looking to the future or wants to gain some experience in startups. Please check out our website – www.clikdapp.com we have an incredibly strong team and are looking for someone who can join very quickly and muck in and get involved.<br /><br /><br />Ideal experience<br /><br /><br />You’ll be entrepreneurial by nature and have experience of being a creative leader, this could be in film/ photography/ graphic design or marketing.<br />Experience of working as a photographer and have links into the photographic community would be ideal.<br />You will understand how to interact with photographers and to judge good quality photography.<br />Be creative and clever and have a quick wit, we want someone who can bring some spark to our creative department.<br />Will be able to manage others well, and be willing to manage interns, assess work and give feedback.<br />The spirit and approach of an entrepreneur with very strong commercial acumen in order to deliver real value in a small business environment<br />Strong communication skills and the ability to build strong working relationships internally and with our marketing partners<br />Ideally but not essential direct experience of the UK dating or social networking environment.<br /><br /><br />The Role<br />Will be working alongside the founder and we want someone who will work 3-5 days a week, we will consider both fulltime and part time roles depending on the candidate and their skill set we may have flexibility for someone who has another role or is consulting.<br /><br /><br />Message from the founder.<br />We have a strong team and a great product, and we are looking for someone who wants to come on this exciting journey with us. We believe this company has what it takes to become a superstar so we want to surround ourselves with people who are willing to sacrifice to be part of it. We value hard work, entrepreneurial spirit and out the box thinking mentality. There will be a whole range of jobs for you to get involved in, some fun, some not so much but you want to work in startups so this is the game.. But if this sounds like you, drop us an email and lets grab a coffee and have a chat.",
    "urlFetchPending": false,
    "published": "Dec 21, 2017 1:32:59 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "DqaaRWtRTUKHmr_Of6d5Tw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64435/business-development-manager-at-themovecom/",
    "title": "Business Development Manager",
    "content": "TheMove.com is a pre launch prop tech startup that provides lead generation services for brokers and developers in the real estate industry. Our lead generation model is ready to disrupt a $500bn market for the better and after successful trials in three continents we are ready to build a team to launch in New York.<br /><br /><br />The Position<br /><br />We are looking for a seasoned consultative salesperson with next-level interpersonal awareness and the ability to work with the founding team in developing our business in New York City.<br /><br />As the Business Development Manager in our NYC office, you will be responsible for implementing the onboarding process for new brokers and property developers and undertaking an account management role for current clients. Whether you’re meeting with Sales Associates or Directors, you must be comfortable pitching our idea and acting as an evangelist for TheMove! <br /><br />A previous background in real-estate or the property industry is highly desirable, however not essential. <br />The role will likely involve travel across the country and occasional remote working. <br /><br /><br />Role responsibilities<br /><br />Business Development: Developing and building out our commercial proposition to both customers and real estate agents, owning the adoption and onboarding process.<br /><br />Customer Experience: Developing our customer proposition and owning the customer experience, from customer service to the sales funnel<br /><br />Operational Execution: Playing a lead role in the operational execution within your area, from corporate development (presentations, finances, legals) to our city-by-city rollout activation strategy to highly challenging operational tasks such as overseeing the management of our cutting 24/7 Virtual Assistant function. <br /><br />KPI Focused: To work alongside the Country Manager to design key performance indicators that can be implemented across the NYC market. <br /><br />Passion for working in an exciting tech-startup and willingness to go the extra mile.<br /><br />Startups are challenging, hardworking and unstructured environments – they are not for everyone!<br /><br /><br />In return you will receive:<br /><br />A chance to make a direct impact to the success of the business from day one, we have global ambitions and success will be rewarded by rapid progression<br /><br />A competitive salary DOE<br /><br />A great coworking office in Williamsburg<br /><br />Please email a CV and cover letter to recruitment@themove.com<br />Please include within the letter your earliest start date.",
    "urlFetchPending": false,
    "published": "Dec 18, 2017 10:09:08 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Km2bEtvETiWOoH5KJIbXTg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/planetary-emissions-management/jobs/14715-maine-forest-carbon-program-manager",
    "title": "Maine Forest Carbon Program Manager",
    "content": "<div><h2>Maine Forest Carbon Program Manager at Planetary Emissions Management</h2><div>Cambridge, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$80K–$90K<br>0.25%–0.25%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 6:14:23 AM",
    "tags": [
      "Cambridge",
      "Full Time",
      "Product Manager",
      "Program Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hutE-nTsQYik8FBdLHSGBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/ufaber/jobs/125198-head-civil-engineering-course-research-training-development-part-time-full-time-opportunity",
    "title": "Head Civil Engineering Course - Research, Training & Development - Part time & Full Time Opportunity",
    "content": "<div><h2>Head Civil Engineering Course - Research, Training &amp; Development - Part time &amp; Full Time Opportunity at uFaber</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹800K–₹1500K<br>0.5%–1.5%</div></div><h3>Job Description</h3><div><p>KRAs</p><p>In a growth stage start-up you would be often surprised to know how much and how fast you can work. This is how your initial days might look like </p><p>1. You are required to plan, design and develop high quality video based training programs for students spread pan India, specifically for GATE - Civil Engineering.  </p><p>2. You would be involved in conducting training on - innovative ways of teaching. </p><p>3. Developed curriculum and content for the training program </p><p>4. Conduct regular assessment of students progression.</p><p>5. Mentor trainees and helped them with regular feedbacks on their online teaching. </p><p>6. Design and execute interactive sessions. </p><p>Who we are looking at </p><p>1. Your are excellent in your grasp of adult training and take pride in the depth of your knowledge and understanding </p><p>2. You love act of educating others in your skill. You have an uncanny ability to simplify and decipher even the most complex of concepts, for a complete novice. </p><p>3. You have high standards of quality and you don- t settle with &quot;just good&quot;. </p><p>5. You have the fire and desire to do something new and challenging. </p><p>6. You get bored doing the same thing and like to explore newer domains. </p><p>7. You love what you do have and are brimming with an entrepreneurial spirit</p></div>",
    "urlFetchPending": false,
    "published": "Dec 10, 2017 8:37:19 PM",
    "tags": [
      "Business Development",
      "Full Time",
      "Mumbai",
      "Product Manager",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "_SxCKPqrR2qFWFauQSvCUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8444-program-consultant-program-placement-team",
    "title": "Program Consultant, Program Placement Team",
    "content": "Program Consultant, Program Placement Team - Jobmote<div><div><h2>Program Consultant, Program Placement Team</h2><h5>Remote Year</h5></div></div><div><div><div><div><div><p>Remote Year</p><p>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</p><p>Role Description</p><p>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</p><p>Responsibilities:</p><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><p>What You Bring:</p><ul><li>Minimum 1-3 years experience&nbsp;in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><p>Preferred Qualification:</p><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 1:00:34 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3UWpfz9fREeaEi2UxOTooA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/jobs/5921-program-consultant-program-placement-team",
    "title": "Remote Year: Program Consultant, Program Placement Team",
    "content": "<div>  <div>    <h2>Program Consultant, Program Placement Team</h2>      <h4>Posted Dec  8</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: Worldwide</span><br>        <a href='https://remote-year.breezy.hr' rel='nofollow'>https://remote-year.breezy.hr</a>    </h3>  </div>    </div>  <div>    <div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span>Role Description</span></div><div><br></div><div>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><div><br></div><div><span>What You Bring:</span></div><div><br></div><ul><li><span>Minimum 1-3 years experience&nbsp;</span>in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Preferred Qualification:</span></div><div><br></div><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team' rel='nofollow'>https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 12:08:39 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "IEP1oZ3-TqC9NT8vAzL7vA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63604",
    "title": "Program Consultant, Program Placement Team",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span>Role Description</span></div><div><br></div><div>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><div><br></div><div><span>What You Bring:</span></div><div><br></div><ul><li><span>Minimum 1-3 years experience&nbsp;</span>in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Preferred Qualification:</span></div><div><br></div><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul><p><strong>To apply:</strong> <a href='https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team' rel='nofollow'>https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 12:08:39 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hdpIXi4ZQj-2gQsAsG-GtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63599",
    "title": "Product Development Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We are seeking a veteran, process-oriented Product Manager to become a key member of our product leadership team. Working with existing product team, you will help act as the interface between a globally dispersed team of developers, QA professionals and members of a remote, sales-driven organization. <br><br>You will be responsible for balancing needs between infrastructure and product development requirements. You will work with stakeholders and product team members to collect, understand, and translate the business needs of our internal and external clients into technical language for your development team. You will share ownership over the product roadmap and be responsible for forecasting and maintaining on-time delivery of roadmap items. <br><br>You will work with a team that is charged with helping to increase the profitability of existing products and to develop new products for the company. You will build products from existing ideas, and help to develop new ideas based on your industry experience and your contact with customers, prospects, and internal clients. You must possess a unique blend of business and technical savvy; have big-picture vision, and the drive to make that vision a reality. You must enjoy spending time in the market to understand its problems and find innovative solutions. <br><br>You must be able to communicate efficiently and effectively up, down, and laterally within and without our organization. You will work with an engineering counterpart to define product release requirements and with the company marketing team to define the go-to-market strategy, and help them understand the product positioning, key benefits, and target customers. You will also serve as the internal and external evangelist for your product offering, often working with the sales team and key customers/partners.<br>Responsibilities:<br><br>Gain a deep understanding of customer experience to identify and fill product gaps<br>Generate new ideas that grow market share, improve customer experience, and drive growth<br>Work with all stakeholders to prioritize and define features and tasks, aligned with strategic initiatives and business drivers<br>Evaluate competitor and technology landscape and identify niche opportunities that leverage our product line’s strengths and other weaknesses<br>Assess market competition by comparing the company's product to competitors' products.<br>Provide information for management by preparing short-term and long-term product success forecasts, special reports and analyses, and answer questions and requests.<br>Drive a solution set across development teams (primarily Development/Engineering and Marketing) through market requirements, product contracts, and positioning.<br>Propel product launches forward by working with the public relations team, executives, and other members of the management team <br>Translate product strategy into detailed requirements<br>Identify and provide solutions for unique client requirements without completely diverging from the roadmap and product vision<br>Brainstorm with the management team and contribute to the creation and maintenance of a product-line strategy and roadmap<br>Work closely with engineering teams to deliver quick time-to-market solutions<br><br>Skills and Experience<br>6+ years of Product Management/Project Management experience<br>Experience in a technology driven product environment, preferably SaaS product, B2B or B2C<br>Experience building SaSS based business models within the product; onboarding, billing, plan management, etc.<br>Technology background in SQL and Ruby on Rails<br>Experience working with API’s and integrating with third party API’s<br>Able to quickly learn new technological environments and keep updated on industry trends<br>Experience working with remote teams – a plus<br>Proven track record of managing all aspects of a successful product throughout its lifecycle<br>Proven ability to align/develop product and marketing strategies and effectively communicate recommendations to executive management<br>Strong problem solving skills<br>Excellent written and verbal communication skills<br>Product management experience in a SaaS, cloud, or marketing software environment<br>Clear and precise communications skills, and ability to work with remotely distributed teams<br>Solid technical background with understanding and/or hands-on experience in software development and web technologies<br>BS/BA required in Computer Science or a related technical field, MBA a plus<br>Strong background in analyzing multiple data sets, demonstrating the ability to understand key performance drivers and ability to execute against findings<br>Strong technical architectural understanding of mobile and web products <br>Must have experience working with design and engineering teams to deliver end to end products<br>Strong understanding of UX best practices and ability to craft well thought out wireframes to communicate ideas effectively to development team as well as stakeholders.<br>A team-player attitude with willingness to get all hands on deck and roll up sleeves to achieve the best result<br><br><br><br><br><br></p></span></td><td></td><td></td><td><a href='mailto:cljobs%40regroup.com?subject=Application%20for%20Product%20Development%20Manager%20at%20Regroup&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Product%20Development%20Manager%20at%20Regroup' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 10:49:21 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "eLCyNK0JS1-FEOo7H2xHdg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122197-general-manager-seattle",
    "title": "General Manager - Seattle",
    "content": "<div><h2>General Manager - Seattle at Forkable</h2><div>Seattle, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Seattle",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "T1aneWsWTwWo16CyNIXMGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122194-general-manager-los-angeles",
    "title": "General Manager - Los Angeles",
    "content": "<div><h2>General Manager - Los Angeles at Forkable</h2><div>Los Angeles, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Finance/Accounting",
      "Full Time",
      "Los Angeles",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "nuf75n5pROOCCv9pPT7JKw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122196-general-manager-chicago",
    "title": "General Manager - Chicago",
    "content": "<div><h2>General Manager - Chicago at Forkable</h2><div>Chicago, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Chicago",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "2Cu_IHBAR7W5I_O3hIFxIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122195-general-manager-boston",
    "title": "General Manager - Boston",
    "content": "<div><h2>General Manager - Boston at Forkable</h2><div>Boston, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Boston",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Z71GxSjfSOSSvNjDcX6XGw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122193-general-manager-new-york-city",
    "title": "General Manager - New York City",
    "content": "<div><h2>General Manager - New York City at Forkable</h2><div>New York City, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Full Time",
      "New York City",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "User Researcher"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "pASIBiOAT8a_lrpe9qLKtQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122198-general-manager-denver",
    "title": "General Manager - Denver",
    "content": "<div><h2>General Manager - Denver at Forkable</h2><div>Denver, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Denver",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "1_pPOMX_THqddLMMf6vI_A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122199-general-manager-washington-d-c",
    "title": "General Manager - Washington D.C.",
    "content": "<div><h2>General Manager - Washington D.C. at Forkable</h2><div>Washington DC, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Washington DC"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Bzphrf9ORaKeOBlYz-w3Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/lobster/jobs/55654-head-of-sales-agency-growth",
    "title": "Head of Sales & Agency Growth",
    "content": "<div><h2>Head of Sales &amp; Agency Growth at Lobster</h2><div>London, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Digital Media, Social Media, Networking, Sales, Ad Agency, Sales Strategy and Management, Social Media Marketing, Advertising, Twitter, Sales and Marketing, Communication Skills, Revenue Growth, Blogger Relations, Knowledge Management, Subscription Models, Agency Management, Growth Hacking, Love for Creativity, Account Management, Fluent in English</div><div>Compensation</div><div>£24K–£40K<br>1.0%–3.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>This is a business development role working with the digital media agency &amp; publishers industry. Meaning you need to talk great and write great, and most importantly, make agencies, media and publishers subscribe for Lobster.</p><p>Lobster is looking for a person experienced in working with (or better off within!) digital media, advertising agencies and creatives of all sorts. This is a very important role for us great dedication and a share option in the company, it is almost a co-founder role.</p><p>We have developed an outstanding tool for the agencies and publishers to find exactly right social media visual content and license it for work from the authors. Now we are turning it into the whole world’s honest place to access real people’s content and it’s your turn to come on stage and reach all the agencies that need it.</p><p>Launched on TechCrunch Disrupt Battlefield Europe 2014, Graduate of Wayra UK accelerator 2014, raised £1m in 2017, reached 6 million photos and videos immediately available with the help of AI, first great agency subscribers and brands – waiting for you to grow the global customer side!</p><p>We can only consider people in London and settled in the UK to join the team at this time, even though you may be in office only occasionally.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:02:48 PM",
    "tags": [
      "Ad Agency",
      "Advertising",
      "Business Development",
      "Digital Media",
      "Full Time",
      "Growth Hacker",
      "London",
      "Networking",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Social Media",
      "Social Media Marketing",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown",
      "Twitter"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "QOch3ieeQcWH3BTrN6ftyQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/novanet/jobs/102569-business-development-manager",
    "title": "Business Development Manager",
    "content": "<div><h2>Business Development Manager at Novanet</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Lead Generation, Consultative Selling, Technology Selling</div><div>Compensation</div><div>₹300K–₹500K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Novanet is seeking full-time business development professionals for its domestic and international sales organisation in five cities i.e. Mumbai, Bangalore, Hyderabad, Delhi and Chennai.</p><p>Sales at Novanet is about consistently meeting customer requirements. We firmly believe in enriching customer experience by ensuring the quick deployment and easy-adoption of our products. The team is responsible for establishing and nurturing customer relationships.</p><p>PREFERRED WORK EXPERIENCE</p><p>0-2 Years</p><p>KEY RESPONSIBILITIES</p><p>- You will be responsible for finding out key contacts from your region, networking and initiating dialogues with seasoned IT professionals. </p><p>- As a sales professional, you will be expected to conduct meetings with such decision makers and generate interest by providing value propositions for our amazing product lineup. </p><p>-Your role as an account executive will extend to customer success management as well. You will be involved in various cross-sell/up-sell opportunities and ensure timely collection of revenue.</p><p>-You will get to work closely with the Marketing Team to define lead generation campaigns, customer profiling and market surveys.</p><p>WHY NOVANET SALES?</p><p>- Novanet has an amazing incentive structure that makes sure that you collect your incentives as long the customer generates revenue for Novanet.</p><p>- We place no restriction targeting potential customers across the globe.</p><p>- We offer an above-average industry standard compensation and domestic/international travel opportunities.</p><p>WHAT DO YOU NEED?</p><p>- Although, a passion for sales overcomes every educational qualification, but for academic purposes we will be accepting graduates with 0-2 yrs experience.</p><p>- Candidates with technical background or interest in latest technologies shall also be preferred</p><p>- Excellent communication and inter-personal Skills.</p><p>- Having personal conveyance is encouraged for intra-city travelling.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:17:54 PM",
    "tags": [
      "BD Manager",
      "Business Development",
      "Consultative Selling",
      "Full Time",
      "Lead Generation",
      "Mumbai",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Technology Selling"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "W1_Ryau3TFqa96zcaKLDiw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/easy-skillz/jobs/134435-german-language-intern",
    "title": "German language intern",
    "content": "<div><h2>German language intern at Easy Skillz</h2><div>Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>German, German Native Speaker, Fluent in German, German Language</div><div>Compensation</div><div>₹60K–₹120K<br>No Equity</div></div><h3>Job Description</h3><div><p>You will learn to interact with CXOs of German Companies<br>Researching on German University programs &amp; German Companies<br>Establishing alliances with German Companies through calls and &amp; emails<br>Maintaining MIS reports</p><p>Attractive incentives</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 10:00:38 PM",
    "tags": [
      "Business Development",
      "Delhi",
      "Fluent in German",
      "Full Time",
      "German",
      "German Language",
      "German Native Speaker",
      "Marketing",
      "Marketing Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "UH8S6PeoQsqozNDqdiv7BA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/ship2myid/jobs/14170-vp-ecommerce-channel",
    "title": "VP Ecommerce - Channel",
    "content": "<div><h2>VP Ecommerce - Channel at Ship2MyID</h2><div>Santa Clara, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Sales and Marketing, E-Commerce, Channel Development</div><div>Compensation</div><div>$120K–$200K<br>0.1%–0.3%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Responsible for partnering-&nbsp;</p><p>Ecommerce Platforms<br>Shipping Platforms</p><p>Prior background in selling eCommerce Solutions is mandatory.&nbsp;</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 8:31:07 PM",
    "tags": [
      "Business Development",
      "Channel Development",
      "E-Commerce",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "Santa Clara",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
