{
 "items": [
  {
    "id": "wF0Y1eJDQpeAfGXQdeNvNQ",
    "url": "http://workinstartups.com/job-board/job/79733/operations-admin-personal-assistant-at-reverse/",
    "title": "Operations / Admin / Personal Assistant",
    "tags": [
      "DBG:surround``work 2W home 2W orescap W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Reverse",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2019 3:52:37 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "crawled": "Jun 6, 2019 4:06:20 PM",
    "content": "Fancy working for an extremely fast growing startup, with 12 members of staff but the revenue of a 100 person company? Want to assist in helping complete a wide range of tasks to allow the company to run smoothly? We are looking for a bright, smart individual to work our portfolio of sites and help with general operation and admin processes. You’ll be assisting in the processes between teams to make sure nothing missed. Working on admin tasks such as creating invoices, editing basic excel sheets, booking travel, managing logins, opening advertising accounts, organising company socials and a whole range of ad hoc tasks that young companies need someone to own. There will also be personal assistant related tasks for the CEO.<br /><br />This is a part time role, hours can fluctuate from 5 - 15 hours per month, you will be expected to work from home or remotely for most these hours, but contactable 9 - 6. You will have a desk in our office in Old Street, London and may need to come in occasionally to work and play ping pong.<br /><br />Candidate requirements<br />You have a high attention to detail<br />You have an analytical approach<br />You have at least 1 years experience, ideally in digital<br />You are an extremely fast learner<br />You are a self starter and can work without supervision.<br />At least a 2.1 degree from a top university<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
