{
 "items": [
  {
    "id": "1vAaqfJwTEK2zATRdIG4ag",
    "url": "https://remote.co/job/solution-support-specialist/",
    "title": "Solution Support Specialist",
    "tags": [
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Philips",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 2, 2018 6:59:40 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Solution Support Specialist at <span>Philips</span></h2><div><span><i></i> Remote</span>        </div><div>            <ul><li><strong>United States of America – Home-Based</strong></li><li><strong>Full-time</strong></li><li>287372</li></ul><p><strong>Job Title: Solution Support Specialist</strong><br><strong>Job Description</strong><br><strong>In this role, you have the opportunity to</strong><br>Join the Solutions Team and will be responsible for providing business and technical expertise of the Philips Wellcentive platforms. You will support existing customers, sales needs and internal participants, both within the PHM space and the larger Philips organization. As well, you will review potential product needs and helps build business cases to drive market needs from prospects, customer and other industry sources.</p><p><strong>You are responsible for</strong></p><ul><li>Developing product expertise to explain both functional and business value of the solution.</li><li>Reviewing requirements from a variety of financial/quality programs/measure stewards and determining necessary use of the application, to support such programs through development of product story, strategy, workflow use or other explanatory material.</li><li>Providing input to technology groups related to key trends seen in marketplace.</li><li>Becoming a company expert in an area within PHM to specialize in knowledge (area of workflow, client type or ROI area).</li><li>Interfacing with prospects, clients, industry leaders and other stakeholders on key product attributes or other industry-leading programs.</li><li><strong>Travel up to 25% is an essential function of this role.</strong></li></ul><p><strong>You are a part of</strong></p><p>Philips Wellcentive, who has been a leader in population health management for over 10 years by providing solutions for customers to drive quality improvement, revenue growth and business transformation for organizations, focused on population health management and value-based care initiatives. As part of our Solutions Team under our Sales and Business Development group, we drive ways to present the best opportunities to prospects and customers as they grow their business. We are market facing, listening for ideas, developing strategies based on demand and working with our sales and product colleagues around the world to further increase our client base. It is a collaborative team environment to help find solutions to industry problems to improve patient outcomes with the right care.</p><p><strong>To succeed in this role, you should have the following skills and experience</strong></p><ul><li><strong>Bachelor’s degree required or equivalent related experience</strong></li><li>3+ years of clinical and business workflow experience with large healthcare systems</li><li>3+ years of experience working with care management, clinical transformation or EMR systems</li><li>2+ years working with patients and providers with chronic populations</li><li>Knowledge of population health management and non-fee for service reimbursement programs</li><li>Strong communication, both written and verbal and the ability to be a strong team player</li><li>Experience working with one or more of the following entities (ACO, IDN, IPA, large provider system, large hospital system and self-insured employers) (preferred, not required)</li></ul><p><strong>In return, we offer you</strong></p><p>The opportunity to have your voice heard and to pursue new ideas with the team! This team has the flexibility to look into different areas of chronic patient care and are fully transparent with decisions that are made. If you are a strong team player and love constantly learning, then this is the team for you!</p><p><strong>Why should you join Philips?</strong></p><p>Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.</p><p>To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.</p><p><strong>Philips is an equal opportunity employer.&nbsp;</strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.</p><p><strong>As an equal opportunity employer, Philips is committed to a diverse workforce.</strong>&nbsp;In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans’ Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.</p>        </div><div>        <a href='https://philips.wd3.myworkdayjobs.com/en-US/jobs-and-careers/job/United-States-of-America---Home-Based/Solution-Support-Specialist_287372' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "r6wqGkC-QmmbHItNTu--ew",
    "url": "https://remoteok.io/jobs/68691",
    "title": "Sales Engineer Solutions Architect",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Interfolio",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 6:21:08 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Sales Engineer Solutions Architect</h2></span><br><span><h3>Interfolio</h3></span></td><div><div>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and owning the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.<br>Interfolio operates the first holistic faculty information system to support the full lifecycle of faculty work, from job seeking to review, tenure, sabbatical, committee work, research, and beyond. Offering colleges and universities increased clarity and insight into faculty data to help achieve their strategic initiatives, Interfolio believes that advancing the faculty will advance the institution.<br><br>What’s even better than that? <br><br>We’ve crafted a fun, collegial, dynamic culture that celebrates team and individual success almost daily. We’ve got a lean team of super-smart, super-hard working, local and remote colleagues who collaborate closely to produce a valuable service for an industry we’re passionate about. And, we genuinely like working with each other and with our clients.<br><br>Like what you’ve heard so far?<br><br>Then consider joining our Sales team. The position of Sales Engineer (Solutions Consultant) is open to remote employees as well as locals in commuting distance to our Washington, D.C. office.<br><br>Interfolio is committed to diversity and the principle of equal employment opportunity for all employees. You will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), national, social or ethnic origin, age, gender identity and/or expression, sexual orientation, family or parental status, or any status protected by the laws or regulations in locations where we operate.<br><br>About the Role<br><br>A thought leader and strategic partner to the Sales Team, you will own all technical and product-related activities required throughout the sales life cycle. Keenly attuned to the buyer’s journey, you are a trusted advisor to the buyer (Provosts, Vice Provosts, CIOs, etc.) and play a primary role in creating larger buy-in across all stakeholders (including functional end users) by architecting buyer vision and mapping it to our product suite. You will engage audiences through tailored, compelling product demonstrations and fully address any functional and technical questions that may arise with professionalism and tact. You will be the product matter and technical expert within Sales and will work closely with other departments to relay product feedback from out in the field, create and maintain the sales demo environment, and help contribute to the development of our product roadmap. This role lives within the Sales department at Interfolio, under the Sales Operations division. &nbsp;&nbsp;<br><br><br><br>About You<br><br><br><br><br><br><br>* Platform Evangelist and Expert Product Demonstrator:&nbsp;You have a passion for presenting user-friendly, elegantly designed solutions to decision-makers and large audiences and drawing from user stories.<br><br>* Technical Solutions Consultant:&nbsp;You will work closely with the Account Executive team to execute on open opportunities. You are responsible for the technical relationship, discovering and qualifying opportunities from a technical standpoint, addressing the technical questions, and helping drive solutions that leverage the Interfolio product suite.<br><br>* Buyer Advocate:&nbsp;A client-centric approach is core to your approach. Creating and cultivating relationships with a diverse group of individuals comes naturally to you.<br><br>* Passionate about Higher Education:&nbsp;Your passion for higher education drives you and the work you do. You’re excited to get out of bed in the morning and willing to take on “tiger team” responsibilities that go beyond the job description. &nbsp;&nbsp;<br><br><br><br><br><br><br><br><br><br><br>Specific Responsibilities<br><br><br><br><br><br><br>* Deliver tailored, technical product demonstrations both onsite and virtually that showcase the breadth and depth of Interfolio’s products, while expertly navigating through functional and technical questions from decision makers and end users<br><br>* Partner with regional AE team members to close customer opportunities<br><br>* Assist in scoping conversations and create custom SOWs and detailed implementation plans for prospective clients (in collaboration with Professional Services). Be well-versed in client best practices specifically related back to implementation<br><br>* Lead technical conversations with the IT team at prospective client institutions<br><br>* Identify and develop product and technical sales assets needed throughout the buyer’s journey<br><br>* Ability to assist in proposal writing and IT questionnaire responses for new business opportunities<br><br>* Help manage the RFP content management knowledge base<br><br>* Build out our sales demo environment (“Sandbox”) for all product modules. Map out the FIS storyline and create new demo scripts<br><br>* Partner with internal departments, in particular our Product and Product Strategy teams, to relay product feedback, &nbsp;contribute to product development, and decide how to communicate new releases to prospective buyers and current clients<br><br>* Master our diverse product portfolio while being well-versed on the competitive landscape<br><br>* Relay new product updates and enhancements with sales team<br><br>* Assist with product training of new sales personnel<br><br>* Evangelize Interfolio’s approach to providing the first-of-its-kind faculty-centric platform for universities and colleges in all engagements<br><br>* Report to Associate Director, Sales Operations<br><br><br><br><br><br><br><br><br><br><br>Basic Qualifications<br><br><br><br><br><br><br>* Bachelor’s degree in a technical field or equivalent experience--some of our best employees have degrees in non-related fields and are rock stars<br><br>* 3+ years of work experience in technology consulting, product management, implementation consulting, software development, and/or demonstrating enterprise SaaS solutions in a sales capacity<br><br>* Thorough understanding of SaaS solutions. Technical mindset with an aptitude for problem solving and delivering customer-driven solutions<br><br>* Experience with Salesforce<br><br>* Be able to speak and write fluently in English (as a minimum requirement)<br><br>* Excellent verbal and communication skills<br><br>* Willing and able to travel up to 60% of the time<br><br><br><br><br><br><br><br><br><br><br>Ideal Qualifications<br><br><br><br><br><br><br>* Experience working for, or delivering services to, universities and colleges are a significant plus<br><br>* Prior experience as a sales engineer or solutions consultant<br><br>* Technical acumen, i.e. can speak elegantly on SaaS platforms, APIs, data security, etc<br><br>* Thrives in an exciting, fast-paced, action-packed work environment - we’re an early stage, high growth company!<br><br><br><br><br><br><br><br><br><br>Applicants for this position must currently reside in the continental United States. In addition to a competitive salary, Interfolio offers a robust benefits package that includes medical insurance, unlimited PTO, a wellness benefit, 401k, and professional development opportunities. Our culture sets us apart—we look forward sharing more about our company and our team!<p>See more jobs at <span>Interfolio</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "40MaB0mKSEy1egxyfdR92A",
    "url": "http://jobmote.com/jobs/23940-cloud-security-architect-remote-position",
    "title": "Cloud Security Architect-Remote Position",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "IT People Corporation",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 6:20:41 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>Please rush resumes with hourly pay rate or Salary to or call Kavita on</strong></p><p><strong>This position is 100% remote</strong></p><p><strong>Cloud Security Architect (CSA)</strong></p><p><strong>Primary responsibilities</strong> : This role will require in depth knowledge of cloud security architecture, secure design practices, cloud infrastructure security, security software development. CSA will need to teach others the same skills. He/she will own responsibility to the organization for identifying and driving issues to closure with development teams, working in conjunction with the company's Product Security Office to ensure consistency and compliance with corporate and industry standards. This person will be required to be able to actively provide design guidance and to manage cloud security tools and solutions to protect the AWS cloud environments, including engineering solutions and processes.</p><p>Job responsibilities will include ownership and execution of activities which include:</p><ul><li>Analyzing and assisting in the design of cloud security solutions for Our Company cloud-based services</li><li>Working with cloud services architects, developers, and testers to review, assist and recommend changes and solutions to functionality to address the security of Our Company and third party developed services</li><li>Developing and contributing to implementation of the Our Company Secure Development Lifecycle and security best practices within the software development process</li><li>Identifying security risks in Our Company and third party provided services and proposing mitigating controls Assessing the latest security threats and making recommendations to increase security</li><li>Conducting continuous analysis of services security threat information - 3 rd party providers' vulnerabilities, CVEs, malicious code, potential backdoors, industry events, hackers, zero day exploits, OEM weaknesses, IDS/IPS and SIEM alerting, etc., in order to proactively assess and investigate emerging threats and potential impact to Our Company services</li><li>Assessing the applicability of threat and vulnerability feeds, rating the risk and communicating to appropriate parties</li><li>Recommending corrective actions to mitigate security threats and risks to selected services and products</li><li>Communicating identified changes in threats and vulnerabilities based on trend analysis and concerns generated from customers and potential customers</li><li>Producing reports to demonstrate assessment coverage and remediation effectiveness, and working with the Product engineers and software teams to insure corrective actions are implemented</li><li>Identification of internal and external threats that could divulge vulnerabilities that would lead to the misappropriation of customer or company information</li><li>Identifying and developing new tools, tactics and procedures for changing threat scenarios</li><li>Developing trend and research analysis techniques to identify new detection methods for attack vectors</li><li>Working directly with technical staff, vendors, and leadership to promptly assess and implement mitigating controls to new attack vectors and changing threat landscape</li><li>Having the ability to effectively identify, evaluate and communicate new and ongoing security threats to senior management</li></ul><p><strong>Required Education and Experience</strong></p><ul><li><p>Bachelors Degree in Computer Science, related area or equivalent related work experience</p></li><li><p>6+ years of demonstrated information security, risk management &amp; compliance experience with the experience in secure cloud services and infrastructure design, and vulnerability management with a minimum 2+ years Cloud Security Architect experience with infrastructures such as AWS or comparable products.</p></li><li><p>Knowledge and experience with diverse IT products, architectures and enterprise IT data centers, large scale transaction processing environments, external hosted services and cloud computing environments</p></li><li><p>Thorough understanding of IAM solutions, SSO, Federation &amp; STS to deliver secure cloud service interaction and environment access</p></li><li><p>Knowledge of configuration management, change control, risk assessments, exception management and security baselines (e.g. CIS Baselines, NIST, FIPS Security standards, Government Security guidelines, vendor security technical implementation guides)</p></li><li><p>Strong technical skills and hands on experience assessing threats to multiple operating system platforms, database and application servers, custom and off the shelf applications</p></li><li><p>Knowledge of and experience with applying Common Weakness Enumeration (CWE), Common Vulnerability Scoring System (CVSS), Common Vulnerabilities and Exposures (CVE), and Open Web Application Security Project (OWASP) processes and remediation recommendations</p></li><li><p>Experience in conducting security architecture assessments on 3rd party provided services, web-based services and REST type of applications</p></li><li><p>Experience performing static analysis and security code reviews</p></li><li><p>In depth knowledge of the security related technologies, including but not limited transport and at rest encryption and related cryptography, authentication services</p></li><li><p>CISSP certification requirement - CCSP preferred</p></li><li><p>Excellent writing and verbal communication skills, interpersonal and presentation skills and the proven ability to influence and communicate effectively</p><ul><li>provided by Dice See the JD </li></ul></li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UCewNvVpT-qSFf9Yk47LNw",
    "url": "https://stackoverflow.com/jobs/200997/sales-engineer-solutions-architect-interfolio-inc?a=15piXWrRoceY",
    "title": "Sales Engineer / Solutions Architect at Interfolio, Inc (Washington, DC) ",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Interfolio, Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 1:06:08 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Sales Engineer / Solutions Architect</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Computer Software, Education, SaaS</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Interfolio, Inc | Washington, DC<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Washington, DC.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                            <div>                                    <span>Visa Sponsorship:</span>                                    <span>Yes</span>                                </div>                                                    </div>                    </div>                <h3>Technologies</h3><div></div><div>saas</div><div>clojure</div><div>web-services</div>                <h3>Job description</h3>                <div>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and owning the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.Interfolio operates the first holistic faculty information system to support the full lifecycle of faculty work, from job seeking to review, tenure, sabbatical, committee work, research, and beyond. Offering colleges and universities increased clarity and insight into faculty data to help achieve their strategic initiatives, Interfolio believes that advancing the faculty will advance the institution.<strong>What’s even better than that? </strong>We’ve crafted a fun, collegial, dynamic culture that celebrates team and individual success almost daily. We’ve got a lean team of super-smart, super-hard working, local and remote colleagues who collaborate closely to produce a valuable service for an industry we’re passionate about. And, we genuinely like working with each other and with our clients.<strong>Like what you’ve heard so far?</strong>Then consider joining our Sales team. The position of Sales Engineer (Solutions Consultant) is open to remote employees as well as locals in commuting distance to our Washington, D.C. office.Interfolio is committed to diversity and the principle of equal employment opportunity for all employees. You will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), national, social or ethnic origin, age, gender identity and/or expression, sexual orientation, family or parental status, or any status protected by the laws or regulations in locations where we operate.<strong>About the Role</strong>A thought leader and strategic partner to the Sales Team, you will own all technical and product-related activities required throughout the sales life cycle. Keenly attuned to the buyer’s journey, you are a trusted advisor to the buyer (Provosts, Vice Provosts, CIOs, etc.) and play a primary role in creating larger buy-in across all stakeholders (including functional end users) by architecting buyer vision and mapping it to our product suite. You will engage audiences through tailored, compelling product demonstrations and fully address any functional and technical questions that may arise with professionalism and tact. You will be the product matter and technical expert within Sales and will work closely with other departments to relay product feedback from out in the field, create and maintain the sales demo environment, and help contribute to the development of our product roadmap. This role lives within the Sales department at Interfolio, under the Sales Operations division. &nbsp;&nbsp;<p><strong>About You</strong></p><ul><ul><ul><li><strong>Platform Evangelist and Expert Product Demonstrator:</strong>&nbsp;You have a passion for presenting user-friendly, elegantly designed solutions to decision-makers and large audiences and drawing from user stories.</li><li><strong>Technical Solutions Consultant:</strong>&nbsp;You will work closely with the Account Executive team to execute on open opportunities. You are responsible for the technical relationship, discovering and qualifying opportunities from a technical standpoint, addressing the technical questions, and helping drive solutions that leverage the Interfolio product suite.</li><li><strong>Buyer Advocate:&nbsp;</strong>A client-centric approach is core to your approach. Creating and cultivating relationships with a diverse group of individuals comes naturally to you.</li><li><strong>Passionate about Higher Education:</strong>&nbsp;Your passion for higher education drives you and the work you do. You’re excited to get out of bed in the morning and willing to take on “tiger team” responsibilities that go beyond the job description. &nbsp;&nbsp;</li></ul></ul></ul><p><strong>Specific Responsibilities</strong></p><ul><ul><ul><li>Deliver tailored, technical product demonstrations both onsite and virtually that showcase the breadth and depth of Interfolio’s products, while expertly navigating through functional and technical questions from decision makers and end users</li><li>Partner with regional AE team members to close customer opportunities</li><li>Assist in scoping conversations and create custom SOWs and detailed implementation plans for prospective clients (in collaboration with Professional Services). Be well-versed in client best practices specifically related back to implementation</li><li>Lead technical conversations with the IT team at prospective client institutions</li><li>Identify and develop product and technical sales assets needed throughout the buyer’s journey</li><li>Ability to assist in proposal writing and IT questionnaire responses for new business opportunities</li><li>Help manage the RFP content management knowledge base</li><li>Build out our sales demo environment (“Sandbox”) for all product modules. Map out the FIS storyline and create new demo scripts</li><li>Partner with internal departments, in particular our Product and Product Strategy teams, to relay product feedback, &nbsp;contribute to product development, and decide how to communicate new releases to prospective buyers and current clients</li><li>Master our diverse product portfolio while being well-versed on the competitive landscape</li><li>Relay new product updates and enhancements with sales team</li><li>Assist with product training of new sales personnel</li><li>Evangelize Interfolio’s approach to providing the first-of-its-kind faculty-centric platform for universities and colleges in all engagements</li><li>Report to Associate Director, Sales Operations</li></ul></ul></ul><p><strong>Basic Qualifications</strong></p><ul><ul><ul><li>Bachelor’s degree in a technical field or equivalent experience--some of our best employees have degrees in non-related fields and are rock stars</li><li>3+ years of work experience in technology consulting, product management, implementation consulting, software development, and/or demonstrating enterprise SaaS solutions in a sales capacity</li><li>Thorough understanding of SaaS solutions. Technical mindset with an aptitude for problem solving and delivering customer-driven solutions</li><li>Experience with Salesforce</li><li>Be able to speak and write fluently in English (as a minimum requirement)</li><li>Excellent verbal and communication skills</li><li>Willing and able to travel up to 60% of the time</li></ul></ul></ul><p><strong>Ideal Qualifications</strong></p><ul><ul><ul><li>Experience working for, or delivering services to, universities and colleges are a significant plus</li><li>Prior experience as a sales engineer or solutions consultant</li><li>Technical acumen, i.e. can speak elegantly on SaaS platforms, APIs, data security, etc</li><li>Thrives in an exciting, fast-paced, action-packed work environment - we’re an early stage, high growth company!</li></ul></ul></ul>Applicants for this position must currently reside in the continental United States. In addition to a competitive salary, Interfolio offers a robust benefits package that includes medical insurance, unlimited PTO, a wellness benefit, 401k, and professional development opportunities. Our culture sets us apart—we look forward sharing more about our company and our team!                </div>            <div>        <a href='https://jobs.lever.co/interfolio/4b7d18d8-8b1b-45ec-8974-a570283cd903?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>                        Apply now        </a></div>            <h3>About Interfolio, Inc</h3>            <div><p>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and leading the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Medical, Dental &amp; Vision Insurance</span>                            </li>                            <li>                                <span></span>                                <span>401K Plan</span>                            </li>                            <li>                                <span></span>                                <span>Professional Development Program</span>                            </li>                            <li>                                <span></span>                                <span>Life &amp; Disability Coverage</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited PTO</span>                            </li>                            <li>                                <span></span>                                <span>Wellness benefit stipend</span>                            </li>                            <li>                                <span></span>                                <span>Snacks in the office</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "m1SN0aSKTPWgDpPKC6a-Fg",
    "url": "https://weworkremotely.com/remote-jobs/barrel-roll-part-time-wordpress-solutions-engineer",
    "title": "Barrel Roll: Part-Time WordPress Solutions Engineer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``work 2W from 2W home 3W OR(whenev,wherev,agil)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:phpmyadmin/php/8",
      "DBG_TECH1:k/t/w:responsive-design/frontend/13",
      "DBG_TECH1:k/t/w:woocommerce/php/8",
      "DBG_TECH1:k/t/w:wordpress/php/30",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=51, embedded=0, frontend=17}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Barrel Roll",
      "sameAs": "https://gobarrelroll.com/jobs/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2018 10:54:58 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Part-Time WordPress Solutions Engineer</h2><span>Company: Barrel Roll<br></span><span>Headquarters: Norfolk, VA<br></span><span>https://gobarrelroll.com/jobs/<br><br></span>  <div>    <div>We’re looking for a new team member to help support our growing membership! You’ll be tasked with solving problems and coming up with creative solutions for our members on a daily basis. It’s challenging, fun, and rarely boring.<br></div><div></div><div><span>This is a part-time position</span>&nbsp;with the possibility of full-time after a trial period. 20-30 hours per week to start. This is a remote position; work from home or wherever you’d like!</div><div><br></div><div>You’ll be working directly with members and as part of our team. You should enjoy problem-solving&nbsp;and not give up if Google doesn’t immediately present a quick answer. We’re looking for people who are fluent in English, both verbally and in writing, who can expertly communicate solutions to members.<br></div><div></div><div><br></div><div>Most of all, you need to love working on WordPress websites and have a positive, energetic personality. The interactions our members have with our team is a big part of why they stay with us, and you’ll be a key part of that experience!</div><div><br></div><div><h4><span>WHAT YOU’LL BE DOING</span></h4></div><div>You’ll handle incoming support requests as they arrive and provide solutions as needed. This usually entails things like debugging plugins or themes, adding new content or functionality, optimizing performance, or simply giving technical support or advice to members.<br></div><div></div><div><br></div><div>When not handling support requests you’ll be maintaining member sites, applying updates, and testing to ensure proper functionality. This is a never-ending process but one that is critical for our members and so we take it very seriously.<br></div><div></div><div>We’ll also ask you to help with things at Barrel Roll, including adding new functionality and documentation and generally contributing your fantastic ideas.&nbsp;<em><em>Your input will matter.</em></em></div><div><em><em><br></em></em></div><div><h4><span>THE POSITION REQUIRES:</span></h4></div><ul><li>3 years of experience administrating WordPress on a regular basis.</li><li>Proficient programming capabilities in CSS/HTML/PHP/JS.</li><li>Experience with responsive design.</li><li>Familiar with relational databases, comfortable in PHPMyAdmin, and can understand and execute SQL queries.</li><li>The ability to work as part of a team.</li><li>People skills.</li><li>Drive.</li><li>Proficient in Google Analytics, Google Tag Manager, and Google Search Console.</li></ul><div><span><br></span></div><div><h4><span>WE’D ALSO LIKE SOMEONE WHO:</span></h4></div><ul><li>Has not only administered&nbsp;WordPress for a period of three years or longer but has provided support for customers during that time as well.</li><li>Is active within the WordPress community, either by providing support at WordPress.org, contributing plugins or themes, or has in some other way engaged. If so, please submit links to your repos or examples of how you’ve been involved.</li><li>An understanding of Search Engine Optimization (SEO). Experience in SEO with great results, even better!</li><li>Experience working with Linux/Apache servers.</li><li>WooCommerce experience.</li><li>Familiarity with platforms like Helpscout, Basecamp, Slack, Git, live chat, etc.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply online at <a href='https://gobarrelroll.com/jobs/' rel='nofollow'>https://gobarrelroll.com/jobs/</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Snb4onFiSu6rgXyWapqU9g",
    "url": "http://jobmote.com/jobs/23774-ping-access-iam-solution-architect-remote-identity-and-access-manag",
    "title": "Ping Access IAM Solution Architect - Remote, Identity and Access Manag",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 120000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2018 9:20:58 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Identity and Access Management/IAM Solution Architect candidates will have experience with Ping Access. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US.</p><p>Location - Virtual-Remote-Telecommute - 35% national travel<br>Starting salary $100,000 to $120,000+ per year, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><p>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies.</p><p>In this Identity and Access Management Solution Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions.</p><p>Duties and Responsibilities<br>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analysing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM<br>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </p><p>Technical Experience and Qualifications<br>-Experience with Ping Access<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Experience with some combination of IAM products: Radiant Logic, Sailpoint, Centrify, ForgeRock, Ping Access, Ping Identity/Ping ID/PingID, PingFederate, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (ie VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "SMq0-At3RcmOf5fD_aLwlQ",
    "url": "http://jobmote.com/jobs/23752-servicenow-solution-architect-remote-opportunity",
    "title": "ServiceNow Solution Architect - REMOTE opportunity",
    "tags": [
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:flash/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Magellan Health",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2018 5:21:34 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><ul><li><p>This position is available as a remote opportunity for the right candidate. </p></li><li><p>Understanding of ServiceNow Architecture as well as best practices from experience and Awareness of upgrade-safe approaches </p></li><li><p>Implementations of ITSM ( Incident, Problem, Change, CMDB, Service Catalog) ,at least one of each </p></li><li><p>Experience in Scripting, Service Portal, Performance Analytics, Integrations </p></li><li><p>Application Suites : ITSM (Required), ITBM (Preferred), ITOM (Desired), Custom Applications (Desired) </p></li><li><p>Certifications: Certified ServiceNow Administrator (Required), Certified ServiceNow Application Developer (Preferred) </p></li></ul><p>Essential Functions: </p><ul><li> Provide technical leadership for the portfolio of applications managed by an IT Service Owner.<br></li><li> Drive the usability and quality of the software developed within the area.<br></li><li> Ensure technical currency is maintained within the applications within the portfolio.<br></li><li> Be a hands-on software engineer who can write quality code, assist with problem solving, root cause analysis, trouble shooting and coaching.<br></li><li> Write technical blogs and be active in Open Source Community.<br></li></ul><p>Agile, DevOPS and Cloud: </p><ul><li> Apply Design Thinking techniques on application design.<br></li><li> Lead agile software development efforts as a senior Technical Leader.<br></li><li> Coach and mentor other software engineers across teams on practices such as TDD, ATDD and pair programming.<br></li><li> Design highly scalable applications in AWS cloud using tools like Cloud Formation Templates, EC2, SWF, ELB, Lambda, S3, RDS/Dynamo DB and others.<br></li><li> Create load and performance testing strategy and perform advanced performance tuning.<br></li><li> Review and implement corrective and preventive measures based on metrics across portfolio of applications including but not limited to code quality, business metrics and performance metrics.<br></li></ul><p>General Job Information </p><p>Title </p><p>ServiceNow Solution Architect - Sr. Consulting SE </p><p>Grade </p><p>29 </p><p>Job Family </p><p>Info Technology Group </p><p>Country </p><p>United States of America </p><p>FLSA Status </p><p>United States of America (Exempt) </p><p>Recruiting Start Date </p><p>8/20/2018 </p><p>Date Requisition Created </p><p>8/7/2018 </p><p>Minimum Qualifications </p><p>Education </p><p>Bachelors Computer and Information Science </p><p>License and Certifications - Required </p><p>License and Certifications - Preferred </p><p>Other Job Requirements </p><p>Responsibilities </p><ul><li> 8+ years of related experience including experience working with Agile Methods and modern programming environments.<br></li><li> Experience in health care, insurance or related field.<br></li><li> Critical thinker.<br></li><li> Demonstrated problem solving techniques.<br></li><li> Strong verbal and written communication skills.<br></li></ul><p>Magellan Health Services is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled </p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "IRS8De52Q2y3rNsgQnVbCA",
    "url": "http://jobmote.com/jobs/23698-appian-solutions-designer-onsite-remote",
    "title": "Appian Solutions Designer (Onsite/Remote)",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Kyra Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 12:20:41 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>NEW POSITION!! Send in your resume along with salary expectation, availability, and contact information ASAP.</strong> </p><p><strong>Company Profile</strong></p><p><strong>Kyra Solutions, Inc.</strong> is a premier Information Technology Consulting Organization established in 1997 and headquartered in Lakeland, Florida. Kyra is a prime vendor of the State of Florida and provides high quality IT Consulting Services to its clients. Kyra has been in the IT Industry for 20 years and has been serving the IT Public Sector within the State of Florida for the past 15 years. The company has won numerous awards for its aggressive growth and quality of project execution; which include:</p><ul><li><strong>Florida's</strong> _ <strong>Best Companies To Work For</strong> _ <strong>2014 &amp; 2015</strong></li><li><strong>State's Diversity Business of the Year</strong></li><li><strong>America's Fastest Growing Private Companies - Inc. 5000</strong></li><li><strong>Tampa Bay Fast 50</strong></li></ul><p><strong>Contact Information</strong></p><p><strong><em>Email:</em></strong> </p><p><strong>Job Description</strong></p><p>Job Title: <strong>Appian Solutions Designer in Brooksville, FL (Onsite/Remote)</strong> Duration: <strong>Short Term</strong> </p><p><strong>Required Knowledge, Skills, and Abilities:</strong></p><ul><li>5 plus years of software development experience.</li><li>Four (4) plus years of experience working with Appian.</li><li>Ten (10) successful Appian projects completed.</li><li>Silver Certified (A-Score above 20).</li><li>Appian Lead Designer Credential.</li><li>Appian Analyst Credential.</li><li>Expert knowledge in use of Appian SDK, APIs and web services.</li><li>The ability to provide expert technical leadership for the Appian Development team following Appian Best Practices.</li><li>The ability to architect and design Appian BPM complex applications that meet the end-users' requirements and follow Appian Best Practices including process modeling, user interface design, integration with external systems and data modeling. The designed BPM system should improve current business processes where possible.</li><li>The ability to complete design reviews of the project team deliverables to ensure adherence to Appian Best Practices.</li><li>The ability to mentor Junior Appian designers and analysts (District staff).</li><li>Possess deep working knowledge or experience in multiple related technologies, such as Operating Systems, Application Servers, Web Servers, Databases, Webservices and Java.</li><li>The ability to work in an Agile team environment.</li><li>Excellent oral and written communication skills.<br></li></ul><p><strong>Kyra recruiters,</strong> know the industry landscape and our clients' needs well. We also understand you want not only a high wage position but long-term growth potential. Our employees have over a <strong>93% renewal rate</strong> while employed with us. We work hard to not only keep you working but growing with more challenging issues in need of innovative solutions.</p><p>If you are interested in this position or in working for Kyra in the future, please send us your resume with salary expectation, availability, and contact information. We look forward to hearing from you soon!</p><p><strong>Background / References</strong></p><p><strong>Verifiable Professional References will be required along with the resume, however, references will be checked/contacted after the interview and before the project starts.</strong> </p><p><strong>Background check (for past 10 years) will be done on the selected candidate for Employment, Criminal (State &amp; Federal), Education, and others as mandated by the client. Please make sure your resume and all other information provided are accurate. Any misrepresentation will mean permanent disqualification by the client.</strong> </p><p><strong>Equal employment opportunity employer.</strong></p><ul><li>provided by Dice Appian, Appian SDK, Appian API, Appian Best Practices, Appian BPM, Process Modeling, User Interface Design, Data Modeling, Databases, Java, Agile, Operating Systems, Web Services, Application Servers </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ujjULHl3ROWBKhn7N5Repg",
    "url": "http://jobmote.com/jobs/23664-servicenow-solutions-architect-remote",
    "title": "Servicenow Solutions Architect - Remote",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "JLA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 5:20:43 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>A leading Management Consulting firm specializing in providing business and technical expertise to clients across industries is now hiring a SERVICENOW Architect to work remote.</strong> <strong>Client has been named a top 10 firm to work for by Consulting Magazine for 6 of the past 7 years.</strong></p><p>Duties:</p><p>· Provide subject matter expertise, act as technical product advocate, design, develop and implement ITIL processes, ITSM, ITAM, SACM, Knowledge, Demand and Release Management modules within ServiceNow platform.</p><p>· Implement technology specific best practices and standards.</p><p>· Researches and evaluates alternative solutions and recommends the most efficient and cost-effective solutions.</p><p>· Proposes data model, design changes to processes and products, exerts significant latitude in determining objectives of an assignment.</p><p>· Translates requirements into functional and technical requirements.</p><p>· Designs and develops extensions to Service Now data model in support of requirements towards CMDB, SACM and other modules.</p><p>· Reviews and refines designs for usability, review testing scenarios and refines test cases, to ensure applications quality and works with users to review test results to ensure they meet expected results Support and coordinate scheduling and execution of releases, product upgrades, new technology deployments.</p><p>· Evaluation of new features and produce comprehensive analysis and recommendations. Perform and participate in product roadmap planning.</p><p>· Produces and maintains detailed system documentation including design specs, maintenance, troubleshooting, deployment, disaster recovery, technotes, and testing, etc.</p><p>Qualifications:</p><p>·Bachelor's degree in Computer Science, Engineering, or other related fields.</p><p>· Ten years of relative experience.</p><p>· Ability to work remotely and independently</p><p>· Practical experience with agile methodologies/tools Strong communication skills, both written and verbal, with the ability to describe technical solutions in the terms of the business.</p><p>· Experience with leading geographically separated customers and onshore/offshore teams Interact cross-functionally on matters that require coordination across the organization and collaborates well with other groups, voluntarily shares information.</p><ul><li>provided by Dice ServiceNow </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TW4KRby2S-m1yCuJW_SdaA",
    "url": "https://jobspresso.co/job/solutions-engineer/",
    "title": "Solutions Engineer",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Rainforest QA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 12:14:05 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Solutions Engineer</h2><div>Developer<br></div><div>Anywhere in US<br></div><div>Company: Rainforest QA<br></div><div>Full Time<br></div><h3>Overview</h3><p>&nbsp;It’s our mission to enable development teams to deliver bug-free software while moving at the speed of continuous delivery. Our headquarters are in the heart of San Francisco’s financial district but we are truly a global team, allowing us to bring together the best and most diverse talent. Our commitment to the distributed team model and to our company values has earned usand helped us build a diverse team of individuals working toward the same goal: change the way QA is done.</p><strong>Rainforest QA is an on-demand QA solution.</strong><strong>&nbsp;&nbsp;</strong><a href='https://www.rainforestqa.com/company/' rel='nofollow'>multiple culture and workplace awards</a><p></p><strong>Learn more about Rainforest QA by visiting&nbsp;</strong><u>our&nbsp;</u><strong>,&nbsp;,&nbsp;, and&nbsp;</strong><a href='https://www.linkedin.com/company/rainforestqa/' rel='nofollow'>LinkedIn</a><a href='https://www.glassdoor.com/Overview/Working-at-Rainforest-QA-EI_IE825703.11,24.htm' rel='nofollow'>Glassdoor</a><a href='https://www.instagram.com/rainforestqa/' rel='nofollow'>Instagram</a><a href='https://www.facebook.com/RainforestQA/' rel='nofollow'>Facebook</a><strong>&nbsp;pages.</strong><p>Solutions Engineer</p><p>As a Solutions Engineer at Rainforest QA you’ll architect solutions for customers, demonstrate proof of concepts, and work with sales throughout all aspects of the pre-sales customer journey. You’ll also use your expertise to build out the Sales Engineer function from scratch and partner with leaders across the organization on a regular basis to communicate customer requirements and product improvement ideas.</p><p></p><strong>What you’ll do</strong><ul></ul><li>Collaborate with Account Executives to identify and uncover customer business goals, needs, and pains, and work to show how RainforestQA can address them</li><li>Design, create, and present demos, and proofs of concept to a wide variety of business and technical stakeholders</li><li>Act as a technical subject matter expert for our platform at strategic conferences, Interactive customer events, webinars, etc.</li><li>Provide customer and market feedback to product and engineering team</li><li>Provide technical responses to RFPs and RFIs</li><li>Provide coaching to the customer facing teams to enhance their product knowledge, technical acumen, and technical sales skills</li><p></p><strong>What we’re looking for</strong><ul></ul><li>3+ years of technical experience as a engineer, sales engineer, solutions architect, etc.</li><li>You feel comfortable leading presentations and demos of our platform to groups, both technical and non-technical, in-person and virtually</li><li>Deep understanding of the software development lifecycle</li><li>Broad ops/infrastructure knowledge, especially networking and security</li><li>Experience with QA and the various technologies (eg selenium, gherkin, etc.) that make up the stack</li><p></p><strong>How we’ll reward you</strong><ul></ul><li>Remote work options</li><li>Competitive compensation and stock options</li><li>100% Medical, dental, and vision insurance covered (75% for dependents)</li><li>Voluntary 401 k program</li><li>Daily catered lunch and snacks</li><li>Subsidized commuter benefits</li><li>Generous vacation time</li><li>Professional development, in-office career coaching, and conference attendance</li><li>Dog friendly offices</li><li>Weekly team activities like happy hours, in-office yoga, and much more</li><p>OUR COMMITMENT TO DIVERSITY AND INCLUSION</p><p>At Rainforest QA we believe that diverse teams improve our business. We are an equal opportunity employer and do not discriminate on the basis of race, religion, color, nationality, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://jobs.lever.co/rainforest/c2c09702-bddb-442c-9dc1-49b225fd6846' rel='nofollow'>https://jobs.lever.co/rainforest/c2c09702-bddb-442c-9dc1-49b225fd6846 →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EQmhRF2gRZuJgIqQ5rX3iw",
    "url": "https://stackoverflow.com/jobs/169521/solutions-architect-nlp-and-machine-learning-critical-mix?a=UQPpTuM9Aly",
    "title": "Solutions Architect - NLP and Machine Learning at Critical Mix (Perrysburg, OH) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:reactjs/frontend/24",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=38, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=33}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Critical Mix",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Solutions Architect - NLP and Machine Learning</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Integrated Marketing Solutions</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Critical Mix | Perrysburg, OH<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Perrysburg, OH.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>reactjs</div><div>go</div><div>python</div><div>watson-conversation</div><div>php</div>                <h3>Job description</h3>                <div><p>&nbsp;&nbsp; Critical Mix is looking for a&nbsp;<strong>Solutions Architect</strong>&nbsp;to work with our teams across the United States and is passionate on simplifying the complex with digital innovation.&nbsp; Success in this position will require some unique knowledge in the areas of natural language processing services such as Watson and Lex as well as expertise in machine learning technologies. Of course, none of this really functions without an exceptional and intuitive BOT interface for the end user.</p><p><strong>Responsibilities:</strong></p><ul><li>Take technical lead on the team in the ML/NLP domain and keep up with latest industry solutions.</li><li>Design, develop, validate and deploy proposed ML/NLP solutions both internal and client facing.</li><li>Innovate and&nbsp;build new features for our products including chatbots and virtual assistants.</li><li>Coaching and mentoring a team of diverse and talented software engineers.</li><li>Interfacing with senior management and stakeholders to define requirements and take the lead on operational and technical projects in a fast-paced environment.</li></ul><p><strong>Requirements</strong></p><ul><li>Advanced degree Computer Science, Statistics, Mathematics, or related area&nbsp;</li><li>3+ Years of experience building software products as an Architect</li><li>1+ years ML/NLP domain experience.</li><li>Experience with Python or Go programming languages</li><li>Knowledge of JavaScript frameworks like ReactJS, React Native, AngularJS</li><li>Experience with Microservices and Resftul API’s</li><li>Familiarity with a major machine learning/deep learning frameworks a plus (Keras, Tensorflow, Torch, Spark-ML)</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/169521?reset=False&amp;ra=UQPpTuM9Aly&amp;oqs=a%3DUQPpTuM9Aly' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Critical Mix</h3>            <div><p>Critical Mix provides easy access to highly-targeted global survey respondents, survey programming and data visualization services for market research and consulting firms. Driven by a passion for simplifying data collection, the team at Critical Mix is personally invested in giving clients the ultimate customer service experience.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Health benefits</span>                            </li>                            <li>                                <span></span>                                <span>Flexible schedule</span>                            </li>                            <li>                                <span></span>                                <span>Great work/life integration</span>                            </li>                            <li>                                <span></span>                                <span>Empowerment</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited vacation policy</span>                            </li>                            <li>                                <span></span>                                <span>Competitive compensation</span>                            </li>                            <li>                                <span></span>                                <span>Remote location</span>                            </li>                            <li>                                <span></span>                                <span>Gym memberships</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4rvNyFkCQEOvk4MKw6fxiQ",
    "url": "https://stackoverflow.com/jobs/194780/solution-engineer-id-prse01-open-xchange-gmbh?a=13k2gGHkY1qM",
    "title": "Solution Engineer (ID: PRSE01) at Open-Xchange GmbH (Nürnberg, Deutschland) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "c"
    ],
    "hiringOrganization": {
      "name": "Open-Xchange GmbH",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Solution Engineer (ID: PRSE01)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Collaboration Tools, Computer Software, Open-Source</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Open-Xchange GmbH | Nürnberg, Deutschland<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Nürnberg, Deutschland.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>powerdns</div><div>dns</div><div>linux</div>                <h3>Job description</h3>                <div><strong>Don’t just go to work.&nbsp;Thrive.</strong><br>Here are people committed to openness, a rebellious business spirit and they have the will to revolutionize the market.<p></p><p><strong>We are eMail</strong><br>Worldwide companies like: 1&amp;1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace use our &quot;white label&quot; products for eMail and collaboration.</p><p><strong>Open people for an open source!</strong><br>Join the force which works on products to support people in their daily digital life without sacrificing their personal freedom and protect their data.</p><p>Daily activities alternate between working on customer issues and actual &quot;Professional Services for customer implementations (both on &amp; off-site). As a Solutions Engineer (with a focus on PowerDNS) you will work closely with the PowerDNS development team, as well as other parts of Open-Xchange and Dovecot development, sales and Product Management teams form within the European Service team.</p><p>We think Support &amp; Implementation is a great step into a promising career. We are specifically looking for employees willing to learn quickly while delivering great support and service. Keeping an eye towards growing within the Global Services department or into different roles in the larger Open-Xchange organisation. In other words, this position is a great opportunity for your personal development. There will be a close and intimate cooperation between PowerDNS and OX Professional Services regarding the &nbsp;support, implementation and development roles.</p><p><strong>Your passion / Your job</strong></p><ul><li>Implementation &amp; Support of PowerDNS technology for our customers</li><li>Investigate and reproduce complex custom issues, test solutions, help implement fixes</li><li>Providing technical support during complex deployment projects and roll-outs</li><li>Evaluation of customer environment, creation of custom integration concepts, and writing SOWs for actual implementations.</li><li>Customer communication and managing (technical) relationship</li><li>Work closely with PowerDNS (including Open-Xchange and Dovecot) development, sales, and product management teams</li><li>Manage architecture, design and documentation for customer solutions &amp; projects</li><li>Hands on training of customer’s administrators and support team</li></ul><p><strong>What do you bring to the table</strong></p><ul><li>Good knowledge of DNS technologies and solutions (Open source and commercial).</li><li>Knowledge and experience with PowerDNS is a bonus</li><li>Experience in system administration or support of Unix or Linux systems, ideally in the hosting/telco market.</li><li>In-depth knowledge of and demonstrated experience with Linux systems</li><li>Experience with System architecture and design (design and analysis of complex setups in heterogeneous environments).&nbsp;</li><li>Good understanding of large, complex networking environments (IP, Anycast, Telco mobile and broadband networks, etc.)</li><li>Hands-on experience with Ansible, cloud technologies and databases (MySQL, PostgreSQL, Redis and sqlite)</li><li>Knowledge of Lua script and/or C++ is a bonus.</li><li>Ability to work independently</li><li>Ability to travel international</li><li>Excellent verbal and written communication skills in English</li><li>multi-lingual candidates (in German, Dutch, French, Spanish or Italian) will get bonus points</li><li>Experience with mission critical systems</li><li>knowledge of large scale E-Mail systems is a bonus&nbsp;</li></ul><p><strong>What do we offer</strong></p><ul><li>Training and personal development</li><li>Home Office and the opportunity to work from one of the many offices we define as the OX world</li><li>The latest in IT equipment</li><li>Flat hierarchies combined with &quot;Open Door&quot; policies</li><li>Personal development in a dynamic environment</li></ul><p>                </p></div>            <div>        <span>Apply now</span></div>            <h3>About Open-Xchange GmbH</h3>            <div><p><strong>Open-Xchange / Open people for Open source</strong></p><p>With some 250+ employees Open-Xchange develops a Open-Source-Software addressing communication, collaboration and office-productivity worldwide. Sales are made through Internet service providers, hosting, telecommunication and cable providers, which offer their customers the Open-Xchange solution as SaaS (Software as a Service). More than 200 million users adopted Open-Xchange software for their private and business communications via partners such as 1 &amp; 1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace.</p><p>The core offer is named <a href='https://www.open-xchange.com/portfolio/ox-app-suite/' rel='nofollow'>OX App Suite</a> with applications for processing e-mails, contacts and appointments, which can be extended by functions like: <a href='https://www.open-xchange.com/portfolio/ox-drive/' rel='nofollow'>OX Drive</a> for managing and synchronizing documents, images, photos and movies; <a href='https://www.open-xchange.com/portfolio/ox-documents/' rel='nofollow'>OX Documents</a> for text processing, spreadsheets and presentations and <a href='https://www.open-xchange.com/portfolio/ox-guard/' rel='nofollow'>OX Guard</a> for encrypting emails and files. Software from <a href='https://www.open-xchange.com/portfolio/dovecot-pro/' rel='nofollow'>Dovecot</a> and <a href='https://www.open-xchange.com/portfolio/ox-powerdns/' rel='nofollow'>PowerDNS</a> are complementing Open-Xchange's portfolio.</p><p>We want to constantly advance and are looking for people who have fun working with the latest technologies in an international team. There are locations in Hamburg, Bremen, Dortmund, Cologne, Olpe and Nuremberg as well as Finland, France, the Netherlands, Italy and Spain. International offices are in Tokyo, Sydney and Palo Alto which represents the distributed team in the USA.</p><p>If you are interested, please contact Jochen F. Schude for further information - or send us your paperless application with a cover letter including the job ID, tabular CV, certificates, salary request and the earliest possible date of entry by e-mail to recruiting at open-xchange.com.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Homeoffice</span>                            </li>                            <li>                                <span></span>                                <span>Flache Hierarchien</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Arbeitszeiten</span>                            </li>                            <li>                                <span></span>                                <span>Modernste Technik</span>                            </li>                            <li>                                <span></span>                                <span>Work-Live-Balance</span>                            </li>                            <li>                                <span></span>                                <span>Culture-Mixed</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kthf_tZMRBmV_AJKETYNNA",
    "url": "https://stackoverflow.com/jobs/186436/architecte-solutions-capgemini-france?a=10wxwXFSDNa8",
    "title": "Architecte Solutions at CAPGEMINI FRANCE (Paris, France) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:windows-ce/embedded/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=15, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "CAPGEMINI FRANCE",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "€",
      "minValue": 50000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Architecte Solutions</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Automation, IT Consulting, Technology Consulting</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>10k+ people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: CAPGEMINI FRANCE | Paris, France<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Paris, France.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>java</div><div>jee</div><div>esb</div><div>mom</div><div>soa</div>                <h3>Job description</h3>                <div><p>En pleine transformation digitale, les grands comptes du secteur Banque &amp; Assurance font appel à l'entité FS SBU (Financial Services Strategic Business Unit) du groupe Capgemini. A Paris, Nantes ou Montpellier, les 1 300 talents de la FS s'appliquent à imaginer et réaliser des solutions novatrices, adaptées aux nouveaux enjeux de demain.<br> <br> En tant qu'Architecte Solution H/F, vous avez participé à des projets de transformation. Outre votre connaissance des techniques et méthodologies, cela vous a permis de développer vos aptitudes relationnelles et votre leadership. Chez Capgemini, vous accompagnez les projets de nos clients en travaillant avec des interlocuteurs variés.<br> <br> Vos missions :<br> <br> - Accompagner les projets dans leurs différentes phases<br> - Participer au recueil des besoins et problématiques métiers et techniques<br> - Concevoir des solutions qui répondent aux exigences de performance, de robustesse, d'exploitabilité et de sécurité<br> - Définir et porter les architectures applicatives et techniques en assurant la traçabilité et la justification des choix<br> - Participer ou piloter la conception détaillée, la réalisation des solutions<br> - Avoir un rôle d'expert technique pour valider la faisabilité des projets<br> - Contribuer aux actions d'avant-vente<br> - Participer au développement de le la communauté des architectes Capgemini<br> - Faire progresser le positionnement et la reconnaissance technologique de Capgemini en tant qu'acteur majeur de la transformation Digitale des entreprises.<br> - Apporter votre valeur dans l'amélioration des outils et méthodes Capgemini<br> - Suivre et coacher des architectes juniors afin de garantir la qualité de notre delivery et de les épauler dans leur évolution professionnelle.</p><p>Diplômé d'un BAC+5 (Ecole d'ingénieur, Master 2 Système d'Information), vous maîtrisez les principales technologies et approches de l'architecture de SI (ESB, MOM, SOA, REST) ainsi que les problématiques associées (organisation dont agilité, devOps). Vous avez une expérience des solutions innovantes (microservices, RPA, IA, APIzation, Cloud...).</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/186436?reset=False&amp;ra=10wxwXFSDNa8&amp;oqs=a%3D10wxwXFSDNa8' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About CAPGEMINI FRANCE</h3>            <div><p>Fort de 50 ans d’expérience et d’une grande expertise des différents secteurs d’activité, le groupe accompagne les entreprises et organisations dans la réalisation de leurs ambitions, de la définition de leur stratégie à la mise en œuvre de leurs opérations. Capgemini, leader mondial du conseil, des services informatiques et de la transformation numérique, a réalisé un chiffre d'affaires de 12,7 milliards d'euros en 2017.</p><p><strong>Notre vision</strong> <br>Pour Capgemini, ce sont les hommes et les femmes qui donnent toute sa valeur à la technologie. L’honnêteté, l’audace, la confiance, la liberté et l’indépendance d’esprit, la solidarité, la simplicité et le plaisir sont les valeurs fortes qui façonnent la manière dont nous répondons aux besoins de nos clients. Résolument multiculturel, le Groupe compte 200&nbsp;000 collaborateurs présents dans plus de 40 pays.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Contexte multiculturel</span>                            </li>                            <li>                                <span></span>                                <span>Misions diversifiées : clients d'envergure, tous secteurs d'activité</span>                            </li>                            <li>                                <span></span>                                <span>Ecole de formation : réseaux d'experts, certifications, Université...</span>                            </li>                            <li>                                <span></span>                                <span>Accord égalité professionnelle Hommes/Femmes</span>                            </li>                            <li>                                <span></span>                                <span>Accord Télétravail</span>                            </li>                            <li>                                <span></span>                                <span>Mutuelle d'entreprise</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fYQjiQmuRfaTnswdP0hh7A",
    "url": "https://stackoverflow.com/jobs/200034/senior-database-bi-developer-jbs-custom-software-solutions?a=155hvs3uuP4I",
    "title": "Senior Database / BI Developer at JBS Custom Software Solutions  ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:sql-server/dotnet/3",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=16, c=2, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "JBS Custom Software Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Senior Database / BI Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Database Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: JBS Custom Software Solutions | No office location<br></div><h3>Technologies</h3><div></div><div>etl</div><div>sql-server</div><div>olap</div><div>ssas</div><div>powerbi</div>                <h3>Job description</h3>                <div><p><strong>Required:</strong></p><ul><li>5+ years experience with common Data Warehousing patterns&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>5+ years experience with ETL processes and procedures &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</li><li>Experience with optimizing and performance tuning SQL queries&nbsp; &nbsp;</li><li>Experience with tabular models and solutions</li><li>Experience designing and development MOLAP and tabular cubes</li><li>Experience with SQL Server Analysis Services, SQL Server Reporting Services, SQL Master Data Services, SQL Data Quality Services&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with data visualization toolsets such as PowerBI and Kibana&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with Business Intelligence concepts and implementations&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with Azure&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Strong knowledge of Microsoft Windows operating system environment &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ability to accurately estimate work&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Strong communication skills&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li></ul><p><strong>Nice to Have:</strong></p><ul><li>Experience with C#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with MVC or other web development frameworks&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with NoSql databases such as MongoDB&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Experience with service oriented architectures and webservices (REST/SOAP/etc)</li></ul><p><strong>JBS Benefits</strong></p><ul><li>Full-time employment with benefits</li><li>Work from home</li><li>Medical/Dental/Life/Disability</li><li>401k with company match</li><li>Paid overtime</li><li>PTO and Company Holidays</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/200034?reset=False&amp;ra=155hvs3uuP4I&amp;oqs=a%3D155hvs3uuP4I' rel='nofollow'>Apply now</a></div>                    <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Remote Work</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1jmOL9NwT5S9djSLtOj4uA",
    "url": "https://stackoverflow.com/jobs/195351/l%C3%B6sungsarchitekt-solution-architect-platformsh?a=13vUntmHmuas",
    "title": "Lösungsarchitekt - Solution Architect at Platform.sh  ",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:drupal/php/10",
      "DBG_TECH1:k/t/w:el/java/8",
      "DBG_TECH1:k/t/w:magento/php/40",
      "DBG_TECH1:k/t/w:symfony/php/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=66, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Platform.sh",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Lösungsarchitekt - Solution Architect</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Platform.sh | No office location<br></div><h3>Technologies</h3><div></div><div>cloud</div><div>linux</div><div>symfony</div><div>drupal</div><div>amazon-web-services</div>                <h3>Job description</h3>                <div><p>Unsere Kunden brauchen Onboarding und Training, bevor sie den Platform.sh-Spaß meistern können. Können Sie atemberaubende und aufregende Tech-Demos liefern und die Feinheiten der Kommandozeilen-Tools erklären? Wir betreiben OEM PaaS-Services für bekannte Marken wie Magento Enterprise Cloud Edition und Sensio Cloud - können Sie uns helfen, diese dynamischen Softwareprodukte zu entwickeln und zu betreiben?</p><p>Sie berichten direkt an unseren Director of Customer Solutions und sind in enger Zusammenarbeit mit unseren Teams für Vertrieb, Support, Engineering und Infrastruktur verantwortlich für den Verkauf und die proaktive Sicherstellung eines stabilen und sicheren Produkterlebnisses:</p><ul><li>Anpassung des Produkts an die Anforderungen der potenzielle Kunden</li><li>Enge Zusammenarbeit mit Vertriebsteams für Produktdemos und Beantwortung technischer Fragen</li><li>Eingliederung und Bildung von Neukunden</li><li>Demonstration des Geschäftswissens unserer Kunden im Hinblick auf unsere Produktnutzung</li><li>Analyse der technischen Bedürfnisse der Kunden, um Beratungsleistungen vorzuschlagen und deren Anforderungen zu erfüllen.</li><li>Unterstützung unserer Großkunden bei der täglichen Nutzung unserer Produkte</li><li>Zusammenarbeit mit den Entwicklungsteams, wenn dies für die Produktverbesserung erforderlich ist.</li><li>sich regelmäßig mit unseren neuen Produktfeatures vertraut zu machen</li></ul><p>Sie geben unseren Kunden einen ersten Eindruck von unserem Produkt und führen den Weg zu hoher Zufriedenheit in ihrer Produkterfahrung.</p><p><strong>Was wir suchen</strong></p><ul><li>Nachgewiesene erfolgreiche Erfahrung im Umgang mit technischen Kundenbeziehungen in der Web-Branche</li><li>Nachweis der Fähigkeit, Kundenerwartungen erfolgreich mit der Produktkapazität abzugleichen</li><li>Umfangreiches Wissen über Architektur und Dienste von Webanwendungen (DNS, CDN, Webserver, Datenbanken, Cache-Layer usw.) und verteilte Systeme.</li><li>Umfangreiche Kenntnisse von Web-Entwicklungs-Workflows und vorhandenen Tools (Git, CI-Tools)</li><li>Kenntnisse gängiger Webanwendungen und Frameworks: Magento Ecommerce, Symfony, Drupal, eZ Platform oder Typo3 (viele unserer Kunden betreiben diese)</li><li>Kenntnisse über Cloud-Dienste (AWS, Azure)</li><li>Dynamik mit einem kühler Kopf</li><li>Ausgezeichnete Kommunikationsfähigkeiten mit Englischkenntnissen und deutsche als Muttersprache.</li></ul><p><strong>Schön zu haben :</strong></p><ul><li>Mad Linux (Debian) skillz</li><li>Öffentliches Reden Erfahrung</li></ul>                </div>            <div>        <a href='https://grnh.se/e467c76b2' rel='nofollow'>                        Apply now        </a></div>            <h3>About Platform.sh</h3>            <div><p>Wir sind ein Risikokapital finanziertes, preisgekröntes Team von Hardcore-Hackern, die die Art und Weise revolutionieren möchten, wie Entwickler und Agenturen Webanwendungen erstellen und bereitstellen. Wir sind meistens verteilt, aber wir treffen uns täglich im Cyberspace und gelegentlich in Paris, Frankreich. Wir schätzen Begeisterung, Teamgeist und den ständigen Wunsch, das persönliche Wissen zu erweitern und einen Beitrag für die Gemeinschaft zu leisten. Wir bieten eine multikulturelle, lockere und ausgeglichene Arbeitsumgebung. Kürzlich haben wir der Einführung der Magento Enterprise Cloud Edition und der Sensio Cloud im/mit Platform.sh-Technologie mitgeholfen.</p><p>Zu unsere Kunden zählen unter anderem Vivienne Westwood, der britische Modehändler Reiss, die Canadian Football League, der British Council, der Parc Asterix, Seloger.com, das deutsche Start-up Flixbus oder das südamerikanische El Universo.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Work from home, wherever you are</span>                            </li>                            <li>                                <span></span>                                <span>Safe and friendly working environment</span>                            </li>                            <li>                                <span></span>                                <span>Stock options for everyone</span>                            </li>                            <li>                                <span></span>                                <span>Rest and recovery are essential to health and happiness; we get that</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JqofoN36QOusDwrSKYjCwA",
    "url": "https://stackoverflow.com/jobs/172410/php-plus-laravel-engineer-at-high-growth-fintech-lenox-park-solutions-llc?a=VOTNmFSPHQk",
    "title": "PHP + Laravel Engineer at High-Growth FinTech Company at Lenox Park Solutions LLC (Austin, TX) ",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:laravel/php/40",
      "DBG_TECH1:k/t/w:php/php/35",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=75, embedded=0, frontend=24}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Lenox Park Solutions LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 35000,
      "maxValue": 40000,
      "info": "",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>PHP + Laravel Engineer at High-Growth FinTech Company</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Junior, Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Financial Technology, Investment Banking, Software Development / Engineering</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1-10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Lenox Park Solutions LLC | Austin, TX<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Austin, TX.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>php</div><div>laravel</div><div>vue.js</div><div>ubuntu</div><div>linux</div>                <h3>Job description</h3>                <div><p>Lenox Park Solutions is seeking a PHP Engineer with 2-5 years of commercial experience. As a PHP Engineer, you would work closely with our Development team to code and test functionality which will directly increase the scalability of Roundtables, our flagship product which will disrupt and revitalize the Asset Management industry. The junior developer will work directly with an experienced Senior PHP Engineer in helping to execute platform development, and will have the opportunity to grow within the organization as LPS expands it technical team. At LPS, we focus on accountability, proactive-ness, and creative thinking. Staff members retain the option to work remotely, as we are a goals-oriented team.</p><ul><li><strong>Requirements</strong>:</li><ul><li>Professional experience on PHP, specifically with Laravel, VueJS/ReactJS, and Git, and preferably with Laravel Queues, Websockets, Amazon Web Services, and Linux (Ubuntu);</li><li>Outstanding communication skills, both verbal and written experience with technical and non-technical audiences;</li><li>Ability to assess ongoing processes critically and recommend creative, thoughtful operational improvements;</li></ul><li><strong>Preferred Skills</strong>:</li><ul><li>Understanding of Asset Management industry;</li><li>Business-oriented, highly analytical mind with a knack for accounting for both complex business and technical considerations simultaneously</li></ul></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/172410?reset=False&amp;ra=VOTNmFSPHQk&amp;oqs=a%3DVOTNmFSPHQk' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Lenox Park Solutions LLC</h3>            <div><p>Lenox Park Solutions LLC (LPS) is a FinTech firm focused on Asset Managers and Financial Institutions. Our mission is to enable the democratization of access to Institutional capital by using technology to match best-in-class Asset Allocators with the most talented Asset Managers. Our solutions will challenge entrenched traditional notions of who should be able to manage money, upending the staid model where pedigree and privilege drive capital allocation. Leveraging deep experience in investment banking and asset management, LPS licenses CRM solutions that emphasize networking and collaboration to manage Fundraising, Deal Pipeline, Business Development and Operations. LPS maintains offices in New York, NY and Austin, TX.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Remote Office</span>                            </li>                            <li>                                <span></span>                                <span>Experienced Investment Professionals</span>                            </li>                            <li>                                <span></span>                                <span>Austin and New York Offices</span>                            </li>                            <li>                                <span></span>                                <span>Lean, Entrepreneurial Team</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "R5SACZCGTMaS47yoYOtZLQ",
    "url": "http://jobmote.com/jobs/23476-ping-access-remote-identity-and-access-management-iam-solutions-ar",
    "title": "Ping Access - Remote,Identity and Access Management / IAM Solutions Ar",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 120000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 1:20:54 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Identity and Access Management / IAM Solutions Architect candidates will have experience with Ping Access. If no strong/current Ping Access experience it's a no-go. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US. Must be US Citizens or Permanent Residents with easily understood English speaking skills.</p><p>Location - Virtual-Remote-Telecommute - 35% travel<br>Starting salary $100,000 to $120,000+ per year, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><h2>US citizens or Permanent Residents only </h2><h2>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies. </h2><h2>In this Identity and Access Management Solutions Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions. </h2><p>Duties and Responsibilities<br>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life-cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analyzing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM </p><h2>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </h2><p>Technical Experience and Qualifications<br>-Experience with Ping Access<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Experience with IAM products: Radiant Logic, Sailpoint, Centrify, ForgeRock, Ping Access, Ping Identity / Ping ID/ PingID, Ping Federate, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (i.e. VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><ul><li>provided by Dice Ping Access, IAM, Solution Architect </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ufElsTsyQImN302sGZ3Rbw",
    "url": "http://jobmote.com/jobs/23418-looking-for-salesforce-solution-architect-remote",
    "title": "Looking for Salesforce - Solution Architect - Remote",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Intuites",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 11:20:58 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>Looking for Salesforce - Solution Architect - Remote</strong></p><p><strong>Location: Connecticut, 25% travel, mostly remote.</strong></p><p><strong>800 hours estimated</strong></p><p>Salesforce Lightning skills and experience required.</p><p>App-dev experience not as a developer but as business analyst / solution architect / some project mgr experience a plus.</p><p>Environment is a prototype app development in Lightning, and a set of core design / requirements as foundation - build a proof of concept.</p><p>Additional required:</p><p>Consulting experience with reputable outfit</p><p>Solution Architect experience, demonstrated recent experience in the role of Salesforce Solution Architect, where business analyst skills were deployed specifically over the Salesforce platform.</p><p>-- Best RegardsVijay <strong>Intuites LLC</strong> 4640 Valais Ct, Ste 101A, Johns Creek, GA 30022Direct: |Fax: Email: |</p><ul><li>provided by Dice Salesforce Lightning skills and experience required. App-dev experience not as a developer but as business analyst / solution architect / some project mgr experience a plus. Environment is a prototy </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "J37PishFTbWdh7UVnlIFPA",
    "url": "https://news.ycombinator.com/item?id=17663424",
    "title": "Gravitational (YS S15) | Devops, Solutions Engineer | Toronto, Oakland | ONSITE REMOTE https://gravitational.com ...",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 5:34:06 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>Gravitational (YS S15) | Devops, Solutions Engineer | Toronto, Oakland | ONSITE REMOTE <a href='https://gravitational.com' rel='nofollow'>https://gravitational.com</a><p>Gravitational, systems &amp; cloud startup in Oakland and Toronto, is looking for ambitious and talented people. We are well-funded by fantastic Silicon Valley investors. We are an experienced team: we founded Mailgun[1] which was acquired by Rackspace, we created Vulcand[2] and some other cool stuff at Rackspace and are authors of Teleport[3], Telekube[4] and Teleconsole[5]</p><p></p><pre><code>  * Solutions Engineer (Terraform, Linux, Kubernetes, Go, Ansible)</code></pre>We are looking for an experienced systems engineer who can code and can focus on our customers success - making sure our products solve their problems well. This job involves a lot of customer interactions, support, coding in Go, devops and systems engineering.<p>Locations: Toronto, Oakland, Remote</p><p>Details: <a href='https://gravitational.com/careers/solutions-engineer/' rel='nofollow'>https://gravitational.com/careers/solutions-engineer/</a></p><p>Contact: jobs@gravitational.com</p><p>[1] <a href='https://www.mailgun.com' rel='nofollow'>https://www.mailgun.com</a></p><p>[2] <a href='https://github.com/vulcand/vulcand' rel='nofollow'>https://github.com/vulcand/vulcand</a></p><p>[3] <a href='https://github.com/gravitational/teleport' rel='nofollow'>https://github.com/gravitational/teleport</a></p><p>[4] <a href='https://gravitational.com/telekube' rel='nofollow'>https://gravitational.com/telekube</a></p><p>[5] <a href='https://www.teleconsole.com/' rel='nofollow'>https://www.teleconsole.com/</a><span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
