{
 "items": [
  {
    "id": "jQ92uGj6RhWrOky3d7UrmQ",
    "url": "http://workinstartups.com/job-board/job/91533/recipe-developer-content-creator-at-tbc/",
    "title": "Recipe Developer & Content Creator",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TBC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 2:40:56 PM",
    "validThrough": "May 5, 2020 2:40:56 PM",
    "crawled": "Apr 28, 2020 4:05:20 PM",
    "content": "<p><strong>WHO WE ARE</strong></p><br /><p>We are an innovative London based food start up that is creating an entirely new category. We are the only business in Europe seeling our premium products and we are looking for an in-house recipe developer and content creator. Because of the uniqueness of our products, we need to educate our cutomers/followers on how to use our products and we are looking for a talented chef/baker to come on board and lead our digital strategy.</p><br /><p><strong>WHAT WE ARE LOOKING FOR</strong></p><br /><p>Are you a social media junkie? Do you have any experience at all in working with the arts? Do you understand our curatorial voice and aesthetics? Do you like to take risks?</p><br /><p>We are looking for a recipe development &amp; content creator intern to manage &amp; carefully curate our digital assets including our Instagram and Twitter accounts as well as being the in house voice on our recipe blog. You will be the creative marketing director with freedom to experiment and try new things! Working directly with the CEO, you will be have the ability to shape the voice and feel of a brand that is set to be one of the most exciting in the UK food industry.</p><br /><p><strong>THE ROLE</strong></p><br /><ul><br /><li>Authoring at least 1 - 2 recipes per week (up to as many as you'd like but 1 - 2 as a minimum) along with 1 video per week for social media channels.</li><br /><li>Branding communication&nbsp;</li><br /><li>Marketing content creation</li><br /><li>Social media marketing: Content / posting narratives and support across channels</li><br /><li>Ideal generation and business development</li><br /></ul><br /><p><strong>SKILLS REQUIRED</strong></p><br /><ul><br /><li>Obsessive attention to detail</li><br /><li>Enthusiastic, proactive, disciplined, dedicated and keen to learn all aspects of a start-up</li><br /><li>Excellent English skills</li><br /><li>Show initiative and creativity</li><br /><li>Ability to cook a wide range of dishes</li><br /><li>Excellent photography skills to stop people scrolling</li><br /><li>Strong sales / pitching / communication skills&nbsp;</li><br /></ul><br /><p><strong>BENEFITS</strong></p><br /><p>You get to be the lead creative in a growing company and have the team / business grow beneath &amp; around you. You also get to be creative &amp; experiment with free reign to design the social media pages of your dreams with the backing of an exciting brand. You also get to work anywhere, at any time to suit you.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "R0XAcowFQxa9_itz4Pcs2A",
    "url": "http://workinstartups.com/job-board/job/91528/copywriter-intrapreneurship-content-at-you-intrapreneur/",
    "title": "Copywriter [Intrapreneurship content]",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=8, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/nodejs",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "you intrapreneur",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 11:15:22 AM",
    "validThrough": "May 5, 2020 11:15:22 AM",
    "crawled": "Apr 28, 2020 1:05:19 PM",
    "content": "<p>At You Intrapreneur (<a href='https://www.youintrapreneur.com/'>https://www.youintrapreneur.com/</a>) we teach people how to become corporate entrepreneurs to advance their careers within their organization or outside their organization.</p><br /><p>We want to build the workforce of the future raising CEO alike profiles who can lead at every level of their company, who have a broad range of competences, and can go deep and/or broad to solve problems and build solutions.&nbsp;</p><br /><p>Our students' motto is: &quot;you don't need to be a CEO to work as a CEO!&quot;.</p><br /><p><strong>Role:</strong></p><br /><p>Support the Head of Marketing and the Head of Evangelists to <span class=&quot;WbZuDe&quot;>craft messages and content that are accessible and informative, but also fulfil the style and tonality that will help the YI brand to stand out and connect with young professionals.</span></p><br /><p><strong>Responsibilities:</strong></p><br /><ul><br /><li>Working with multiple stakeholders to design our website and marketing campaigns</li><br /><li>Editing and proofreading content developed by our Subject Matter Experts (Finance, Sales, Marketing, HR, Technology) to inform but engage our future customers</li><br /><li>Crafting the business value proposition finding the right words to express the power of intrapreneurship while connecting with people in a simple and immediate way&nbsp;</li><br /></ul><br /><p><strong>Ideal Candidate:</strong></p><br /><ul><br /><li>A passion for writing; likes to be creative and think outside the box conceptually</li><br /><li>Outstanding communication skills</li><br /><li>Qualification in advertising, communication/media, English, journalism, PR or equivalent experience is desirable</li><br /></ul><br /><p><strong>What you'll have back:</strong></p><br /><ul><br /><li>the possibility to contribute developing future leaders and &quot;give back&quot; with your knowledge</li><br /><li>you'll be part of a team, virtually meet other experts to expand your network</li><br /><li>add a new experience on your CV and join our community of Advisers once everything goes back to normal</li><br /><li>access coaching sessions for free</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong><em>Please note this is an unpaid volunteer role for people in furlough or someone interested in having professional experience during the Covid-19 period.</em></strong></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bxiz9sNzRTWSsGo_7RWAxw",
    "url": "https://problogger.com/jobs/job/dog-pet-writers-wanted-long-term-consistent-work/",
    "title": "Dog & Pet Writers Wanted: (Long-Term, Consistent Work)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "DoggieDesigner",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:00:00 AM",
    "validThrough": "May 4, 2020 2:00:00 AM",
    "crawled": "Apr 27, 2020 1:06:11 PM",
    "content": "<h3>Dog &amp; Pet Writers Wanted: (Long-Term, Consistent Work)</h3><div>Company: DoggieDesigner</div>Location: Remote<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <ul><li>Do you have&nbsp;<strong>top-shelf writing skills</strong>&nbsp;and&nbsp;<strong>a passion for animals</strong>?</li><li>Are you a&nbsp;<strong>pet industry veteran</strong>&nbsp;or&nbsp;<strong>lifelong pet owner</strong>? Perhaps you have a couple of furry kids at home?</li><li>Are you someone who&nbsp;<strong>loves to share their knowledge with others</strong>?</li></ul><p>If you’re nodding your head at this point, we should talk.</p><p><strong>We’re hiring writers for long-term, consistent work</strong></p><p>Our media company owns and operates an exciting range of websites that help pet owners make educated decisions about the well-being of their best friends and family members.</p><p>To get a glimpse of what we're all about, take a look at DoggieDesigner.com, one of our more popular sites.</p><p>We’re looking to bolster our content team with a few more lights-out writers who want to share their knowledge of the animal kingdom with fellow pet owners and animal enthusiasts.</p><p>Therefore, we need:</p><ul><li>Dog writers</li><li>Cat writers</li><li>General pet writers (anything from hamsters to bearded dragons)</li></ul><p><strong>We need high-quality pet care content</strong></p><p>In addition to penning exceptionally informative content like “How to Properly Hold Your Rabbit”, you’ll be covering the pantheon of pet care products – from hamster wheel comparisons to best cat food dispensers to weight management programs for obese dogs.</p><p>OK, great. Let’s get down to business.</p><p><strong>Why work with us?</strong></p><ul><li><strong>Competitive pay</strong>&nbsp;– The greater your experience, the higher we pay. Moreover, we routinely give raises to writers who perform. Plus, we give per article bonuses on a wide range of materials.</li><li><strong>No long, drawn-out payment process</strong>&nbsp;– You’ll be paid three days after you submit work for the last deadline. For example, our deadline is Saturday, 11:59 PM EST. You’ll be paid (via PayPal) that coming Wednesday (usually in the morning).</li><li><strong>Consistent work</strong>&nbsp;– Emphasis on&nbsp;<strong><em>consistent</em></strong>. We’ll assign articles every week – week in, week out. We have more work than our current team can handle, obviously. Many of our writers have been with us six months or longer. Several writers work for us full-time and make an excellent living. Word counts per week range from 10-25k+.</li><li><strong>Flexibility</strong>&nbsp;– Work at your own pace, adjust your desired word count per week to suit your availability.</li><li><strong>Weekly deadlines</strong>&nbsp;– Get your assignment on Saturday, turn it in the following Saturday.</li><li><strong>Our editors&nbsp;<em>care</em></strong>&nbsp;­– We believe in getting the best out of our writers with encouragement and constructive communication. Your assigned editor will be invested in your success as a writer. When you have questions or concerns, we’ll be there like <em>Shazam!</em></li><li><strong>Superb guidance via SOPs</strong>&nbsp;­– Our comprehensive writer’s guidelines cover everything you need to know about working with us, including instructional videos and detailed examples.</li><li><strong>Bulk up your portfolio</strong>&nbsp;– You’ll start to lose count of your published articles about a month into this gig.</li><li><strong>Potential for a byline and author's bio</strong>&nbsp;– Want to establish yourself as a trusted name in the pet care industry? We offer the potential for you to have a byline and author's bio on one of the leading pet care sites!</li></ul><p><strong>What we need from you</strong></p><p><strong>Some experience</strong>&nbsp;(negotiable) – Enthusiasm is far more important than experience, but you should&nbsp;<em>at least</em>&nbsp;have a couple of samples in your portfolio to share with us.</p><ul><li>We prefer writers with a minimum of 3 years writing for online publication, but we’ve hired people fresh out of college without a writing credit to their name.</li><li><strong>Pet industry experience is highly-prized</strong>.</li></ul><p><strong>Native English writing chops</strong>&nbsp;– It’s almost insulting to say this, but you should have polished writing skills and at least a passing familiarity with Grammarly and spellcheck in Word.</p><ul><li>Meanwhile, we like writers who know their stuff AND&nbsp;jump off the page with&nbsp;<strong>personality</strong>&nbsp;and&nbsp;<strong>engagement</strong>. No stodgy, academic writing here. We’re people writing for people.</li><li><strong>Native English-speakers only</strong>. This is non-negotiable. You must also be intimately familiar with writing for a US audience.</li></ul><p><strong>Digital competency</strong> – Nothing fancy, just the usual stuff.</p><ul><li>A PayPal account</li><li>Core competency with MS Word and Google Drive</li></ul><p><strong>It would be awesome if...</strong></p><ul><li>You have access to a camera and possess some basic photography skills (we pay extra for that, of course!)</li><li>You are willing and able to have products shipped to you for hands-on testing and reviewing (free stuff!)</li><li>You own one or more pets you'll be writing about (<strong><em>not</em></strong>&nbsp;a requirement)</li></ul><p><strong>How to apply</strong></p><p>Simply click on the link at the bottom and fill out the form. When you get to the last question, please supply the answer to:&nbsp;<em>What is the longest river on Earth?</em></p><p><strong>What happens next?</strong></p><p>If we want to move forward, we’ll be in touch via email. Earmarked applicants will be invited to a short 10-minute interview (text/voice) on Skype or Zoom. We’ll ask you to complete a <strong>paid trial assignment</strong> (typically 600-1800 words).</p><p>Once the trial is complete, we’ll make a decision. If we decide to work together, the articles will start flowing.</p><p>Just being selected for the trial is an achievement in itself. That means we think you’ve got what it takes. However, competition for these gigs can be fierce.</p><p>Even if we don’t decide to bring you onboard at this time, we’ll keep your application in our database for contact in the future. You might be surprised by how many of our current writers didn’t make the first cut. But they answered when we called back about a month later.</p><p><strong>Don't wait, apply now</strong></p><p>We generally go through the applications as they come in; however, a large number of applicants won't be considered. The bottom line is the sooner you apply, the better your chances of an invitation to interview.</p><p>Thanks for reading. Hope to be working with you soon!</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "v059vMHfTM2V7jMIttsnaw",
    "url": "https://problogger.com/jobs/job/looking-for-bloggers-to-blog-about-blogging/",
    "title": "Looking For Bloggers To Blog About Blogging!",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "ShaneDutka.com",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 1000,
      "maxValue": 1000,
      "info": "",
      "unit": "MONTH",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 1000 /Month"
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:00:00 AM",
    "validThrough": "May 4, 2020 2:00:00 AM",
    "crawled": "Apr 27, 2020 8:06:14 AM",
    "content": "<h3>Looking For Bloggers To Blog About Blogging!</h3><div>Company: ShaneDutka.com</div>Location: Remote<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <div><p><i>About&nbsp;</i><i>ShaneDutka.com</i></p><p>ShaneDutka.com is a website and authoritative resource to learn about blogging. I myself am a former accountant turned successful SEO and blogger. I've personally launched blogs in many unrelated niches having sold 3 of them over the last 12 months and 7 in my portfolio growing right now.</p><p><i>My Goal</i></p><p>Now that I've had a reasonable amount of success as a blogger, my goal is to help empower more people to start and become successful at building blogs and making a living off of them just as I did.</p><p>There's a lot of bad information filled with biased opinions and rehashed advice.&nbsp; My aim is to provide insightful, valuable, and actionable content for aspiring bloggers to learn from.</p><p><i>What I'm Looking For</i></p><p>I'm looking to hire 1-2 writers who can ghostwrite for me and contribute a minimum of 3-4 articles @ 1500-1800 word per post per week (so about 8,000 words per week).</p><p>I may also ask you to create e-books, guides, and write other material to help train up aspiring bloggers.</p><p>This position will start as a freelance part-time gig with room to grow into a more full-time relationship and potential promotion to full editor with attribution on the site.</p><p><i>Our Ideal Candidate</i></p><ul><li>Has had some level of success as a blogger through ranking content on Google search and making money from that content as an affiliate or through display ads</li><li>Can be flexible and adjust to the needs of the business quickly</li><li>Asks questions when they don't understand something</li><li>Can handle critical feedback and adjust accordingly</li><li>Is tech savvy (i.e., understands Google docs, wordpress, etc)</li></ul><p><i>Compensation</i></p><p>My budget is around $1,000 per month for 15 articles per month but negotiable DOE.</p><p><i>Do you need to have blogging</i><i>&nbsp;experience?</i></p><p>Yes, it is required that you have some experience making money with blogs because you will be ghostwriting for me and helping me create content around the website.</p><p><i>How to apply?</i></p><p>Please submit your application within the following Google form: https://forms.gle/NTipyMZSYUeeveYd6</p><p>I move fast in our process and are motivated to fill this position quickly.</p><p>Please include any experience you feel would be relevant for your application.</p></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "M4I_wiK7T3ibKJ6xv08HzA",
    "url": "https://remote.co/job/technical-documentation-writer-2/",
    "title": "Technical Documentation Writer",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=8, go=8, nodejs=1, bigdata-ml=0, ruby=0, apple=5, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "go",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Chainlink - SmartContract Chainlink Limited",
      "sameAs": "https://chain.link/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:42:37 AM",
    "validThrough": "May 4, 2020 2:42:37 AM",
    "crawled": "Apr 27, 2020 3:06:05 AM",
    "content": "<div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p><strong>Job description</strong></p><p>Smart contracts are on track to revolutionize how all agreements work, through an entirely new system of technologically enforced contract guarantees. Chainlink enables next-generation smart contracts that can be written about any/all events in the real world, the details of our approach can be found in our whitepaper. We are well recognized for providing highly secure and reliable blockchain connectivity to the world’s largest enterprises such as Google, Oracle, SWIFT, and many more. This is a unique opportunity to join one of the top companies developing cutting-edge blockchain technology while working closely together with a team of experienced senior developers.</p><p><strong>About this Role</strong></p><p>You’ll work directly with a technical team of senior software engineers, and the company’s founders, to ensure that the usability of the company’s developer tools remains at the highest industry standard. As the company’s lead technical writer, you will be responsible for creating documentation that effectively turns non-blockchain developers into smart contract developers, while also providing experienced smart contract developers with the documentation they’ll use to build next-generation decentralized applications. Your work will be showcased and will be the primary reference for developers integrating with Chainlink.</p><p><strong>Responsibilities</strong></p><ul><li>Create, develop, and design public-facing accessible written content and documentation to enhance the experience for our community of developer</li><li>Communicate across engineering, product and marketing teams and make recommendations regarding the design and implementation of Chainlink’s software</li><li>Design, write, and update user guides, developer documentation, API references, and sample code</li><li>Contribute to tools and processes that make documentation and software development more efficient, scalable, and collaborative</li></ul><p><strong>Job requirements</strong></p><ul><li>Experience with Solidity is required</li><li>Familiarity with JavaScript, Golang, and/or Rust</li><li>Ability to take full ownership of the success of the company’s technical documentation</li><li>Familiarity with web standards, APIs, and other Web 2.0 technologies</li><li>A genuine interest in cryptocurrency, blockchains and other Web 3.0 technologies</li><li>Strong understanding of technical concepts, analytical skills and attention to detail</li><li>Ability to operate independently and take on additional responsibilities as needed</li><li>Experience writing concise technical documentation for high quality developer tools</li><li>Ability to simplify complex technical systems in writing, and visually with diagrams</li><li>Comfort and/or experience with remote work</li></ul><p>This role is location agnostic anywhere in the world. Though we ask that you overlap some working hours with Eastern Standard Time (EST). This role could also be full-time, part-time or contract.</p><p>Chainlink is an Equal Opportunity Employer</p>        </div><div>        <a href='https://careers.chain.link/o/technical-documentation-writer' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6IfmS_NoQWqZ7etGZVleiQ",
    "url": "https://remote.co/job/senior-technical-writer-4/",
    "title": "Senior Technical Writer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=5, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Netlify",
      "sameAs": "https://www.netlify.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:35:15 AM",
    "validThrough": "May 4, 2020 2:35:15 AM",
    "crawled": "Apr 27, 2020 3:06:05 AM",
    "content": "<div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p>at Netlify</p><p><strong>Remote or</strong> San Francisco</p><p><strong>Company Overview</strong></p><p>At Netlify, we’re building a platform to empower web developers to build better, more elaborate web projects than ever before. We’re aiming to change the landscape of modern web development. Netlify currently serves more than 800,000 developers worldwide.</p><p>We recently raised $53M in Series C funding to bring forward the next generation of tooling for a more accessible web. This round was led by the EQT Ventures with participation from existing investors Andreessen Horowitz &amp; Kleiner Perkins. This brings Netlify’s funding raised in total to $98M to date. Other past investors include Bloomberg Beta, Designer Fund, and Tank Hill Ventures, as well as the founders of Figma, GitHub, Slack, and Yelp.</p><p>Netlify is a diverse group of incredible talent from all over the world. We’re ~48% woman or non-binary, and are composed of about half as many nationalities as we are team members.</p><p><strong>About the Position</strong></p><p>Developers love using Netlify to build, deploy, and manage their sites and apps. Documentarians love it, too, as more and more docs-as-code projects move their sites to Netlify—including the Linux Foundation, Docker, Kubernetes, Hugo, Citrix, and Atlassian.</p><p>Inside the company, we’re a small but growing team of about 100, working cross-functionally in a documentation-driven approach to product development. We’re looking for a development-savvy senior technical writer to help write and review documentation, tutorials, and UI copy, striving for clarity, consistency, and correctness across the entire customer experience.</p><p>We’re at a key place in our development, building our Documentation team to support an increasing rate of product additions and enhancements. We’re hoping our next hire will not just expand the team’s bandwidth for documenting new and improved product features but also establish their own focus area over time.</p><p>We’re eager to meet people who are interested in increasing the impact and reach of the Docs team by following their passions and drawing on their particular experience. For example, we could imagine our new senior technical writer establishing data analysis and reporting to help shape the docs roadmap / measure success, working closely with our external partners on mutually beneficial documentation projects, establishing a pairing process with marketing, or driving improvements to our API documentation.</p><p><strong>Key responsibilities:</strong></p><ul><li>Work with the Product and Engineering organization throughout the development process to write and revise documentation for new features. In most cases, a developer will write a first draft or brain dump, and a writer will refine the work.</li><li>Review and edit informative content (documentation revisions, tutorials, support FAQs) written by team members in Support, Developer Experience, and Engineering.</li><li>Contribute to our writing style guide and assist with selecting and implementing linting tools to help automate use of it.</li><li>Work within our recently re-organized information architecture to ensure new and improved docs content is discoverable.</li><li>Work with the Support team to determine common customer pitfalls and write and organize content to help avoid them.</li><li>Iterate and develop docs team processes to improve collaborative efforts.</li><li>As a steward of the Netlify knowledge base, impact new product planning by identifying edge cases and interactions with existing products and features.</li><li>Work with the UX design team to refine the use of customer-facing language in Netlify products.</li></ul><p><strong>Key Skills and Experience:</strong></p><ul><li>Clear, consistent, and correct writing in English.</li><li>Ability to review the writing of others with empathy, attention to detail, and a focus on clear content organization.</li><li>Desire to work within established processes and help make iterative improvements to them.</li><li>An attitude of kind collaboration across teams.</li><li>Basic understanding of web development technologies. For example, can follow a tutorial using a JavaScript build tool and give feedback about the clarity of the explanations as well as whether following the steps actually works.</li><li>Experience with Git and docs-as-code workflows.</li><li>Familiarity with API documentation principles and tools preferred.</li><li>Experience using Netlify is a plus but not required.</li></ul><p><strong>How to Apply</strong></p><p>Not sure you meet 100% of our qualifications? Please apply anyway!</p><p><strong>About Netlify</strong></p><p>Of everything we’ve ever built at Netlify, we are most proud of our team.</p><p>We believe that empowered, engaged colleagues do their best work. We’ll be giving you the tools you need to succeed and looking to you for suggestions to improve not just in your daily job, but every aspect of building a company. Whether you work from our main office in San Francisco or you are a remote employee, we’ll be working together a lot—pairing, collaborating, debating, and learning. We want you to succeed! About 60% of the company are remote across the globe, the rest are in our HQ in San Francisco.</p>        </div><div>        <a href='https://boards.greenhouse.io/netlify/jobs/4596820002' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "srrGmeZTR2aM89BtTqrzUg",
    "url": "https://jobmote.com/job/4669154/healthcare-technical-writer-telecommute-burnsville/",
    "title": "Healthcare Technical Writer - telecommute (Burnsville)",
    "tags": [
      "DBG:surround``3N(telecommut, posit) NOT fulltim",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UnitedHealth Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:24:04 AM",
    "validThrough": "Apr 30, 2020 2:24:04 AM",
    "crawled": "Apr 27, 2020 3:05:13 AM",
    "content": "<div><p>This position involves working collaboratively with a team supporting Optum State Government technologies and projects. The Technical Writer must be able to research and create documentation in a variety of formats, including online help, SharePoint, MS Word, MS Excel, Visio, and PDF. The teams objectives include creating documentation and content that will best support deployment and usability of the products/applications supporting Optum State Government contracts. </p>   <p>Youll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. </p><p><br></p>  <b>Primary Responsibilities: </b> <ul><li>Member of a technical writing team, responsible for creating documentation for a MMIS and health benefits administration application </li><li>Documentation may include online help, Visio diagrams, installation instructions, training materials, user manuals, and other artifacts as necessary </li><li>Receives and/or gathers information from technical staff and writes documentation in a clear and concise style, following design and style guides </li><li>Conducts research and ensures the use of proper technical terminology </li><li>Translates technical information into clear, readable documents for technical and non-technical users </li><li>Ensures consistency, clarity, and quality in and across all types of documentation </li><li>Engages in formatting, editing, and quality assurance on own work and the work of others</li></ul><p><br></p><p></p><p>Youll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.<br> <br></p><p></p><p><br></p><p><br></p><p><br></p><br><b>Required Qualifications:</b> <ul><li>5+ years of technical writing and end-user documentation experience, preferably for business software </li><li>2+ years of demonstrated writing proficiency for multiple audiences and in multiple modes (online help, user guides, job aids, etc.) </li><li>Healthcare experience with strong preference to MMIS/Claims systems</li><li>Advanced Microsoft Word and Visio (must be able to edit, create system flows, diagrams without any assistance)</li><li>Telecommute</li></ul> UnitedHealth Group is a Fortune 6 company with all the resources you'd expect from the largest networks of physicians, hospitals, health facilities and caregivers in the United States and more than 125 other countries. Join us and be inspired to do <b>your life's best work.SM</b><br><br><b>Careers with Optum.</b> Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world?s large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do <b>your life's best work.SM</b><p><br></p><p>*AllTelecommuters will be required to adhere to UnitedHealth Groups TelecommuterPolicy.</p><p><br></p><p></p><br>Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.<br>UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.<p></p><p><br></p><p><br></p><p><br></p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "H9NHXxopR9CPhUc2hzQMuQ",
    "url": "https://problogger.com/jobs/job/experienced-romance-writers-wanted-2/",
    "title": "Experienced Romance Writers Wanted",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "HotGhostWriter Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 2:00:00 AM",
    "validThrough": "Apr 30, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Experienced Romance Writers Wanted</h3><div>Company: HotGhostWriter Ltd.</div>Location: Work from Anywhere<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><strong>Do you have experience writing paranormal, Christian, and contemporary romance? Are you eager to put that expertise to good use and earn a consistent income?</strong><br><strong>If you answered yes, we'd love to hear from you!</strong></p><p>*We are now accepting romance writers outside of the US and Canada locations</p><p>Job Overview<br>We are currently seeking experienced paranormal, Christian, and contemporary romance writers to expand our fiction writing team. Please note, we are seeking writers with at least six months of paranormal, Christian, and contemporary romance writing experience.</p><p>The Company<br>Our mission is to deliver a great experience to our clients by providing them with quality books from a highly professional writer. We're a fast-paced, growing ghostwriting service that can provide a steady stream of exciting projects for the right candidates. Each project will be assigned to you, meaning you’ll never have to bid for work.</p><p>What You Get:<br>- Our current rate is $15 USD per 1,000 words. Our projects range from 20k up to 150k words.<br>- Our busier writers dedicate time and effort to produce high quality and earn $2,000+ a month.<br>- Assigned projects without bidding, creating proposals, and no fees. If you produce high quality, we keep you busy.<br>- Dedicated project managers and HR<br>- Additional pay for outline and character development</p><p>What We Need:<br>- You write memorable romance stories with appropriate levels of tension and suspense, believable dialogue, and outstanding character development.<br>- You understand, as a ghostwriter, that you will receive no official credit for the completed work.<br>- You can write steamy and erotic heat levels.<br>- You are a native English writer and speaker. All writing must be in US English.<br>- You are a deadline-oriented freelance worker with a 3k-word-per-day pace.<br>- You have traditional or self-publishing experience, or you have ghostwritten in paranormal and contemporary romance themes/tropes.<br>- You understand what readers want, and you can write to market.<br>- You have long-term availability.<br>- You are available throughout the day to respond to team members and client messages on our platform.<br>- You are reliable, well-spoken, open to constructive criticism and a good communicator.</p><p>Important: Please submit three relevant samples, each at least 1k words, of paranormal, Christian, and contemporary romance.</p><p>How To Apply?<br>Click the following link to access our application form and upload your writing samples: https://airtable.com/shrk4Ug4RngCp1fC3<br>Provide one sample which conveys intimacy/a romantic moment between the characters.</p><p>Due to the number of applications received, please allow at least 14 days before contacting recruitment for a status update.</p><p>Best of luck!<br>Hotghostwriter Recruitment Department<br>Hotghostwriter.com</p><p>P.S. Have any questions?<br>Contact us: <span>[email&nbsp;protected]</span><br>(Please do not attempt to apply via email, you will be referred to the application form above)</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "eQajX8LbQh69Wt3aR-yJlg",
    "url": "https://problogger.com/jobs/job/content-writer-for-best-lists-and-product-roundups-2/",
    "title": "Content Writer for Best Lists and Product Roundups",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:android/java/4",
      "DBG_TECH1:k/t/w:android/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Android Authority",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 14, 2020 2:00:00 AM",
    "validThrough": "Apr 21, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Content Writer for Best Lists and Product Roundups</h3><div>Company: Android Authority</div>Location: Anywhere<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><b>Android Authority</b><span> is looking for freelance writers to produce a large number of best lists, deal hubs, and other content that is designed with affiliate sales and revenue in mind. Most of the posts are between 500-1000 words, depending on the topic. This includes content like “best phone deals”, “best accessories for your mobile phone”, and more.</span></p><p><span>Actual advisory on what products and deals to put into the posts will be provided by the Android Authority team, though a general interest and knowledge in technology is still important.&nbsp;</span></p><p><span>Particularly writers interested and knowledgeable in Android, computing, Chromebooks, privacy, finance, and streaming services are of major interest to us. We’re branching out all the time, so if you have any special technology-related interests, please let us know while applying.</span></p><p><span>We are looking for a writer that can balance speed and quality in their writing. We need applicants to be able to handle at least five posts a week, but we are giving preference to applicants who have the availability to write much more. For the right candidate, there is potentially a near-endless supply of topics available for writing.</span></p><p><span>We pay at a starting rate of $.03/word but scale upward based on previous experience and skill. The ideal candidate is expected to be able to:</span></p><ul><li><span>Consistently produce error-free content on a daily basis (we will require poorly written or inaccurate articles to be fixed before we’ll accept the submission)</span></li><li><span>Choose imagery from relevant articles or from our stock image libraries</span></li><li><span>Correctly categorize and tag content</span></li><li><span>Work under an editor who will oversee and approve all content</span></li><li><span>Command a mastery of the English language and adhere to site style conventions</span></li><li><span>Be flexible and communicative about availabilities</span></li></ul><p><span>This is a work-from-anywhere position. Our team is global and comes from a wide variety of backgrounds, but candidates must be able to write in clear, adept American English.</span></p><p><span>We also give preference to writers who have the following skills:</span></p><ul><li><span>General SEO knowledge and how to incorporate SEO into articles</span></li><li><span>Experience writing sales content is a major plus</span></li></ul><p><span>This is not a word-mill job. It is entry-level, but we have a history of promoting capable writers from within, and we compensate competitively within the industry.&nbsp;</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Nsw1AeHHRxCPrqExDy9dOQ",
    "url": "https://problogger.com/jobs/job/editor-15/",
    "title": "Editor",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Conservative Institute, LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 500,
      "maxValue": 1000,
      "info": "",
      "unit": "WEEK",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 500 - 1000 /Week"
    },
    "employmentType": "UNSET",
    "published": "Apr 9, 2020 2:00:00 AM",
    "validThrough": "Apr 16, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Editor</h3><div>Company: Conservative Institute, LLC</div>Location: Content Writers for Fast-Growing Tech Site &nbsp; Remote Location - Global new: Content Editor for Fast-Growing Tech Site &nbsp; Global - Remote Location new: Remote<br>Remote Location - Global<br>April 23, 2020<br>Global - Remote Location<br>April 23, 2020<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p>Conservative Institute is accepting applications for an editors position.</p><p>As an editor, you'll be in charge of ensuring content quality. At CI, we pride ourselves on our rigorous fact-checking. Editors work with writers and headliners to ensure that our content is high quality and high accuracy.</p><p>Requirements:</p><p>Must be a good writer.<br>Must be detail-oriented<br>Must be conservative. Experience in conservative media or politics strongly preferred.</p><p>Pay: $500-$1000 per week based on experience.</p><p>To apply: submit a resume and writing sample (news article preferred) to <span>[email&nbsp;protected]</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AODuVwGhQ8u3BiPRzxJxyw",
    "url": "https://problogger.com/jobs/job/seeking-a-ghost-writer-with-5-yrs-of-pharma-mktg-experience-in-people-based-marketing-pbm/",
    "title": "Seeking a ghost writer with 5+ Yrs of Pharma Mktg Experience in People Based Marketing (PBM)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Bashert LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 2:00:00 AM",
    "validThrough": "Apr 30, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Seeking a ghost writer with 5+ Yrs of Pharma Mktg Experience in People Based Marketing (PBM)</h3><div>Company: Bashert LLC</div>Location: Remote - U.S.<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <p>I am seeking a ghost writer with Life Sciences (pharmaceutical marketing experience) to help write blog posts, articles and white papers on People Based Marketing.</p><p>The demands of my current role do not allow adequate time to craft content that can be distributed into the marketplace. As such, I am looking for an individual that can help translate my unique perspective on People Based Marketing into copy.</p><p>The purpose of your work will encompass the following areas:</p><ul><li>Help position my POV on PBM as a thought leader in the health marketing space by illustrating how my POV can address health marketers pain points and how my company can solve those problems.</li><li>Convey my perspective into a unique offering for the audience - expertise, POV, data, etc – that not only explains how I do something, but why.</li><li>Help provide a fresh perspective on important issue, (a pain point) and put them into the marketplace.</li><li>People based marketing is a key differentiator as such that narrative has to be disseminated into the marketplace.</li></ul><p>The term for this assignment is one year. However, there is the opportunity for an extension. Here is a breakdown of the need:</p><p>Blogs: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6 posts ~500 words every other month</p><p>Articles: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 total ~2,500 words 2x a year</p><p>White Papers:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 total ~6,000 words</p><p>To qualify:</p><ul><li>English is your native language</li><li>Writing professionally for at least 10 years</li><li>Have 5+ years of experience in Pharmaceutical Marketing</li><li>Have agency experience</li><li>Have a strong understanding of PBM, Digital Marketing, Adtech, Martech and or Analytics</li></ul><p>Finally, please send the following items as a part of your application submission:</p><ul><li>A link to either your LinkedIn profile, resume or website</li><li>Links to 3 to 5 related pieces you’ve published elsewhere; preference is to see pieces that are relevant and have social media engagement</li></ul><p>Finally, please note:</p><ul><li>The budget for this assignment as outlined above is $1,400. US</li><li>Only serious inquiries should apply</li><li>I will contact only those that we feel best match the needs of this assignment</li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PhBOJVV2R7u2A0nyQ2wOAQ",
    "url": "https://problogger.com/jobs/job/content-writers-for-fast-growing-tech-site-2/",
    "title": "Content Writers for Fast-Growing Tech Site",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "WizCase",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 2:00:00 AM",
    "validThrough": "Apr 30, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Content Writers for Fast-Growing Tech Site</h3><div>Company: WizCase</div>Location: Remote Location - Global: Remote Location - Global<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><span>Hi everyone! I’m the recruitment</span><span>&nbsp;manager</span><span>&nbsp;for a performance marketing company in the cybersecurity niche and we’re stepping up our content game. I’m currently </span><b>looking for the best content writers out there to join our team</b><span> and help us create content that converts.</span></p><p><span>This is a </span><b>100% remote position</b><span>, so you can work from anywhere, any timezone.&nbsp;</span></p><p><span>We believe in writers taking ownership of their work from start to finish to create a final product — a published article. </span><b>You’re our ideal content writer if you</b><span>:</span></p><ul><li><span>Want articles with your byline to be on Google’s page 1 results — and you’re not afraid to work for it.</span></li><li><span>Are a fast learner and never make the same mistakes twice.</span></li><li><span>Can follow guidelines to a T.</span></li><li><span>Can perform competitor research and analysis to understand what you need to do to make your article Google’s favorite piece of content.</span></li><li><span>Write engagingly and persuasively to create high-converting articles.</span></li><li><span>Source and/or create images relevant to your article.</span></li><li><span>Are able to work with an editor and consistently create high-quality content that converts.&nbsp;</span></li><li><span>Know how to upload finished articles on WordPress.</span></li><li><span>Want to improve your skills in creating content that converts.</span></li><li><span>Must have at least 20 hours available per week to invest in your own growth.</span></li><li><span>Are looking for a long-term remote job where you can grow, excel, and progress in.</span></li><li><span>Live and breathe digital content.</span></li><li><span>Take on learning curves like a champ and use them as an opportunity for growth.</span></li><li><span>Are a team player.</span></li></ul><p><span>You'll be writing blog posts, software reviews, and comparisons, with some long-form content thrown in from time to time. You'll be working with an editor to create articles that meet our standards. It is important that you’re receptive to constructive feedback, and have a drive to continuously learn and better your writing.</span></p><p><b>100% of writers who join our team have never experienced our style of content writing.</b><span> Hence, there will be an intensive training period with lots of investment in your development. Junior writers will start at a competitive rate during the training period, with increases as KPIs are met.&nbsp;</span></p><p><span>We're all about long-term relationships. If things work out between us, you can expect a steady income as well as progression opportunities. We provide clear instructions and guidance, and we always pay on time.&nbsp;</span></p><p><b>If you’re interested in this role, <a href='https://form.jotform.me/92424927558468' rel='nofollow'>please apply here</a></b>.</p><p><span>If you get shortlisted, you’ll be contacted to do a written test before a final decision is made. Unsuccessful applicants will not be notified.</span></p><p><span>I look forward to receiving your application soon! Good luck!</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "mMWqvoF0RBWd-SCzEscv-A",
    "url": "https://problogger.com/jobs/job/content-editor-for-fast-growing-tech-site/",
    "title": "Content Editor for Fast-Growing Tech Site",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "WizCase",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 2:00:00 AM",
    "validThrough": "Apr 30, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Content Editor for Fast-Growing Tech Site</h3><div>Company: WizCase</div>Location: Global - Remote Location: Global - Remote Location<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><span>We are a performance marketing company in the cybersecurity niche.&nbsp; We are stepping up our content game and are</span><b>&nbsp;looking for the best content editors</b><span> out there to join our team and help us create content that converts.</span><b> &nbsp; </b><span>This is a </span><b>100% remote position</b><span>, so you can work from anywhere, any timezone.</span></p><p><b>You’re our ideal content editor if you:</b></p><ul><li><span>Are hungry to learn, open-minded, and highly adaptable.</span></li><li><span>Have exceptional English language skills.</span></li><li><span>Are already an amazing content writer who can adapt to different styles and guidelines.</span></li><li><span>Understand that content editing is more than just fixing spelling, grammar, and the occasional typo. It is about looking at a whole content piece and being able to work with all its elements (e.g. metadata, images, formatting etc.).</span></li><li><span>Have a good understanding of what makes an article convert and rank on Google.</span></li><li><span>Have a knack for research and already be an expert at spotting factual errors and inaccuracies.</span></li><li><span>Have great communication skills to provide feedback and guidance to your writers.</span></li><li><span>Want to improve your skills in creating content that converts.</span></li><li><span>Must have at least 20 hours available per week to invest in your own growth.</span></li><li><span>Be looking for a long-term remote job that you can grow, excel, and progress in.</span></li><li><span>Live and breathe digital content.</span></li><li><span>Take on learning curves like a champ and use them as an opportunity for growth.</span></li><li><span>Are a fast learner and never make the same mistakes twice.</span></li><li><span>Are a team-player.</span></li></ul><p><span>You'll be working with blog posts, reviews, with some long-form content thrown in from time to time.&nbsp;</span></p><p><b>100% of editors who join our team have never experienced our style of content.</b><span> Hence, there will be an intensive training period with lots of investment in your development. Junior editors will start at a competitive rate during the training period, with increases as KPIs are met.</span></p><p><span>We're all about long-term relationships. If things work out between us, you can expect a steady income plus progression opportunities. We provide clear instructions and guidance, and we always pay on time.</span></p><p><strong>If you’re interested in this role, <a href='https://form.jotform.me/92323643062451' rel='nofollow'>please apply here</a>.</strong></p><p><span>If you get shortlisted, you’ll be contacted to do a written test before a final decision is made. Unsuccessful applicants will not be notified.</span></p><p><span>I look forward to receiving your applications soon!</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "g45di9cIT8WRIAdktRBbfA",
    "url": "https://problogger.com/jobs/job/love-dogs-write-about-training-dog-care/",
    "title": "Love Dogs? Write About Training & Dog Care!",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "K9 of Mine",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 22, 2020 2:00:00 AM",
    "validThrough": "Apr 29, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Love Dogs? Write About Training &amp; Dog Care!</h3><div>Company: K9 of Mine</div>Location: Remote<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><strong>Are you a dog trainer or work in the pet industry? Or maybe you’re just a dog lover who has content skills?</strong>&nbsp;We want to hire you!</p><p>At K9 of Mine, we’re dedicated to helping owners better care for their four-legged friends through epic, high-quality content on every dog-related topic under the sun.</p><p>We're looking for writers (and YouTube-ers as well) who can help us expand our editorial section!</p><p>Our writers cover a variety of article topics, from reviewing the best dog gear products to answering behavior questions. If you’re a skilled writer who owns a dog (or even just loves dogs), this could be for you!</p><p><strong>Benefits:</strong></p><ul><li><strong>Flexible contract work</strong>&nbsp;– work whenever you want from home, with weekly deadlines. New writers can expect 1-2 articles per week, with potential for more assignments as well as flexible deadlines.</li><li><strong>Competitive freelance rate</strong> – Pay is .04 – .06 cents per word depending on experience, qualifications, and expertise (certified trainers, groomers, or other industry specialists are on the higher end of that scale). Our articles are generally 1.5 – 2.5k words long, so you’re looking at $50 – $150 per article.</li><li><strong>Work with an experienced remote team</strong>, with editors who can help you improve your craft.</li><li><strong>Extensive writing guidelines</strong>, examples, and templates will be provided.</li><li><strong>Get a killer byline</strong>&nbsp;– Work for one of the top dog care sites on the web, with your byline included on all your articles.</li></ul><p><strong>Requirements:</strong></p><ul><li>3+ years writing experience, with preference to those with experience writing online content</li><li>Must have writing samples - ideally related to dogs or pets - that you can send</li><li>Native English speaker</li><li>Personality – we’re aiming for an informative but friendly tone. Let your voice shine, we want to see YOU in your writing!</li><li>Experience working in the pet industry is preferred but not required</li></ul><p><strong>Types of Articles You’ll Write:</strong></p><ul><li><strong>Training Guides</strong> (show owners how to train their dogs and teach them valuable skills)</li><li><strong>Product Round-ups</strong> (review several products in a given category - treat pouches, for example - detailing the key features and the benefits/disadvantages of each product)</li><li><strong>How-To Guides&nbsp;</strong>(Explaining to readers how to trim their dog’s nails, wash their dog’s fur, etc).</li><li><strong>Breed Guides</strong>&nbsp;(Discuss different types of Dachshunds, what colors Labrador Retrievers come in, etc)</li><li>&amp; More!</li></ul><p>Each article we publish goes through a rigorous editorial process where we check claims for accuracy. Our readers trust us with their safety of their four-legged pals, and we take that responsibility seriously. Please keep this in mind, as extensive edits are quite normal in the early months as we ensure you’re up to snuff!</p><p>Feel free to check out the site to get a better sense of the quality we are looking for. Also note that writers are not required to do any web formatting or design.</p><p><strong>How to Apply:</strong></p><ul><li><strong>Send an email to ben(at)k9ofmine(dot)com</strong> with your name, pet-related experience, any writing or video background you have, and provide at least 2 samples of relevant articles you have written or published in your application.</li><li><strong>We’ll review your application.</strong> Once we’ve received your application, if we decide to move forward, you’ll get a paid test assignment to complete.</li><li><strong>We’ll make our final selection.</strong>&nbsp;Based on how the paid test assignment goes, we’ll choose to add you to the team! Even if you don’t make the cut this time, we’ll keep your info on hand if we expand further in the future.</li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XaTvJhJqTHqlEzBf5jTJJQ",
    "url": "https://problogger.com/jobs/job/content-writer-for-blog-2/",
    "title": "Content Writer for Blog",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "98parties",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 22, 2020 2:00:00 AM",
    "validThrough": "Apr 29, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Content Writer for Blog</h3><div>Company: 98parties</div>Location: Anywhere<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <p>We are a blog with a focus on the party/occasions niche. We are looking for freelance writers to produce informative articles such as best lists, round up reviews and informative content. This includes content like “best baby shower gifts” etc.</p><p>We are looking for a writer that has a real passion or interest in the special occasions market.</p><p>A writer that can balance speed and quality would be ideal. Producing 2-3 articles per week will be expected though this may fluctuate over time.</p><p>Article sizes will range at around 1500 words approximately.</p><p>We will pay competitive rates based on writing experience, topic knowledge and overall quality.</p><p>Your skills would include:</p><ul><li>Consistently produce error-free content</li><li>Be flexible and communicative about availabilities</li><li>This is a work-from-anywhere position. Candidates must be able to write in clear, adept American English.</li></ul><p>We also give preference to writers who have the following skills:</p><ul><li>General SEO knowledge and how to incorporate SEO into articles</li><li>Experience writing sales content is a major plus</li></ul><p>&nbsp;</p><p>If you want to apply, please send:</p><ul><li>More about yourself; what topics you like to cover</li><li>Samples of previous writing work</li><li>Your per word rate</li></ul><p>&nbsp;</p><p>Subject Should Include &quot;ProBlogger Application&quot;</p><p>Please send applications to&nbsp;<span>[email&nbsp;protected]</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XqWGYJqXQcKvmE8yDLWNdg",
    "url": "https://problogger.com/jobs/job/freelance-writer-94/",
    "title": "Freelance Writer",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Angry BBQ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 18, 2020 2:00:00 AM",
    "validThrough": "Apr 25, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Freelance Writer</h3><div>Company: Angry BBQ</div>Location: Anywhere<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <p><span>We are a blog/affiliate company with a focus on bbq, bbq recipes, gear reviews and informative content. We are looking for freelance writers to produce articles of best lists, round up reviews and other content. This includes content like “best pellet smoker” etc.&nbsp;</span></p><p><span>We will provide guidance and overview of the actual items to be reviewed. However, we are looking for a writer that has a real passion or interest in this bbq field.&nbsp;</span></p><p><span>A writer that can balance speed and quality would be ideal. Producing 4-6 articles per week will be expected though this may fluctuate over time. Article sizes will range from 1500-2500 words.&nbsp;</span></p><p><span>We will pay competitive rates based on writing experience, topic knowledge and overall quality.&nbsp;</span></p><p><span>Your skills would include:&nbsp;</span></p><ul><li><span>Consistently produce error-free content</span></li><li><span>Choose imagery from relevant articles or from our deposit photo libraries</span></li><li><span>Correctly categorize and tag content</span></li><li><span>Work with site management team who will oversee and approve all content</span></li><li><span>Command a mastery of the English language and adhere to site style conventions (templates provided)</span></li><li><span>Be flexible and communicative about availabilities</span></li></ul><p><span>This is a work-from-anywhere position. Candidates must be able to write in clear, adept American English.</span></p><p><span>We also give preference to writers who have the following skills:</span></p><ul><li><span>General SEO knowledge and how to incorporate SEO into articles</span></li><li><span>Experience writing sales content is a major plus</span></li></ul><p><span>If you want to apply, please send:</span></p><ul><li><span>More about yourself; what topics you like to cover</span></li><li><span>Minimum of three sample articles</span></li><li><span>Your per word rate</span></li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UI3cMDZ1SqyCB02-H1L-sw",
    "url": "https://problogger.com/jobs/job/writer-for-archery-and-bow-hunting-remote/",
    "title": "Writer for Archery and Bow Hunting (Remote)",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "NextLuxury",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 14, 2020 2:00:00 AM",
    "validThrough": "Apr 21, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Writer for Archery and Bow Hunting (Remote)</h3><div>Company: NextLuxury</div>Location: Las Vegas<br>Job Type: Full-time<div>  <h5>Description</h5>  <div>                    <p><b>Who are we?</b></p><p>We are an online magazine with over 3000 articles focused on Archery and Bow Hunting.</p><p>We are looking for an experienced and creative writer to join our team as an external associate. This is can be a part or full-time position depending on availability.</p><p><b>So is this job for you?</b></p><p>If you are up-to-date with the Archery and Bow hunting trends and you love writing, then this opportunity is for you! In this role, you would write blog posts about men's tattoo related topics.</p><p><b>What will you write about?</b></p><p>Potential topics could be:</p><p>Best Recurve Bow Reviews</p><p>Best Crossbows in 2020</p><p>Best Arrow rest for hunting</p><p>etc etc</p><p><b>What are our requirements?</b></p><p>For this role, it is crucial to have perfect grammar and fluency in English as well as familiarity with writing content that is SEO-friendly.</p><p>Other requirements:</p><ul><li>Must have at least 2 years of writing experience</li><li>Must work or design your home yourself</li><li>Must only write fresh and exclusive content</li><li>Quick turnaround time</li><li>Ability to submit work on committed schedule</li><li>A certain level of self-sufficiency</li></ul><p><b>What are we offering?</b></p><ul><li>You will join a young and exciting team of writers that all share your passion for Outdoors and Hunting</li><li>You will be part of a very fast-paced and growing company with a bright future and big plans!</li><li>You will be able to work on your own schedule and can fully work remotely from home or even while traveling</li><li>High workload at all times and it is up to you if you want to work part or full-time. There is always something new happening in the world of fashion so there is no shortage of topics to write about!</li></ul><p><b>+++++ How to apply?? ++++++</b></p><p><b>IMPORTANT:</b></p><p>Follow the application link and submit all the answers in the Google Form. Please take your time, especially for the test tasks, it is the most important factor in how we evaluate your skill level.</p><p>https://docs.google.com/forms/d/16L2LeGvsweFr9dz3Tc-w5zwhrLpNHPym_1iU7ayxuyY/</p>          </div>                <h5>Application Instructions</h5>    <div>                            only apply via this link:<br>https://docs.google.com/forms/d/16L2LeGvsweFr9dz3Tc-w5zwhrLpNHPym_1iU7ayxuyY/                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TEqm3Xa8TGS3Tp0Ccc18og",
    "url": "https://problogger.com/jobs/job/writer-for-barber-and-mens-hairstyle-content/",
    "title": "Writer for Barber and Mens Hairstyle Content",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "NextLuxury",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 14, 2020 2:00:00 AM",
    "validThrough": "Apr 21, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Writer for Barber and Mens Hairstyle Content</h3><div>Company: NextLuxury</div>Location: Las Vegas<br>Job Type: Full-time<div>  <h5>Description</h5>  <div>                    <p><b>Who are we?</b></p><p>We are an online magazine with over 3000 articles focused on Men's Hairstyles and Grooming.</p><p>We are looking for an experienced and creative writer to join our team as an external associate. This is can be a part or full-time position depending on availability.</p><p><b>So is this job for you?</b></p><p>If you are up-to-date with the latest barber and grooming trends and you love writing, then this opportunity is for you! In this role, you would write blog posts about men's tattoo related topics.</p><p><b>What will you write about?</b></p><p>Potential topics could be:</p><p>Best Bald Fade Haircuts</p><p>50 Best Short Haircuts for Men</p><p>How to style a Mohawk</p><p>etc etc</p><p><b>What are our requirements?</b></p><p>For this role, it is crucial to have perfect grammar and fluency in English as well as familiarity with writing content that is SEO-friendly.</p><p>Other requirements:</p><ul><li>Must have at least 2 years of writing experience</li><li>Must work or design your home yourself</li><li>Must only write fresh and exclusive content</li><li>Quick turnaround time</li><li>Ability to submit work on committed schedule</li><li>A certain level of self-sufficiency</li></ul><p><b>What are we offering?</b></p><ul><li>You will join a young and exciting team of writers that all share your passion for Fashion Home and Style.</li><li>You will be part of a very fast-paced and growing company with a bright future and big plans!</li><li>You will be able to work on your own schedule and can fully work remotely from home or even while traveling</li><li>High workload at all times and it is up to you if you want to work part or full-time. There is always something new happening in the world of fashion so there is no shortage of topics to write about!</li></ul><p><b>+++++ How to apply?? ++++++</b></p><p><b>IMPORTANT:</b></p><p>Follow the application link and submit all the answers in the Google Form. Please take your time, especially for the test tasks, it is the most important factor in how we evaluate your skill level.</p><p>https://docs.google.com/forms/d/e/1FAIpQLSd73qZXIAYeGYNDDO5cpGsT4Rjf9UK-QQA7_ft4ZyYQR6M-MQ/viewform</p>          </div>                <h5>Application Instructions</h5>    <div>                            apply only here: https://docs.google.com/forms/d/e/1FAIpQLSd73qZXIAYeGYNDDO5cpGsT4Rjf9UK-QQA7_ft4ZyYQR6M-MQ/viewform                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7qvnRUVyTyav0I_Oy4zVUg",
    "url": "https://problogger.com/jobs/job/50-essay-writers-needed-remote-weekly-pay-6/",
    "title": "50 Essay Writers Needed - Remote - Weekly Pay",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "WritePal Global Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 14, 2020 2:00:00 AM",
    "validThrough": "Apr 21, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>50 Essay Writers Needed – Remote – Weekly Pay</h3><div>Company: WritePal Global Inc.</div>Location: Anywhere<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <p>Hello,</p><p>We are in need of about 50 essay writers to add to the team at myessaywriter.net.</p><p>This is reliable work that averages about $21/hour. This assumes you are a savvy writer who can write about three double-spaced pages per hour. Each double-spaced page is paid $7.</p><p>Please apply only if you are familiar with APA and MLA citation styles. Please send an APA or MLA sample and a resume.</p><p>This is reliable work that can be whatever you make of it. You can work full time, part time, or on a casual basis. You decide your own hours and you work from home.</p><p>If you are added to the team, you have access to an article queuing system where assignments are immediately sent. Once you claim it, the assignment will be added to your account.</p><p>Payment is made on a weekly basis via PayPal.</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vCxIDDmARKO6H4XyfNHzYw",
    "url": "https://problogger.com/jobs/job/experienced-online-news-writers-wanted-celebrities-entertainment-politics/",
    "title": "Experienced Online News Writers Wanted - Celebrities, Entertainment, Politics",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "The Inquisitr",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 10, 2020 2:00:00 AM",
    "validThrough": "Apr 17, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Experienced Online News Writers Wanted – Celebrities, Entertainment, Politics</h3><div>Company: The Inquisitr</div>Location: Anywhere<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <div><p>The Inquisitr is looking for writers with experience covering celebrity and entertainment news online.</p><p>If you enjoy writing about television shows such as:<br>-90 Day Fiance<br>-MTV's The Challenge<br>-Teen Mom<br>-The Masked Singer<br>-The Voice<br>-The Walking Dead</p><p>Please apply!</p></div><p>We are also looking for writers to cover politics.</p><div><p>Applicants must speak English fluently and be able to write a minimum of 25, 400-word articles per week (Monday - Sunday).</p><p>We are looking for serious applicants who have a working knowledge of WordPress, photo-editing skills, a Skype account, and have a minimum of one year of experience working in online news.</p><p>We offer:<br>-Work from home (remote) positions<br>-Weekly pay<br>-Flexible schedules</p></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hRgek1gYQeKZrJ8Pyb7sHg",
    "url": "https://remote.co/job/copy-editor-writer-proofreader/",
    "title": "Copy editor – Writer – Proofreader",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "United Nations Development Programme - UNDP",
      "sameAs": "https://www.undp.org/content/undp/en/home/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 7:14:39 PM",
    "validThrough": "May 1, 2020 7:14:39 PM",
    "crawled": "Apr 24, 2020 8:10:08 PM",
    "content": "<div><span><i></i> Remote</span>         | <span> Freelance </span> | <span> International </span></div><div>            <ul><li>Location: Work from anywhere&nbsp;–&nbsp;Home based</li><li>Type of Contract:&nbsp;Individual Contract</li></ul><p><strong>Background</strong></p><p>UNDP is the knowledge frontier organization for sustainable development in the UN Development System and serves as the integrator for collective action to realize the Sustainable Development Goals (SDGs). UNDP’s policy work carried out at HQ, Regional and Country Office levels, forms a contiguous spectrum of deep local knowledge to cutting-edge global perspectives and advocacy. In this context, UNDP invests in the Global Policy Network (GPN), a network of field-based and global technical expertise across a wide range of knowledge domains and in support of the signature solutions and organizational capabilities envisioned in the Strategic Plan.</p><p>Within the GPN, the Bureau for Policy and Programme Support (BPPS) has the responsibility for developing all relevant policy and guidance to support the results of UNDP’s Strategic Plan. BPPS’s staff provides technical advice to Country Offices, advocates for UNDP corporate messages, represents UNDP at multi-stakeholder fora including public-private dialogues, government and civil society dialogues, and engages in UN inter-agency coordination in specific thematic areas. BPPS works closely with UNDP’s Crisis Bureau (CB) to support emergency and crisis response. BPPS ensures that issues of risk are fully integrated into UNDP’s development programmes. BPPS assists UNDP and partners to achieve higher quality development results through an integrated approach that links results-based management and performance monitoring with more effective and new ways of working. BPPS supports UNDP and partners to be more innovative, knowledge and data driven including in its programme support efforts.”</p><p>UNDP is a founding cosponsor of the Joint UN Programme on HIV/AIDS (UNAIDS), a partner of the Global Fund to Fight AIDS, TB and Malaria, and a co-sponsor of several other international health partnerships. UNDP’s work on HIV, health and development, as described in the HIV, Health and Development Strategy 2016-2021: Connecting the Dots, leverages UNDP’s core strengths and mandates in human development, governance and capacity development to complement the efforts of specialist health-focused UN agencies. UNDP delivers three types of support to countries in HIV, health and development.</p><p>First, UNDP helps countries to mainstream attention to HIV and health into action on gender, poverty and the broader effort to achieve and sustain the Sustainable Development Goals. For example, UNDP works with countries to understand the social and economic factors that play a crucial role in driving health and disease, and to respond to such dynamics with appropriate policies and programmes outside the health sector. UNDP also promotes specific action on the needs and rights of women and girls as they relate to HIV.</p><p>Second, UNDP works with partners to address the interactions between governance, human rights and health responses. Sometimes this is done through focused or specialized programmes, such as promoting attention to the role of the law and legal environments in facilitating stronger HIV responses, including the use of flexibilities in intellectual property law to lower the cost of drugs and diagnostics. UNDP also works to empower and include marginalized populations who are disproportionately affected by HIV, such as sex workers, men who have sex with men and people living with HIV. Beyond these focused efforts, UNDP plays a key role in ensuring attention to HIV and health within broader governance and rights initiatives, including support to municipal action on SDGs, sustainable responses for Health and HIV such as improving sustainability of AIDS financing, sustainable health procurement, strengthening of national human rights institutions and increasing access to justice for key populations.</p><p>Third, as a trusted, long-term partner with extensive operational experience, UNDP supports countries in effective implementation of complex, multilateral and multisectoral health projects, while simultaneously investing in capacity development so that national and local partners can assume these responsibilities over time. The UNDP/Global Fund partnership is an important part of this work, facilitating access to resources for action on SDG 3 by countries that face constraints in directly receiving and managing such funding. UNDP partners with countries in crisis/post-crisis situations, those with weak institutional capacity or governance challenges, and countries under sanctions. When requested, UNDP acts as temporary Principal Recipient in these settings, working with national partners and the Global Fund to improve management, implementation and oversight of Global Fund grants, while simultaneously developing national capacity to be able to assume the Principal Recipient role over time.</p><p><strong>Objective of the assignment</strong></p><p>The consultant will provide high quality copyediting of UNDP’s expert policy and research outputs on rights, key populations and treatment access.</p><p>The Consultant will report to the HHD Manager: Rights, Key Populations and Treatment Access (Supervisor), and will work in close collaboration with the team focal points on human rights, law and gender; key populations, LGBTI and rights; and health technology, innovation and access.</p><p><strong>Duties and Responsibilities</strong></p><p>The scope of work will vary depending on the individual assignments but would include one or various of the below tasks:</p><ul><li>Copyediting,</li><li>writing</li><li>proofreading of knowledge products including reports, technical papers, guidance material, contributing papers, briefs, think pieces, dataset;</li><li>Any other related</li></ul><p><strong>Institutional arrangements:</strong></p><ul><li>The overall objective of setting up these Framework Agreements is to facilitate and expedite the process by which UNDP will hire the services of copyeditor/writer/proof-reader once there are specific assignments over the next 3 years;</li><li>Estimated volume of services:&nbsp;maximum of US$90,000 over the 3-year durationof the Framework Agreement;</li><li>UNDP does not warrant that any quantity of services will be purchased during the term of the Framework Agreement as this will depend on forthcoming needs;</li><li>The initial Framework Agreement would be for one year with an option for renewal in subsequent years dependent on demand for services and satisfactory performance evaluation;</li><li>The Framework Agreements to be signed with 3 consultants will be for a fixed all-inclusive daily fee.</li><li>Once the Framework Agreement is signed, if there is a specific assignment, the focal person at UNDP HIV, Health and Development Team would contact the Consultant by email informing them of the assignment specific deliverables, and timeline;</li><li>Assignments will be assigned based on technical scores ,availability and specific expertise for the assignment</li><li>The consultant must advise within 48 hours whether they are available to deliver the requested service;</li><li>Thereafter a Purchase Order will be raised. Financial commitments will only be established each time the services are requested within the scope of the Framework Agreement through the transmitted email and purchase order;</li><li>IC as a Framework agreement is non-exclusive (i.e. it does not prohibit UNDP from entering into another such framework agreement with another individuals or entities);</li><li>The Consultant will be given access to relevant information necessary for execution of the tasks under this assignment;</li><li>The Consultant will be responsible for providing their own working station (i.e. laptop, internet, phone, scanner/printer, etc.) and must have access to a reliable internet connection;</li><li>Payments will be made upon submission of certification of payment form, and acceptance and confirmation by the Supervisor of outputs delivered</li></ul><p><strong>Corporate</strong></p><ul><li>Demonstrates commitment to UNDP’s vision, mission and values;</li><li>Promotes the vision, mission, and strategic goals of UNDP;</li><li>Displays cultural, gender, religion, race, nationality and age sensitivity and adaptability;</li><li>Treats all people fairly without favouritism;</li><li>Fulfils all obligations to gender sensitivity and zero tolerance for sexual harassment.</li></ul><p><strong>Functional</strong></p><p>Development and Operational Effectiveness</p><ul><li>Results-driven and initiative-taking;</li><li>Ability to work under pressure and to meet deadlines;</li><li>Ability to plan and organize work and establish priorities;</li><li>Remains calm and in control even under pressure, and consistently approaches work with energy and a positive, constructive attitude;</li><li>Thoroughly and methodically collects, verifies and records data, demonstrating attention to detail and identifying and correcting errors on own initiative.</li></ul><p>Client Orientation and Communication</p><ul><li>Effective written and oral communication skills;</li><li>Good interpersonal and networking skills;</li><li>Ability to establish and maintain effective working relations;</li><li>Ability to work under minimum supervision;</li><li>Ability to work with multiple stakeholders from a wide range of disciplines and fields, from both developed and developing countries, and having diverse and competing worldviews and interests.</li></ul><p><strong>Education&nbsp;</strong>(maximum 15 points)</p><ul><li>Bachelor’s Degree&nbsp;in social sciences, journalism, public policy or another relevant field.</li><li>A certificate/degree in copyediting, policy writing and/or another relevant field would be an advantage.</li></ul><p><strong>Experience</strong></p><ul><li>At least seven years of relevant experienceincluding in the fields of health, human rights and development (maximum 15 points);</li><li>Relevant experience as copyeditor, writer and/or proof-reader of knowledge products. Include link of five (5) copy edited works as proof. (maximum points 25);</li><li>Previous relevant experience with UNDP or other UN Agencies would be an asset (5 points)</li></ul><p><strong>Languages</strong>&nbsp;(maximum 10 points)</p><ul><li>Fluency in English;</li><li>Spanish and/or French fluency would be an advantage.</li></ul><p><strong>Scope of Price Proposal and Schedule of Payments</strong></p><p>Daily Fee. Consultant shall quote an all-inclusive Daily Fee for the contract period. The term “all-inclusive” implies that all costs (professional fees, communications, consumables, etc.) that could be incurred by the IC in completing the assignment are already factored into the daily fee submitted in the proposal</p><p>Payments shall be made based on approved invoices indicating number of working days spent for each specific assignment, upon verification of completion of deliverables and approval by the IC’s supervisor</p><p><strong>Evaluation method</strong></p><ul><li>Only those applications which are responsive and compliant will be evaluated;</li><li>Offers will be evaluated according to the Combined Scoring method – where the qualifications will be weighted at 70% and the financial offer (based on a quoted all-inclusive daily fee) will be weighted at 30%;</li><li>The technical criteria (education, experience, language) will be based on maximum 70 points. Only the candidates that have achieved a minimum of 49 points of the technical criteria will be deemed technically qualified and be requested to submit a financial proposal;</li><li>Financial score shall be computed as a ratio of the proposal being evaluated and the lowest priced proposal received by UNDP;</li><li>The top 3 Applicants receiving the Highest Combined Scores and that have accepted UNDP’s General Terms and Conditions will be awarded the Framework Agreements.</li></ul>        </div><div>        <a href='https://jobs.undp.org/cj_view_job.cfm?cur_job_id=91381' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lHtHid7NTF6TtvlDuJ2OfA",
    "url": "https://remote.co/job/technical-writer-editor-2/",
    "title": "Technical Writer, Editor",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "QuantumBio",
      "sameAs": "http://www.quantumbioinc.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 7:12:35 PM",
    "validThrough": "May 1, 2020 7:12:35 PM",
    "crawled": "Apr 24, 2020 8:10:08 PM",
    "content": "<div><span><i></i> Remote</span>        </div><div>            <p>Title:&nbsp;Freelance Technical Writer/Editor (<em>e.g.</em>&nbsp;IRS Form 1099 Independent Consultant)</p><p>Location: Anywhere (telecommuting is acceptable)</p><p><strong>Summary:</strong></p><p>Beginning immediately: QuantumBio Inc. is looking for a professional,&nbsp;freelancetechnical editor/writer to aid in the composition of manuscripts for peer reviewed publication, grant proposal submission, and sales/marketing.</p><p><strong>Responsibilities/opportunities:</strong></p><ul><li>Partner with an energetic team of computational chemists and software engineers to transition&nbsp;draft manuscripts into professional publications&nbsp;suitable for consumption by other scientists in the field.</li><li>Provide useful insights in the development of these manuscripts from the perspective of the intelligent reader.</li><li>Comprehensive editing: for both content (for completeness, accuracy, and appropriate language) and form (for organization, visual design, and usability).</li><li>Copyediting: to ensure that the document is mechanically correct (spelling, punctuation, and grammar) and stylistically consistent.</li><li>Proofreading: compare the final version of the document with the marked-up version to make sure that all corrections have been made.</li><li>Take on ad-hoc writing as they arise.</li></ul><p><strong>Key Qualifications:</strong></p><ul><li>Fluent English communication skills including excellent writing, grammar, spelling and formatting.</li><li>M.S. or Ph.D. in Chemistry, Biochemistry, or related field is preferred.</li><li>Strong analytical thinking and writing skills.</li><li>Significant experience writing, developing, and editing manuscripts in preparation for submission to major, peer reviewed journals in the same fields.</li><li>Experience writing, developing, and editing proposals in preparation for submission to grant agencies such as the National Institutes of Health (NIH) and the National Science Foundation (NSF).</li><li>Exposure to statistical and computational methods.</li><li>Independent work ethic.</li><li>Experience with Google Docs, Microsoft Word, Endnote, and Skype.</li></ul><p><strong>Additional Considered Experience/Certifications:</strong></p><ul><li>Practical as well as theoretical understanding of structure based drug discovery methods.</li><li>Experience with sales/marketing material composition and scientific software documentation development will be considered.</li><li>Certification with the Society for Technical Communication (or similar body).</li></ul><p><strong>About QuantumBio:</strong></p><p>QuantumBio Inc is accelerating drug discovery efforts by providing pharmaceutical, biotechnology companies and life science research organizations with a next generation of Computer-Assisted Drug Design (CADD) and Computer-Assisted Molecular Modeling (CAMM) solutions based on the increased accuracy and power of quantum mechanics. These solutions include a number of options tailored to each customer’s specific requirements including software licensing, services, and customization. See http://www.quantumbioinc.com/ for more!</p>        </div><div>        <a href='http://www.quantumbioinc.com/careers/technical_writer_editor' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8gKI94BMRvKedhPMAlA1GA",
    "url": "https://news.ycombinator.com/item?id=22751282",
    "title": "</> • Storyscript • Dialog driven development for tomorrow's developer. Write, collaborate, and ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 7:29:54 PM",
    "validThrough": "Apr 8, 2020 7:29:54 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "&lt;/&gt; • Storyscript • Dialog driven development for tomorrow's developer.<p>Write, collaborate, and automate your work and business -- in one tool.Join a community of creators building automations, tools, workflows and apps by writing stories that focus on business-logic only so you many become a developer and join the millions of people who use code to automate their work and empower their business.</p><p>## Fully-Remote Jobs ##</p><p>- Head of Community</p><p>Passionate, remote, diverse, open-minded, family-first team.</p><p>Apply at <a href='https://jobs.lever.co/storyscript' rel='nofollow'>https://jobs.lever.co/storyscript</a>&lt;/&gt; <a href='https://storyscript.com' rel='nofollow'>https://storyscript.com</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kW3L9CZZQe2fznB-85t2hQ",
    "url": "http://workinstartups.com/job-board/job/91380/content-editorial-manager-furlunteering-at-canaree/",
    "title": "Content & Editorial Manager (furlunteering)",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Canaree",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 7:08:36 AM",
    "validThrough": "Apr 30, 2020 7:08:36 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>Location: London or remote<br />The role: Part-time or full-time (unpaid)</p><br /><h2>Your mission</h2><br /><p>You will be the company voice across our product and online channels.&nbsp;</p><br /><p>We want to make sure that all the expert knowledge in our heads benefit our customers and stakeholders when they interact with our product and engage with us online.&nbsp;</p><br /><p>You will be working closely with our product and commercial team.&nbsp;</p><br /><p>Your first job will be to ensure that when we launch our product is as helpful and informative as possible giving our end users a great experience.&nbsp;</p><br /><p>This includes:&nbsp;</p><br /><ul><br /><li>Produce content for product and online channels including social media and blog&nbsp;</li><br /><li>Execute brand strategy for consistent messaging to all our stakeholders</li><br /><li>Help drive inbound customers and optimise customer success with engaging educational content&nbsp;</li><br /><li>Build, own, analyze and optimize content across all digital channels</li><br /><li>Assist in delivering on creative opportunities and projects for customer and partnership growth in collaboration with our Head of Growth</li><br /><li>Experiment with various types of content such as audio, video and graphics&nbsp;</li><br /></ul><br /><p>&nbsp;</p><br /><h2>Your skills</h2><br /><ul><br /><li>You have experience writing, blogging, and producing content in a commercial and/or educational setting (or willing to learn!)</li><br /></ul><br /><ul><br /><li>You have a creative mind and a &ldquo;let&rsquo;s get this done&rdquo; mode of execution</li><br /></ul><br /><ul><br /><li>You have a solid understanding of how to produce content optimised for SEO, newsletters and social media (or you&rsquo;re able to quickly learn)</li><br /></ul><br /><ul><br /><li>You have excellent verbal and written communication skills in English</li><br /></ul><br /><ul><br /><li>Knowledge or expertise within finance is not a prerequisite, but a bonus if you do</li><br /></ul><br /><ul><br /><li>If you have other experience with video, audio and graphic design it&rsquo;s also a plus&nbsp;<br /><br /></li><br /></ul><br /><p>Apply by telling us about yourself and include your CV or Linkedin profile + portfolio.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "h1PW6nwYSvWfcovt0E-2PQ",
    "url": "http://workinstartups.com/job-board/job/91246/content-creator-at-absorb-reality/",
    "title": "Content Creator",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Absorb Reality",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 20, 2020 11:19:09 AM",
    "validThrough": "Apr 27, 2020 11:19:09 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>Hi, we're looking for help from a great content creator.</p><br /><p>We're a training company working with Virtual Instructor-Led Training (VILT) and Virtual Reality (VR) and we operate primarily in the Health &amp; Social care sector.</p><br /><p>If you'd like the opportunity to help our clients (and us of course) to better look after their patients, residents and service users we'd love to hear from you.</p><br /><p>It's all about your writing and design skills, with the pace that things are changing we're overwhelmed with requests for help and need a way to get the word out with what is available to other clients and organisations we'd like to work with (in a better format than our rudimentary ms word skills......)</p><br /><p>We all work remotely and have done since we started so we have all of the systems set up for communication across the team so no problem working from home - and we certainly don't mind if you're in your PJs.</p><br /><p>Flex hours, times, days - whatever works best.</p><br /><p>Thanks for reading and we'd love to hear from you</p><br /><p>Steve &amp; the Absorb team</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7HFpKqLdT_qtPZ4TrSBOIA",
    "url": "http://workinstartups.com/job-board/job/91176/remote-content-intern-at-apolitical/",
    "title": "Remote Content Intern",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Apolitical",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 17, 2020 2:25:07 PM",
    "validThrough": "Apr 24, 2020 2:25:07 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><strong>What&rsquo;s Apolitical?</strong></p><br /><p>Every other sector has been transformed by platforms. Government is the final frontier for technology-enabled sharing and connecting.&nbsp;</p><br /><p>Apolitical is a learning platform for government that launched in 2017 &ndash; now 60,000+ public servants, policymakers and politicians in 170+ countries are using it for peer-led, future-facing learning.&nbsp;</p><br /><p>Our members range from mayors, ministers and heads of state to millennials pioneering digital innovations.</p><br /><p><strong>Remote Content Internship</strong></p><br /><p>Duration: 12 weeks full-time recommended, can be flexible depending on needs</p><br /><p>Location: Remote, can work around your time zone and schedule</p><br /><p>Apolitical is looking for a content intern for our online learning platform for government. You&rsquo;ll create content for online courses tailored for public servants, covering topics ranging from evidence-based policymaking to crisis leadership. You&rsquo;ll help public servants build critical skills through designing engaging, interactive learning activities like worksheets, quizzes, group exercises, videos and more.</p><br /><p>By the end of the internship you&rsquo;ll:</p><br /><ul><br /><li>Have a portfolio of innovative content for a career in digital media, learning, communications, marketing, product, or beyond</li><br /><li>Be familiar with the latest approaches to government and policymaking, including a range of policy areas and professional competencies</li><br /><li>Have experience at a fast-paced, award-winning startup&nbsp;</li><br /><li>Have experience working with a team of writers, designers, product managers, and developers</li><br /></ul><br /><p>What we need from you is:</p><br /><ul><br /><li>An interest in government or policy</li><br /><li>The ability to quickly understand complex projects and concepts</li><br /><li>The ability to write in a way that is clean, clear and engaging</li><br /><li>Creativity and an interest in designing interactive ways for people to learn</li><br /><li>Efficiency and the ability to meet strict deadlines</li><br /></ul><br /><p>To apply, send the items below in one document with the subject line &lsquo;Application: Content Internship&rsquo;:</p><br /><ol><br /><li>CV or resume</li><br /><li>A 200 word response to the following exercise: Apolitical Microcourses are online, bitesize courses on topics that matter to governments and public servants. You are writing content for a microcourse on productivity, &ldquo;How to be a More Productive Public Servant.&rdquo; Write a 200 word summary of an interactive learning activity that could be part of this microcourse.</li><br /></ol>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vrcrEuLdTsWrJl8U9qZMrA",
    "url": "http://workinstartups.com/job-board/job/90949/content-writer-for-courses-at-pearl-lemon/",
    "title": "Content Writer for Courses",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Pearl Lemon",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 5, 2020 2:10:10 AM",
    "validThrough": "Apr 12, 2020 2:10:10 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<h1>ABOUT</h1><br /><p>&nbsp;</p><br /><p>Pearl Lemon is a multiple-award winning SEO &amp; Lead Generation Agency based in the heart of London but serving clients worldwide. With a team of 15 dotted across the UK, USA, Romania, India, Pakistan, Philippines and more they operate around the clock and communicate predominantly through Whatsapp that function more like a silicon-valley-startup and have a work-ethic comparable to investment bankers. It&rsquo;s not a surprise when you consider their founder Deepak Shukla is an ex-Deloitte consultant and 30x marathon runner.&nbsp;</p><br /><p>&nbsp;</p><br /><p>BENEFITS OF WORKING WITH PEARL LEMON</p><br /><p>&nbsp;</p><br /><ul><br /><li>Work from the office or from home</li><br /><li>Flexible working hours</li><br /><li>Exponential learning</li><br /><li>A unique work experience being fully remote with a start-up</li><br /></ul><br /><p>&nbsp;</p><br /><h1>Content Writer for Courses</h1><br /><p>Pearl Lemon is looking for a highly motivated and driven person to help drive forward our ambitious growth plans throughout 2020 and beyond. You will be an important part of a tight-knit team who have a hands-on approach and are passionate about taking the business to the next level.</p><br /><p>The course content writer is an integral part of our team. We are looking for someone that will help build out excellent content for courses in relation to our services.</p><br /><p>There will be a focus on developing the Pearl Lemon courses regarding SEO, Lead Generation, R&amp;D Tax, Forex Research, Podcast Lead Generation and more</p><br /><p>We are looking for someone who prides themselves on their speed of communication, attention-to-detail, and meticulous planning skills, but can adapt to change in a very fast-moving environment.</p><br /><p>A strong understanding of digital marketing is essential, as is exceptional people and communication skills to help develop team members who you will manage directly.</p><br /><p>&nbsp;</p><br /><h2>POSSIBLE responsibilities will include:</h2><br /><ul><br /><li>Creation of course content</li><br /><li>Building out slide decks for course content</li><br /><li>Focussing on the areas of SEO, Lead Generation, R&amp;D Tax, Forex Research, Podcast Lead Generation, and more</li><br /></ul><br /><h2>Required skills and experience:</h2><br /><ul><br /><li>Exceptional communication skills, verbal and written.</li><br /><li>Being punctual and quick to respond and communicate-daily.</li><br /><li>Experience with Word Press and SEO</li><br /><li>Proven people management track record.</li><br /><li>Incredibly fast learner.</li><br /></ul><br /><h2>Benefits:</h2><br /><ul><br /><li>Learn Very Very Fast</li><br /><li>Work with TedX Speakers</li><br /><li>Work with ultramarathon runners, speakers of multiple languages</li><br /><li>Work with a fully digital and remote team across different timezones</li><br /><li>Build and grow entirely in the cloud</li><br /><li>International work-cations where we meet and work in a foreign country for a week</li><br /><li>Worst case - learn tons, get an amazing reference and move forward</li><br /><li>Best case - go full time, build your personal brand and work from anywhere in the world</li><br /><li>Take your digital skills you learn with us and apply to any job in any industry</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EUQu3CMeTxaHlmaB1o8aRA",
    "url": "http://workinstartups.com/job-board/job/90873/grant-writer-at-eppik/",
    "title": "Grant Writer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Eppik",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 30, 2020 6:45:12 PM",
    "validThrough": "Apr 6, 2020 6:45:12 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><u>Purpose:</u></p><br /><p><strong>Write grant application for software tackling dementia and loneliness.</strong></p><br /><ul><br /><li>Eppik helps you share your family story through an innovative storytelling platform. We believe stories with great design make people happy.</li><br /><li>We digitise old photos and photo albums so that families can share their family stories across generations. Family lives, beautifully told.</li><br /><li>We also believe that making people more connected will help reduce loneliness in society especially for those suffering or at risk of dementia.</li><br /><li>We are developing new features linked to tackling dementia and loneliness in our communities.</li><br /><li>You will work closely with the founder to submit our grant application.</li><br /></ul><br /><p>&nbsp;</p><br /><p><u>Role &amp; Skills:</u></p><br /><p><strong>We are looking for an experienced grant writer. Remote role.&nbsp;</strong></p><br /><ul><br /><li>Eppik is looking for an experienced grant writer to work on an Innovate UK application for a new feature it is developing.</li><br /><li><span>Experience with software grant applications needed. </span></li><br /><li><span>Ability to synthesise research and bibliography.</span></li><br /><li>Grasp of main concepts in software development.</li><br /><li>Ability to work within deadlines. Efficient.</li><br /><li>Clear and concise style.&nbsp;</li><br /><li>English as a first language.</li><br /></ul><br /><p>&nbsp;</p><br /><p><u>Potential:</u></p><br /><p><strong>Eppik is working on several innovations and future grant work may be needed.</strong></p><br /><ul><br /><li>R&amp;D is at the heart of the business.&nbsp;</li><br /><li>The role could lead to other content writing requirements.</li><br /></ul><br /><p>&nbsp;</p><br /><p>Fixed fee. Remote role.&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dTM-dFodRBKqsd7SnpkIdg",
    "url": "http://workinstartups.com/job-board/job/90861/content-curator-at-learnerbly/",
    "title": "Content Curator",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ],
    "hiringOrganization": {
      "name": "Learnerbly",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 22000,
      "maxValue": 25000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 22k - 25k /Year"
    },
    "employmentType": "UNSET",
    "published": "Mar 30, 2020 9:17:26 AM",
    "validThrough": "Apr 6, 2020 9:17:26 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><strong>Content Curator</strong>, at Learnerbly, London</p><br /><p><strong>Given the current circumstances this role is 100% remote at the moment.&nbsp;</strong></p><br /><p><em>22-25k per annum</em></p><br /><p><strong><em>*** PLEASE APPLY THROUGH THIS LINK <a href='https://learnerbly.teamtailor.com/jobs/860886-content-curator?promotion=153590-trackable-share-link-learnerbly-website'>https://learnerbly.teamtailor.com/jobs/860886-content-curator?promotion=153590-trackable-share-link-learnerbly-website</a></em></strong></p><br /><p><a href='https://www.learnerbly.com/'>Learnerbly</a>&nbsp;is a London based Workplace Learning Platform that enables people to be their best selves at work.&nbsp;&nbsp;</p><br /><p>Our mission is to work with organisations to create a progressive learning culture that empowers their people to own their development, guides them towards the best learning opportunities and supports them in applying their learnings.&nbsp;&nbsp;</p><br /><p>We're looking for a Content Curator to join our team and assist in managing and curating the learning content within our platform.&nbsp;</p><br /><p>We are hiring on a rolling basis.</p><br /><p><strong>&nbsp;</strong></p><br /><p><strong>Responsibilities</strong></p><br /><p>At Learnerbly, a learning content is a piece of resource which a user would purchase to aid their development. The core responsibility is to assist in managing and curating this library of learning content within the platform.</p><br /><ul><br /><li>Ensure all learning content on the platform meets our curation guidelines.</li><br /><li>Ensure all learning content on the platform matches the tone and style of Learnerbly.</li><br /><li>Maintain all learning content to ensure it is all up to date and accurate.</li><br /><li>Work with Marketing to promote learning content across our marketing channels and social networks.</li><br /><li>Work with Partnerships Lead to manage ongoing partnerships with learning providers and support the running of Learnerbly Events.</li><br /><li>Work with Product to ensure backend continues to support the needs of the learning content on the platform from creation to ongoing maintenance.</li><br /><li>Work with Operations to manage partner delivery processes to ensure learners receive their resources promptly and accurately.</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Requirements</strong></p><br /><p><em>These are ideal but not required as we know some people are less likely to apply for the role&nbsp;</em><a href='https://hbr.org/2014/08/why-women-dont-apply-for-jobs-unless-theyre-100-qualified'><em>unless they are 100% qualified.</em></a>&nbsp;<em>We promote a diverse, inclusive and empowering culture at Learnerbly.</em></p><br /><ul><br /><li>BA in Journalism, Marketing, English, History, Social Sciences or related field.</li><br /><li>Excellent written skills in English.</li><br /><li>Excellent communication and interpersonal skills to collaborate with the wider team.</li><br /><li>Experience with data analytics platforms like Mixpanel, desirable.</li><br /><li>Great organisational skills with the ability to work well under pressure and to tight deadlines.</li><br /><li>Strong attention to detail.</li><br /><li>A curious mindset.</li><br /><li>Pro-active self-starter and enjoy working as part of a small team.</li><br /><li>Hands-on experience with Content Management Systems (e.g. WordPress, Webflow), desirable.</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Benefits</strong></p><br /><p><em>We&rsquo;re passionate about learning and development and will do everything we can to maximise your personal and career growth. Check out our&nbsp;</em><a href='https://www.notion.so/learnerbly/Learnerbly-s-Employee-Guide-3a0964ee63aa490a8606fb7bebe42722'><em>Employee Guide</em></a><em>&nbsp;for more details!</em></p><br /><p>You&rsquo;ll also receive:</p><br /><ul><br /><li>Competitive salary and result-driven bonus</li><br /><li>Flexible working environment and hours</li><br /><li>Values-driven culture</li><br /><li>&pound;1,000 learning and well-being budget to spend each year</li><br /><li>25 days paid holiday</li><br /><li>Free on-site barista coffee, herbal teas and fresh fruit</li><br /><li>Quarterly team off-sites and outings</li><br /><li>Healthcare cashback scheme available&nbsp;</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Our Values</strong></p><br /><p><em>We look for people who share our values and can add to our culture.&nbsp;</em></p><br /><ul><br /><li><strong>Be your authentic self</strong>: For us, this means finding the intersection between what you love and what you&rsquo;re good at, so you can be yourself at work.</li><br /><li><strong>Set the destination, own the journey</strong>: &quot;Be the change you want to see in the world.&quot; Think big, speak up, take ownership. We believe in learning by experimenting and failing fast: use your creativity and resourcefulness to find solutions to problems you encounter.</li><br /><li><strong>Invite everyone to dance</strong>: &ldquo;Diversity is being invited to the party, inclusion is being asked to dance.&rdquo; We look for people who share our values and contribute to our culture. Diversity alone is not enough. We believe by being diverse and inclusive we make better decisions.</li><br /><li><strong>Practice heartfelt, radical candor</strong>: We know seeking<a href='https://www.youtube.com/watch?v=4yODalLQ2lM'>&nbsp;radically candid feedback</a>&nbsp;can be hugely powerful. We proactively seek and give feedback to reveal blindspots and accelerate growth.</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong><em>*** PLEASE APPLY THROUGH THIS LINK <a href='https://learnerbly.teamtailor.com/jobs/860886-content-curator?promotion=153590-trackable-share-link-learnerbly-website'>https://learnerbly.teamtailor.com/jobs/860886-content-curator?promotion=153590-trackable-share-link-learnerbly-website</a></em></strong></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "aOdKBr-lTh2ntq0lai-cVw",
    "url": "http://workinstartups.com/job-board/job/90757/physics-content-creator-at-save-my-exams/",
    "title": "Physics Content Creator",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``work 3W where 2W want",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Save My Exams",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 30000,
      "maxValue": 38000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 30k - 38k /Year"
    },
    "employmentType": "UNSET",
    "published": "Mar 23, 2020 12:36:20 PM",
    "validThrough": "Mar 30, 2020 12:36:20 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<h2 data-fontsize=&quot;34&quot; data-lineheight=&quot;50&quot;>Bored of teaching? Want to join an exciting Edtech startup?</h2><br /><p>Are you currently a Physics teacher looking for a fulfilling career in education without the demands of teaching in a school?</p><br /><p>We know being a teacher today is an impossible job with 60+ hour work weeks, no personal life, and a lack of focus on actually educating.&nbsp;</p><br /><p>Save My Exams Content Creators have the flexibility to work from where they want, the time and support to make amazing resources, and the opportunity to help tens of thousands of students.</p><br /><h2>The Company</h2><br /><p>Save My Exams is an online platform dedicated to helping GCSE and A-level students achieve better grades. We create high-quality and affordable resources that are used by tens of thousands of students, tutors and teachers all over the world to make revision easier.</p><br /><h2>The Role:&nbsp;</h2><br /><ul><br /><li>Full-time or Part-time (minimum 20 hours / week) Physics Content Creator&nbsp;</li><br /><li>Start Date: ASAP.</li><br /><li>Location: Work from home (or wherever you want) at times that best suit you. We also have office space in London.</li><br /><li>Be part of a team dedicated to making great educational resources that positively impact thousands of students and teachers.</li><br /></ul><br /><h2>Responsibilities:</h2><br /><ul><br /><li>Create high-quality GCSE and A Level Physics resources including:</li><br /><ul><br /><li>Writing questions &amp; model answers</li><br /><li>Writing &amp; structuring revision notes</li><br /><li>Designing, scripting and recording physics videos</li><br /></ul><br /><li>Develop product and resource strategies</li><br /><li>Collaborate with other Save My Exams team members to review and improve existing resources</li><br /></ul><br /><h2>Our Promise</h2><br /><ul><br /><li>A friendly &amp; positive work environment</li><br /><li>Reasonable hours &amp; control over your time</li><br /><li>A real opportunity to positively influence thousands of students</li><br /><li>The chance to learn new skills and be part of an exciting, growing tech company</li><br /></ul><br /><h2>Skills &amp; Experience:</h2><br /><ul><br /><li>Teacher of GCSE and A Level Physics</li><br /><li>Teacher of GCSE Chemistry and/or Biology (Preferred but not required)</li><br /><li>Minimum 2:1 Science degree</li><br /><li>Native English speaker</li><br /><li>High level of attention to detail</li><br /><li>Clear writer and communicator</li><br /><li>Self-motivated</li><br /><li>Reliable, organised and able to work to a deadline</li><br /><li>Experience creating resources such as questions, videos and revision notes</li><br /><li>A genuine passion for teaching &amp; helping students</li><br /><li>Interested in technology &amp; learning new skills</li><br /></ul><br /><h2>Salary &amp; Benefits:&nbsp;</h2><br /><ul><br /><li>&pound;30,000 - 38,000 p.a depending on experience&nbsp;</li><br /><li>Pension Contribution</li><br /><li>Work from anywhere and on your schedule</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "u1KMstszSAisfu-QoKKRYA",
    "url": "http://workinstartups.com/job-board/job/90713/digital-content-creator-at-datasine/",
    "title": "Digital Content Creator",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "DataSine",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 19, 2020 2:32:11 PM",
    "validThrough": "Mar 26, 2020 2:32:11 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>Datasine is on the hunt for a Digital Content Creator to join it&rsquo;s creative, ambitious, and fast-paced Marketing team here in London.&nbsp;</p><br /><p><strong>Who are you?</strong></p><br /><p>You&rsquo;re a creative storyteller with a proven track record of creating effective digital and branded content. You flourish working both as part of a team and as autonomously as the sole owner of your own space within the department. This is your chance to join a cutting edge, fast paced tech startup in the heart of bustling Clerkenwell, London.&nbsp;</p><br /><p><strong>The role</strong></p><br /><p>You will enjoy the autonomy to originate, research, develop and deliver content ideas in a variety of digital formats and platforms, across online channels and social media, to maximise Datasine&rsquo;s engagement with its key audiences.&nbsp;</p><br /><p>This includes creating original value-adding stories, adapting materials, reporting on milestones and events for the website and social media accounts, as well as internal channels to a high standard and agreed deadlines. A key brand ambassador, the Digital Content Creator will work closely with the Marketing team to produce and maintain a cohesive and aligned digital presence.</p><br /><p><strong>What will you be doing?</strong></p><br /><ul><br /><li>Research, report, assemble and produce content pieces for Datasine's website, social media, and other digital platforms, including newsletters</li><br /><li>Identify opportunities and actively contribute with ideas for engaging themes and campaigns, aligning with Datasine&rsquo;s business goals and generating value for its audiences</li><br /><li>Own the editorial planning calendar</li><br /><li>Work collaboratively across the marketing team to maximise messaging impact.This includes, but is not limited to, video, live webcast/social broadcast, graphics, native and paid social content</li><br /><li>Maintain the Datasine website, optimise SEO and update via content management systems</li><br /><li>Work collaboratively with the wider commercial team, supporting initiatives as needed</li><br /><li>Work with the Creative Strategist to ensure social assets are in line with brand guidelines and brand identity</li><br /><li>Manage all of Datasine&rsquo;s social channels</li><br /></ul><br /><p><strong>Must Have:</strong></p><br /><ul><br /><li>Proven experience in a design/creative role</li><br /><li>Camera operating experience and competency with new and emerging cameras and tools</li><br /><li>Strong working knowledge of Adobe Creative Suite software, Premier, Photoshop, After Effects and InDesign</li><br /><li>Strong understanding of managing a content-led social media presence&nbsp;</li><br /><li>Attention to detail and good time-management</li><br /><li>Experience of adapting material for various purposes, to maximise impact</li><br /><li>Experience using a variety of platforms and formats, including online, social media native formats and newsletters</li><br /><li>Ability to build and maintain effective working relationships with a range of people, inside and outside of the organisation</li><br /><li>Planning and organisation skills; capable of dealing with several projects at a time, prioritising effectively</li><br /><li>Flexibility and adaptability, particularly in the face of changing priorities and circumstances</li><br /></ul><br /><p><strong>Nice to haves:</strong></p><br /><ul><br /><li>Experience of working at a startup or high-growth business&nbsp;</li><br /><li>Experience working at an agency or similar work environment</li><br /><li>Good interview technique - and experience of interviewing</li><br /><li>Ability to record professional audio</li><br /><li>Ability to light a scene - particularly for interviews</li><br /><li>Experience of supporting a marketing or communications function</li><br /><li>Appetite for new social media technologies and formats</li><br /><li>Consistent record in generating creative marketing&nbsp;ideas</li><br /><li>Outstanding storytelling abilities and the ability to create engaging copy</li><br /></ul><br /><p><strong>Perks:</strong></p><br /><ul><br /><li>25 days holiday and 8 bank holidays</li><br /><li>Friendly, supportive and diverse company culture</li><br /><li>Fruit delivered twice a week</li><br /><li>Good filtered coffee, a selection of teas and a fridge stocked with soft drinks</li><br /><li>Regular team social events</li><br /><li>Casual dress code</li><br /><li>Cool, creative office in Clerkenwell</li><br /></ul><br /><p><strong>A bit about our team</strong></p><br /><p>We are a diverse and friendly bunch, and because we know about psychology, we also know that work-life balance is very important. We work sensible hours, dedicate work time to team and personal wellbeing, and keep a focus on our workplace being a supportive environment. If that sounds appealing, we&rsquo;d love to speak to you.</p><br /><p><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6IxUC2NlQ4Whl6HkHuiyXQ",
    "url": "http://workinstartups.com/job-board/job/90463/volunteer-content-assistant-at-mbm/",
    "title": "Volunteer Content Assistant",
    "tags": [
      "DBG:surround``from 4W your 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "MBM",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 5, 2020 3:23:59 PM",
    "validThrough": "Mar 12, 2020 3:23:59 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><strong>Company overview:</strong></p><br /><p>MBM is an online brand. The brand was created due to an identification of a gap in the market where&nbsp; the invisible barriers that ethnic minorities had to deal with in order to shine, and work three times as hard just to be seen, this was clearly apparent in corporate settings and in entrepreneurship.</p><br /><p>In short, the online brand consists of a podcast which discusses diversity, inclusion, and aspects surrounding this, for people in both corporate and entrepreneur settings. The brand also has a paid membership and social channels, including instagram, facebook and pinterest.</p><br /><p>Even though MBM is aimed at women of colour it is not exclusive to only this demographic.</p><br /><p>This platform stands to empower and serve as a reason and purpose to keep growing despite your race or age.&nbsp; The brand aim's to touch and change the lives of many.</p><br /><p><strong>Requirements</strong></p><br /><p>To apply for this role you are expected to already understand how to edit podcast episodes. You are able to understand audio-related requests and correct anything that needs amending as needed.</p><br /><p>You already professionally use a system like, Adobe Audition, iZotope RX7 Advanced, Pro Tools, Logic Pro X or Audacity.</p><br /><p>This position does involve helping with the marketing for MBM, however, training will be provided for this part.</p><br /><p>This position is remote based, in other words, you could do this from your home.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Y3rQlxucTui5ILQeF4cO8w",
    "url": "http://workinstartups.com/job-board/job/91236/copywriter-at-brkv/",
    "title": "Copywriter",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "BRKV",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 20, 2020 10:06:48 AM",
    "validThrough": "Apr 27, 2020 10:06:48 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>A part-time work from home opportunity for a native English speaker that writes fast and is passionate about creating content. You must be able to show a willingness to research, develop a full understanding of different topics and come up with original work.&nbsp;<br /><br /></p><br /><p>Main Responsibility</p><br /><p>Distill down different concepts into a copy that's genuine and straight-forward. Capture the voice and set the tone for the content. Adapt it to different styles in order to communicate messages to a variety of audiences in a powerful manner.&nbsp;<br /><br /></p><br /><p>Qualifications/Requirements<br /><br />-Previous professional experience in copywriting<br />-Native English speaker with an excellent vocabulary<br />-Capable of writing fast with an ability to create engaging copies<br />-Understand the corporate identity and adapt the style and tonality<br />-A keen eye for proofreading and editing both ones' own and others&rsquo; content<br />-Ability to prioritize, manifest results and meet tight deadlines consistently<br />-A hands-on mindset capable to take a step back and think strategically<br />-Research and grasp different topics, problems, and solutions&nbsp;</p><br /><p>The goal is to find a natural self-starter whose strong writing asset can be applied to our branding, advertising, and marketing campaigns. The content will be used for websites, blogs, social media and other vessels for strategic communication.&nbsp;</p><br /><p>We are looking for someone to start immediately. If interested, feel free to send a CV and example of your work.&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "SKAcJ3TuQ2iYTrlDwW3gYQ",
    "url": "http://workinstartups.com/job-board/job/90882/will-writerwill-solicitor-at-farewill/",
    "title": "Will Writer/Will Solicitor",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Farewill",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 31, 2020 12:04:48 PM",
    "validThrough": "Apr 7, 2020 12:04:48 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>We&rsquo;re looking for an experienced&nbsp;<strong data-redactor-tag=&quot;strong&quot;>Will Writer/Will Solicitor</strong>&nbsp;to join our growing legal team at&nbsp;<strong data-redactor-tag=&quot;strong&quot;>Farewill</strong>.</p><br /><p>This role is a unique opportunity to help us launch a telephone will service to complement our market-leading and award-winning online service.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>In the next 12 months you will:</strong></p><br /><ul><br /><li>Work closely with our Head of Legal and CFO to help us shape, deliver and grow a telephone will service.</li><br /><li>Run a caseload of telephone wills.</li><br /><li>Work collaboratively with our sales, customer operations and product teams to iterate on processes and procedures at pace.</li><br /><li>Help build and train a team around you in order to deliver on our ambitious goals.</li><br /></ul><br /><p><strong data-redactor-tag=&quot;strong&quot;>Hopefully, you&rsquo;ll have some or all of the following:</strong></p><br /><ul><br /><li>You have proven experience of writing wills in a volume environment. You have written hundreds, maybe even thousands of wills.</li><br /><li>You are customer-focused. At Farewill, customers come first. You need to be enthusiastic about our customers.</li><br /><li>You have a great eye for detail and the ability to communicate complex legal problems simply.</li><br /><li>You enjoy working in a fast-paced environment, being hands-on and getting things done.</li><br /><li>You are excited by technology and the opportunity to step away from traditional ways, assumptions and perceived wisdom.</li><br /></ul><br /><p><strong data-redactor-tag=&quot;strong&quot;>Some added bonuses that would be great:</strong></p><br /><ul><br /><li>Qualified solicitor, but it&rsquo;s not essential. Experience is more relevant than qualification for this role.</li><br /><li>STEP Advanced Certificate in Will Preparation or an equivalent.</li><br /><li>Experience supervising a team.</li><br /><li>Wider private client experience including estate administration.</li><br /></ul><br /><p><em data-redactor-tag=&quot;em&quot;>If this sounds like what you&rsquo;d love to be doing, we can&rsquo;t wait to hear from you. If you&rsquo;re not sure that you exactly fit the above criteria, get in touch anyway. Personality and attitude is just as important as experience!</em></p><br /><p><strong data-redactor-tag=&quot;strong&quot;>What we offer in return:</strong></p><br /><ul><br /><li>Competitive salary and generous stock options</li><br /><li>28 days of annual leave plus the usual public holidays</li><br /><li>Work from home on Wednesdays, flexible start and end to your day</li><br /><li>Lovely, spacious, bright office in Haggerston. But, if London&rsquo;s not for you, that&rsquo;s ok - we can make remote working work for the right candidate too.</li><br /><li>Regular off-site days and team lunches</li><br /><li>Santander cycles membership!</li><br /><li>A chance to make a meaningful contribution to people's lives and deaths</li><br /><li>And much&nbsp;<a href='https://farewill.workable.com/' rel='nofollow noreferrer noopener'>more</a>!</li><br /></ul><br /><p><strong data-redactor-tag=&quot;strong&quot;>About Farewill:</strong><br />At Farewill, we&rsquo;re out to change the way the world deals with death. Helping people to take control, personally and financially, of what matters to them after they&rsquo;re gone.</p><br /><p>We launched our first product - our will-writing service - in December 2016, and since then we&rsquo;ve grown to be the largest will-writer in the UK. We launched our second product,&nbsp;<a href='https://probate.farewill.com/help/what-is-probate' rel='nofollow noreferrer noopener'>Probate</a>, in early 2019, and recently our third,&nbsp;<a href='https://farewill.com/cremation/overview' rel='nofollow noreferrer noopener'>Cremation</a>.</p><br /><p>Our growth to date has been driven by an exceptional product (see our&nbsp;<a href='https://www.trustpilot.com/review/farewill.com' rel='nofollow noreferrer noopener'>customer reviews</a>) and key strategic partnerships. We&rsquo;ve been featured in Forbes, The Times, The Guardian and on&nbsp;<a href='https://www.bbc.co.uk/programmes/b08slvk6' rel='nofollow noreferrer noopener'>Radio 4</a>&nbsp;among others. We're also making waves in the charity world - with over &pound;100 million raised for charities on our platform from gifts left in wills.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Our team:</strong><br />We&rsquo;re a creative, focused team who love what we do. We have backgrounds in design, technology, behavioural psychology, and management consultancy. We love to learn from each other and our customers, and grow together as a team.</p><br /><p>Based in our lovely office in Haggerston, we&rsquo;re backed by some of the best investors in Europe - from the founders of Transferwise and Zoopla, to Kindred Capital, SAATCHiNVEST, JamJar and DMGT.<br /><br />This is an unusual, fascinating, and emotional area to work in &ndash; if you&rsquo;re up for a big challenge we&rsquo;d love to meet you.</p><br /><p><em data-redactor-tag=&quot;em&quot;><br />If you&rsquo;d like to understand our culture and product better, here&rsquo;s a few articles for you to read:&nbsp;<a href='https://farewill.com/about' rel='nofollow noreferrer noopener'>About Farewill</a>,&nbsp;<a href='https://medium.com/farewill' rel='nofollow noreferrer noopener'>Life at Farewill</a>, Are you worried about your will?</em></p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Please note - In light of the coronavirus (COVID-19) outbreak, all Farewill employees are working remotely and we will be conducting all interviews virtually for the foreseeable future. We will continue hiring as usual.</strong></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kzNhW6lDSmyiFwF351Fsuw",
    "url": "https://remoteok.io/jobs/84398",
    "title": "Dutch Freelance Editor",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:backbone.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "komoot ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 9:46:44 AM",
    "validThrough": "Apr 9, 2020 9:46:44 AM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>komoot</h4>&nbsp;</span> <br> <h3>Dutch Freelance Editor</h3> <span></span> <span>verified</span> <br> <span>Worldwide</span> <div>  <div>   **Millions of people experience real-life adventures with our apps. We help people all over the world to discover and plan the best hiking and biking routes, empowering them to explore more of the great outdoors. And we’re good at it: Google and Apple have listed us as one of their Apps of the Year numerous times — and, with over 9 million users and over 100,000 five-star reviews, komoot is becoming the most popular cycling and hiking app worldwide.&nbsp;**\\n\\nThe backbone of komoot is a huge repository of route recommendations and outdoor tips; handmade Collections built by passionate outdoor editors who experience these places for themselves. To help inspire our growing community in the Netherlands through the best outdoor content, we’re looking for additional outdoor editors to join our team on a freelance basis.\\n\\n**Why you will love it**\\n* You will utilize all of your greatest passions: The outdoors, researching and writing.\\n* Your stories will inspire millions of people, from seasoned outdoor-lovers to novice hikers and cyclists, and they’ll help establish our community in the Netherlands.\\n* We encourage you to work from wherever you want, be that on a beach, in the mountains, from home, or anywhere that lies between the time zones UTC-1 and UTC+3.\\n* Enjoy a creative and responsible role that offers a great amount of flexibility.\\n\\n# Responsibilities\\n **What you will do**\\nCreate unique, inspiring content for our [Collections](https://www.komoot.com/collection/887973/mountain-biking-the-west-highland-way) and [Guides](https://www.komoot.com/guide/65587) \\nUse your knowledge of the most popular official bike routes, the best singletracks, the toughest climbs or the most beautiful hikes to inspire our Dutch userbase.\\nIndependently build amazing routes on komoot\\nResearch and create relevant Highlights for mountain bikers, cyclists, bike tourers and hikers.\\nReview and edit existing Highlights based on our quality standards and according to user suggestions\\nDescribe the most important aspects of a region such as its landscape, history, top attractions or infrastructure in a way that is useful and inspirational for hikers and cyclists.\\nWrite copy that’s easily understandable, SEO optimized and adheres to komoot's writing style.\\nTell the stories of these routes and places—and some of your own adventures—to get our Dutch users dreaming! \\n\\n# Requirements\\n**You will be successful in this position if**\\n* You are a passionate outdoor editor with a minimum of 2 years experience.\\n* You feel at home online and always adopt the latest tools to improve your own efficiency.\\n* You are an experienced mountain biker, cyclist, hiker or bike tourer, and know the Dutch cycling and hiking hotspots like the back of your hand.\\n* You are available to work for us for a minimum of 20 hours per week.\\n* You speak Dutch on a native level, write and speak excellent English and also have a good level of German.\\n* You can write snappy and grammatically flawless Dutch copy.\\n* You are highly motivated, excited about taking on additional responsibilities, and are structured and target oriented in your approach to tasks. \\n\\n#Location\\n- Worldwide   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4ihOI0IHRJiYshVFrEEk4g",
    "url": "https://remoteok.io/jobs/84325",
    "title": "Content Manager",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Versus.com ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 30000,
      "maxValue": 36000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "EUR 30k - 36k /Year"
    },
    "employmentType": "UNSET",
    "published": "Mar 31, 2020 1:35:09 AM",
    "validThrough": "Apr 7, 2020 1:35:09 AM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>Versus.com</h4>&nbsp;</span> <br> <h3>Content Manager</h3> <span></span> <br> <span>UTC -1 to UTC +3</span> <div>  <div>   Versus is a global data-driven comparison platform covering over 90 categories, from phones and wearables to apps and cities. In times of information overload, we believe there is a need for objective and unbiased information. By providing objective comparisons, as well as structured, easy-to-visualize data on a wide range of topics, we aim to ease decision-making.\\n\\nWe are a team of six tech enthusiasts, coming from different countries and having diverse backgrounds, and we work with freelancers all over the world. You will be part of a global team of content specialists, and you will be able to get involved in a variety of processes, from data analysis and localization to search engine optimization and social media marketing. We’d love it if you could join us in Berlin, but there is also the possibility of working remotely.\\n\\n# Responsibilities\\n * Managing the content team by planning tasks, preparing briefs and documentation for projects, and supporting other team members with their tasks\\n* Localizing content with the help of a team of freelance translators\\n* Performing online research on a wide range of topics, with a focus on consumer electronics\\n* Conducting keyword research and implementing on-page SEO techniques\\n* Creating SEO-relevant content for product descriptions, category descriptions, sponsored\\n* content, and other types of texts, ideally in two languages\\n* Maintaining and growing our ever-expanding database by performing data-entry tasks and\\n* conducting quality assurance audits \\n\\n# Requirements\\n* You are passionate about technology and have a keen eye for detail\\n* You are proficient in English and at least one other language, preferably Spanish, German, or another language in which Versus is available\\n* You enjoy working in a team and optimizing processes\\n* You have excellent communication and organizational skills, as well as good analytical skills (knowledge of Google Analytics, Sistrix, and Ahrefs is a plus)\\n* You have basic photo editing skills\\n* You have experience working with content management systems\\n* You enjoy working in a small team, communicating openly and showing initiative \\n\\n#Salary\\n30000 - 36000 €\\n \\n\\n#Location\\n- UTC -1 to UTC +3   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
