{
 "items": [
  {
    "id": "0OxKqoHOTFiviQMFZXeFVQ",
    "url": "https://weworkremotely.com/remote-jobs/simpletexting-copywriter-and-marketer-for-mobile-marketing-software-as-a-service-company-1",
    "title": "SimpleTexting: Copywriter and Marketer for Mobile Marketing Software as a Service Company",
    "tags": [
      "DBG:surround``5N( opportun,             2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SimpleTexting",
      "sameAs": "https://simpletexting.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 7:16:20 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Copywriter and Marketer for Mobile Marketing Software as a Service Company</h2><span>Company: SimpleTexting<br></span><span>Headquarters: Miami, FL<br></span><span>https://simpletexting.com/<br><br></span>  <div>    <div>SimpleTexting is seeking an entry-level copywriter and marketer to help with company messaging, marketing, and copywriting. </div><div><br></div><div></div><div>This is a remote full-time contract position and requires a disciplined and motivated individual. </div><div><br></div><div></div><div><strong>Responsibilities:</strong></div><div><br></div><div></div><ul><li><span>Research the marketplace to help optimize the way we communicate our offering at several first touch points (e.g., the way we tell our story on our homepage).</span></li><li><span>Work with senior management to modify first-touch messaging based on research.</span></li><li><span>Write new copy for the company product site.</span></li><li><span>Work with our SEO agency to determine content gaps and write copy to fill them.</span></li><li><span>Research long-form site article ideas and present to management for writing approval.</span></li><li><span>Research short-form blog article ideas and present to management for writing approval.</span></li><li><span>Anything else we think you would succeed at and would help the company.</span></li></ul><div></div><div><strong><br></strong></div><div><strong>Qualifications:</strong><br></div><div></div><ul><li><span>Creativity, intelligence, and affinity for a good turn of phrase.</span></li><li><span>Experience with marketing or sales copy is ideal.</span></li></ul><div></div><div><br></div><div>The perfect match is an articulate individual with an interest in internet technology and marketing. You will have the opportunity to collaborate with excellent professionals, internally and externally. This is your opportunity to see how a distributed team of professionals works to build, support, and advance a software as a service platform.&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>• Send an email to jobs @ simpletexting.net with a few non-boilerplate sentences about yourself and why you're the right person for this opportunity. • Include a one-page PDF resume along with a writing sample and/or a link to your portfolio.• Include 3-5 questions that you’d like to ask us after reviewing our website and this job ad.• Include the phrase “I like guacamole” in the subject line of your email.</p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vLSzFPm8T9OzfdX0Sg2t6w",
    "url": "https://remote.co/job/content-writer-21/",
    "title": "Content Writer",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "EmoryDay LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 5:54:15 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Content Writer at <span>EmoryDay LLC</span></h2><div><span><i></i> Remote</span>         | <span> Freelance </span> | <span> Part-time </span></div><div>            <p>EmoryDay is looking for talented Content Writers who can provide editorial expertise to join our team of freelance digital marketing staff. In this position you will be working with various team members to create and edit dynamic content that will enhance our EmoryDay’s marketing initiatives.</p><p>As a full service Internet marketing company, we provide business marketing services to companies in need of a full service outsourced solution. Our teams meet with our clients regularly to progressively improve and manage all aspects of their Internet marketing, including:</p><ul><li>Website Design</li><li>Content Development</li><li>Lead Generation</li><li>Search Engine Marketing</li><li>Newsletters</li><li>Social Media &amp; Publicity</li></ul><p><strong>Skills:</strong></p><p>Our ideal candidate has at least 2+ years of copywriting experience for online media or within an agency setting.</p><ul><li>Bachelor’s Degree in Journalism, English, Advertising, Communications or related field</li><li>Exceptional writing and editing skills, particularly for web and digital channels</li><li>Ability to write compelling subject lines, headlines, copy and call to actions</li><li>Excellent communication skills</li><li>Demonstrated ability to manage multiple competing priorities under tight deadlines</li><li>Highly organized with strong attention to details</li><li>Experience with SEO and a content management system (CMS)</li><li>Ability to create Keywords and Metatags</li></ul><p><strong>Responsibilities:</strong></p><ul><li>Write, edit and proofread website content</li><li>Write headlines, promotional copy, editorial content, etc for all wesite updates</li><li>Write subject lines, headlines, promotional copy and call to actions for digital campaigns such as email campaigns, social media ads, display ads, etc.</li><li>Incorporate clear, concise and compelling content that meets SEO and digital marketing best practices</li><li>Can be flexible with tone and voice to suit the audience based on the project at hand</li><li>QA site, email and digital content to ensure copy, images, hyperlinks, and other assets meet branding guidelines and are fully functional</li><li>Take ownership of assigned accounts and help lead content development iniatives per the direction of the assigned acccount manager</li><li>Be available for the occasional client conference call to discuss content development strategy</li></ul><p><strong>Work Environment:</strong></p><p>All of our consultants and employees work virtually. The opportunity provides a certain amount of flexibility timing and the number of hours worked. Most of our consultants work from home offices and each provide their own computers to work from.</p><p><strong>Compensation:</strong></p><p>The compensation for the position is flexible based on experience, availability and number of projects you would like to work on.</p>        </div><div>        <a href='http://www.emoryday.com/content-writer' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xZZfV7WKQkajbuqkPorzrw",
    "url": "http://workinstartups.com/job-board/job/72525/community-management-assistant-work-from-home-at-365-talent-portal/",
    "title": "Community Management Assistant - Work from Home",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=16, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "365 Talent Portal",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 12:23:02 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Are you a student or a recent graduate?<br />Would you like to develop your community management, administrative and customer service skills?<br />Are you looking for an opportunity to learn how to create and manage your own projects?<br />Would you like an interesting career start in a dynamic start-up environment?<br /><br />If you do, please read on!<br /><br />We are looking for a new Community Manager who will responsible for managing and adding value to our community of members. This is a versatile role involving administration, coordination, communication, marketing and customer service. Full training and support will be provided!<br /><br />*Job Description*<br /><br />The Community Manager will be responsible for the management and growth of our community of IT consultants. <br /><br />Key responsibilities are:<br /><br />- Building and maintaining our administrative records.<br />- Being the main point of contact for our consultant-members and for the consultants who are interested in joining our platform.<br />- Learning to create and run online campaigns to attract new consultants to our portal.<br />- Learning to provide our members with profile, CV or career advice.<br />- Being the main point of contact for our community of consultants.<br />- Tracking and processing requests for access to the training and professional services we provide.<br />- Supporting the efforts of our talent team and learning how to help our customers find candidates for their roles.<br /><br />Reports to: Product Director.<br /><br />Work Environment:<br />We are based in London. You will be given the option to either work from home or to work from our London offices. We meet on a regular basis, talk few times a day on the phone, exchange emails, IM and talk through social media. <br /><br />Hours:<br />This role requires that you work at least 20 hours per week. However, we are not a 9 to 5 organisation and you would be given the choice of performing your work at the hours that suit you. <br /><br />*The Company*<br /><br />365 Talent Portal is an international career hub for Microsoft technology consultants and the companies that need to hire them. Our company is a fast growing start-up which has members in 115 countries across the globe. We work with small and medium businesses and multi-national organisations.<br /><br />We’re a friendly group of people who have built a participative working environment where everyone can contribute and learn from each other. We value good communication, hard work, lots of fun, great ideas (but good ideas work for us as well!), and self-motivation. We also help our team members blossom through regular coaching, guidance, and advice.<br /><br />What we can offer you:<br />- A flexible work environment with the possibility to work from home at the hours you want.<br />- The opportunity to work and earn an income while studying or working on other part-time projects.<br />- The chance to learn or perfect sought-after skills such as community management and customer service.<br />- Thorough, ongoing training and support to help you reach your goals.<br />- An energetic team of qualified professionals who are always happy to help.<br /><br />*Profile and qualifications*<br /><br />We need team members who can take responsibility for their own workload and who are able to seek support when they need it. Some community management, customer service or recruitment experience would be an advantage, but we will consider anyone who has the right attitude and skills.<br /><br />Skills required:<br />- Excellent written and spoken communication skills.<br />- Good at analysing, tracking and organising data in spreadsheets.<br />- Customer service mindset.<br />- Interest for marketing activities.<br />- Interest for the IT recruitment sector / IT recruitment practices.<br />- Desire to learn about campaign/project management.<br />- Problem-solving attitude and ability to come-up with new ideas and suggestions.<br />- Self-motivated and responsible <br /><br />• You must be based in and eligible to work in the UK (London-based candidates preferred)<br />• You must be able to speak and write English fluently<br /><br />Compensation<br /><br />The compensation for this role is based on the amount of new consultant registrations and of new requests for access to the training services. You can expect to earn an average of £400-500 per month over the first few months. You will be provided with tools and opportunities to progressively increase your income.<br /><br />*How to apply*<br /><br />If you are interested, send us your CV and a cover letter explaining why you think you would be a good candidate. Please note that applications which don’t include a cover letter will not be considered.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "k7OTag9ERS-cst9UbN3lGg",
    "url": "https://feeds.feedblitz.com/~/566844748/0/problogger/jobs~Lead-Content-Editor/",
    "title": "Lead Content Editor",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:drupal/php/5",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=10, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Wealth Noir",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Lead Content Editor</h2><div>Company: Wealth Noir</div>Location: Remote / Anywhere<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><b>Employment Status:</b><span> Freelance Independent Consultant to Hire; 1099 Position with possibility for hire</span></p><p><b>Wealth Noir’s Mission</b></p><p><span>Wealth Noir Media is focused on bringing great content to improve the lives of African-Americans and underrepresented millennials. Our newest site, </span><a href='https://www.wealthnoir.com/' rel='nofollow'><span>Wealth Noir</span></a><span>, focuses on helping accredited investors and high-income millennials build wealth to achieve financial freedom and generational wealth. </span><a href='https://www.singleblackmale.org/' rel='nofollow'><span>SingleBlackMale</span></a><span> has been around since 2007 producing high quality love and dating content for black millennials, but will be relaunching with a new look and staff in 2018. </span><a href='https://www.damienpeters.com/' rel='nofollow'><span>DamienPeters.com</span></a><span> covers the technology sector, diversity in tech, and a look inside the heart and soul of our company and mission. We are a new startup focused on media and financial services for underrepresented millennials and are working to grow our media business. We are 100% remote with flexible work hours. Join us in shaping a new future for underrepresented millennials by bringing education and community to our audience.</span></p><p><b>Position Summary</b></p><p><span>The Lead Content Editor position will be responsible for creating content for the Wealth Noir Digital platform. &nbsp;The Editor will manage and guide current writers through the editing process, and will own the content schedule for WealthNoir.com. &nbsp;Over time, this role may grow to include editing responsibilities of Wealth Noir Financial and SingleBlackMale.org.</span></p><p><b>Editing/Content Management Duties</b></p><ul><li><span>Manage content schedule to determine when articles run on Wealth Noir.</span></li><li><span>Edit written content for clarity, style, and fit within Wealth Noir editorial guidelines.</span></li><li><span>Define and finalize editorial guidelines.</span></li><li><span>Fact-check documents.</span></li><li><span>Collaborate with Social Media Coordinator and Email Marketing Lead around marketing of each new piece of published content.</span></li><li><span>Perform SEO research to choose keywords for a post and ensure post follows SEO best practices.</span></li><li><span>Tag and categorize content within existing content taxonomy.</span></li><li><span>Some basic image editing and placement for distribution on Pinterest and other social media sites.</span></li></ul><p><b>Managerial Responsibilities</b></p><ul><li><span>Manage a remote team of writers and contributors.</span></li><li><span>Recruit, hire, and train new staff and guest writers.</span></li><li><span>Develop collaborative relationships with Social Media Coordinator and Email Marketing Lead around marketing of each new piece of published content.</span></li><li><span>Provide input and guidance on long-term content direction of Wealth Noir against the company’s mission.</span></li></ul><p><b>Minimum Qualifications</b></p><ul><li><span>Bachelor’s degree in Journalism, Marketing, Communications, Finance, or related field.</span></li><li><span>3 years’ experience in digital content creation, editing, and publishing.</span></li><li><span>1 years’ experience as a manager.</span></li><li><span>Writing portfolio of published articles directly related to the personal finance field.</span></li><li><span>Experience with Content Management systems (WordPress, Drupal, etc). &nbsp; &nbsp; &nbsp; </span></li><li><span>Familiarity with Associated Press writing style.</span></li><li><span>Experience in Financial Services; or, demonstrable interest in personal finances.</span></li><li><span>Basic knowledge of digital marketing related to digital content, including analytics and tracking.</span></li><li><span>Passion for increasing access to wealth education in underre</span><span>presented minority communities.</span></li><li><span>Ability to coach and motivate other writers to produce strong digital media content.</span></li></ul><p><b>Preferred Qualifications</b></p><ul><li><span>Master’s degree in Journalism, Marketing, Communications, Finance, or related field.</span></li><li><span>3 years’ experience managing editorial teams.</span></li><li><span>Experience managing a remote team of writers.</span></li></ul><p><b>Work Environment</b></p><p><span>This position will work remotely from the employee’s home office.</span></p><p><b>Position Type/Expected Hours of Work</b></p><p><span>This position is expected to work 6 hours/wk. to start, increasing to 15 – 30 hours as the business grows. &nbsp;Position may work flexible hours, but will be expected to meet publishing deadlines and make regular progress on long-term projects.</span></p><p><b>Travel</b></p><p><span>No travel is associated with this position. </span></p><p><b>Work Authorization/Security Clearance</b></p><p><span>You must be eligible to work in the United States</span></p><p><b>AAP/EEO Statement</b></p><p><span>Wealth Noir is an Equal Employment Opportunity organization. We do not discriminate on the basis of race, gender, sexual orientation or any other protected class.</span></p><p><b>Other Duties</b></p><p><span>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. </span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vVVMGpxNRx6drp3C1Miycw",
    "url": "https://problogger.com/jobs/job/lead-content-editor/",
    "title": "Lead Content Editor",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:drupal/php/5",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=10, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Wealth Noir",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Lead Content Editor</h2><div>Company: Wealth Noir</div>Location: Remote / Anywhere<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><b>Employment Status:</b><span> Freelance Independent Consultant to Hire; 1099 Position with possibility for hire</span></p><p><b>Wealth Noir’s Mission</b></p><p><span>Wealth Noir Media is focused on bringing great content to improve the lives of African-Americans and underrepresented millennials. Our newest site, </span><a href='https://www.wealthnoir.com/' rel='nofollow'><span>Wealth Noir</span></a><span>, focuses on helping accredited investors and high-income millennials build wealth to achieve financial freedom and generational wealth. </span><a href='https://www.singleblackmale.org/' rel='nofollow'><span>SingleBlackMale</span></a><span> has been around since 2007 producing high quality love and dating content for black millennials, but will be relaunching with a new look and staff in 2018. </span><a href='https://www.damienpeters.com/' rel='nofollow'><span>DamienPeters.com</span></a><span> covers the technology sector, diversity in tech, and a look inside the heart and soul of our company and mission. We are a new startup focused on media and financial services for underrepresented millennials and are working to grow our media business. We are 100% remote with flexible work hours. Join us in shaping a new future for underrepresented millennials by bringing education and community to our audience.</span></p><p><b>Position Summary</b></p><p><span>The Lead Content Editor position will be responsible for creating content for the Wealth Noir Digital platform. &nbsp;The Editor will manage and guide current writers through the editing process, and will own the content schedule for WealthNoir.com. &nbsp;Over time, this role may grow to include editing responsibilities of Wealth Noir Financial and SingleBlackMale.org.</span></p><p><b>Editing/Content Management Duties</b></p><ul><li><span>Manage content schedule to determine when articles run on Wealth Noir.</span></li><li><span>Edit written content for clarity, style, and fit within Wealth Noir editorial guidelines.</span></li><li><span>Define and finalize editorial guidelines.</span></li><li><span>Fact-check documents.</span></li><li><span>Collaborate with Social Media Coordinator and Email Marketing Lead around marketing of each new piece of published content.</span></li><li><span>Perform SEO research to choose keywords for a post and ensure post follows SEO best practices.</span></li><li><span>Tag and categorize content within existing content taxonomy.</span></li><li><span>Some basic image editing and placement for distribution on Pinterest and other social media sites.</span></li></ul><p><b>Managerial Responsibilities</b></p><ul><li><span>Manage a remote team of writers and contributors.</span></li><li><span>Recruit, hire, and train new staff and guest writers.</span></li><li><span>Develop collaborative relationships with Social Media Coordinator and Email Marketing Lead around marketing of each new piece of published content.</span></li><li><span>Provide input and guidance on long-term content direction of Wealth Noir against the company’s mission.</span></li></ul><p><b>Minimum Qualifications</b></p><ul><li><span>Bachelor’s degree in Journalism, Marketing, Communications, Finance, or related field.</span></li><li><span>3 years’ experience in digital content creation, editing, and publishing.</span></li><li><span>1 years’ experience as a manager.</span></li><li><span>Writing portfolio of published articles directly related to the personal finance field.</span></li><li><span>Experience with Content Management systems (WordPress, Drupal, etc). &nbsp; &nbsp; &nbsp; </span></li><li><span>Familiarity with Associated Press writing style.</span></li><li><span>Experience in Financial Services; or, demonstrable interest in personal finances.</span></li><li><span>Basic knowledge of digital marketing related to digital content, including analytics and tracking.</span></li><li><span>Passion for increasing access to wealth education in underre</span><span>presented minority communities.</span></li><li><span>Ability to coach and motivate other writers to produce strong digital media content.</span></li></ul><p><b>Preferred Qualifications</b></p><ul><li><span>Master’s degree in Journalism, Marketing, Communications, Finance, or related field.</span></li><li><span>3 years’ experience managing editorial teams.</span></li><li><span>Experience managing a remote team of writers.</span></li></ul><p><b>Work Environment</b></p><p><span>This position will work remotely from the employee’s home office.</span></p><p><b>Position Type/Expected Hours of Work</b></p><p><span>This position is expected to work 6 hours/wk. to start, increasing to 15 – 30 hours as the business grows. &nbsp;Position may work flexible hours, but will be expected to meet publishing deadlines and make regular progress on long-term projects.</span></p><p><b>Travel</b></p><p><span>No travel is associated with this position. </span></p><p><b>Work Authorization/Security Clearance</b></p><p><span>You must be eligible to work in the United States</span></p><p><b>AAP/EEO Statement</b></p><p><span>Wealth Noir is an Equal Employment Opportunity organization. We do not discriminate on the basis of race, gender, sexual orientation or any other protected class.</span></p><p><b>Other Duties</b></p><p><span>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. </span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PB9ZCJCCTkiV3xKEXSIxdw",
    "url": "https://angel.co/forkable/jobs/129540-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "New York City",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Forkable",
      "sameAs": ""
    },
    "salary": {
      "currency": "$",
      "minValue": 40000,
      "maxValue": 80000,
      "info": "0.0% – 1.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 1:49:48 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>New York City, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "-tMDtTqTQ9KuqYrvL-rYWA",
    "url": "https://angel.co/forkable/jobs/129538-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Forkable",
      "sameAs": ""
    },
    "salary": {
      "currency": "$",
      "minValue": 40000,
      "maxValue": 80000,
      "info": "0.0% – 1.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 1:49:48 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>San Francisco, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3UK9cDTsSfGxrIbw7m7QxQ",
    "url": "https://angel.co/forkable/jobs/129541-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "tags": [
      "Chicago",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Forkable",
      "sameAs": ""
    },
    "salary": {
      "currency": "$",
      "minValue": 40000,
      "maxValue": 80000,
      "info": "0.0% – 1.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 1:49:48 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>Chicago, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "D9LKUo9WRHuVIdJ0KvVNfw",
    "url": "https://angel.co/forkable/jobs/129539-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Los Angeles",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Forkable",
      "sameAs": ""
    },
    "salary": {
      "currency": "$",
      "minValue": 40000,
      "maxValue": 80000,
      "info": "0.0% – 1.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 1:49:48 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>Los Angeles, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6Tvn-E3NSm6sDlEEFBbhYQ",
    "url": "https://weworkremotely.com/remote-jobs/coshx-technical-sales-rep",
    "title": "Coshx : Technical Sales Rep",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Coshx",
      "sameAs": "http://www.coshx.com"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 8:23:53 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Technical Sales Rep</h2><span>Company: Coshx<br></span><span>Headquarters: Charlottesville, VA<br></span><span>www.coshx.com<br><br></span>  <div>    <div><span></span></div><div><span>The ideal candidate is ready to take the next step in their career by achieving the following goals:</span><br></div><div></div><ul><li><span>Landing a technical solutions meeting with a lead in 30 days.</span><br></li><li><span>Landing &nbsp;2-5 technical solutions meetings per month.</span><br></li><li><span>Devising, pitchinging, and carrying out an evidence-based sales strategy in first 3 months.</span><br></li><li><span>Generating 850k of revenue in the first 12 months.</span><br></li><li><span>Enhancing and expanding marketing channels.</span><br></li><li><span>Tracking customer interactions.</span><br></li></ul><div><br></div><div><span>Position overview: </span><br></div><div></div><ul><li><span>Increase customer base and develop customer contacts</span><br></li></ul><ul><li><span>Sell and promote mobile, web development, and cloud services</span><br></li><li><span>Manage all processes involved with selling the above services to new clients (including but not limited to prospecting, meeting scheduling, and contract negotiation).</span><br></li><li><span>Develop relationships with individual customers and sell to various industries.</span><br></li></ul><ul><li><span>Provides management with complete, current and accurate data on applicable customer activity.</span><br></li></ul><ul><li><span>Demonstrate effectiveness by consistently hitting or exceeding monthly/yearly objectives.</span><br></li><li><span>Provide input to development of business goals and recommendations for new business areas</span><br></li><li><span>Drive penetration into market through various means including email, telephone, and in-person.</span><br></li></ul><div><br></div><div><span>Necessary skills/aptitudes:</span><br></div><div></div><ul><li><span>Bachelor's degree in Business, technology or related field.</span><br></li><li><span>Minimum of 2 years business development, sales or technical sales experience.</span><br></li><li><span>Ability to recognize opportunities successfully to negotiate and close deals.</span><br></li><li><span>Strong leadership skills and a desire to succeed.</span><br></li><li><span>Excellent communication (oral and written) and organizational skills.</span><br></li></ul><div><br></div><div><span>Job Type: Full-time</span><br></div><div></div><div><span>Salary: Monthly salary of $6,600</span><span> during two months training period. Thereafter, $60k annual salary with commission up to $100k/year, assessed as 10% of revenue over all managed accounts.</span></div><div><span>***Health Insurance, Dental and 401k </span></div><div><br></div><div><span>Location:</span><br></div><div></div><ul><li><span>U.S. based remote position</span><br><br></li></ul><div><span>Required work authorization:</span><br></div><div></div><ul><li><span>United States</span><br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send your resume to <a href='mailto:sales@coshx.com' rel='nofollow'>sales@coshx.com</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pgEhlmo9S_KinkFGkzkLNA",
    "url": "https://remote.co/job/reporter-higher-education/",
    "title": "K-5 Math Item Writer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "IXL Learning",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 5:21:01 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>K-5 Math Item Writer at <span>IXL Learning</span></h2><div><span><i></i> Remote</span>         | <span> Freelance </span> | <span> Part-time </span></div><div>            <p><strong>Curriculum Design</strong></p><p><strong>Remote</strong></p><p>Are you ready to join a team that is shaping the future of educational technology? IXL Learning, a leading edtech company with products used by 6 million students worldwide, is seeking talented writers to create exceptional math content for elementary school students.</p><p>As a math item writer at IXL, you’ll create engaging word problems for K-5 students. Your strong writing skills and educational insight will assist in the success of our math product. Come join our mission to create the best educational content possible!</p><p><strong>This is a remote, contract position with the flexibility to be part-time or full-time.</strong></p><p><strong>WHAT YOU’LL BE DOING</strong></p><ul><li>Write math word problems with clear explanations that create a delightful learning experience</li><li>Brainstorm themes that are interesting and fun for elementary school students</li><li>Use age-appropriate language and sentence structure</li><li>Participate in a peer review process with the math curriculum design team</li></ul><p><strong>WHAT WE’RE LOOKING FOR</strong></p><ul><li>Clear writing style with a creative flair</li><li>Understanding of age-appropriate sentence structure and vocabulary</li><li>Ability to relate to K-5 students</li><li><strong>BA/BS degree, preferably in math or elementary education</strong></li><li>Prior item writing experience is preferred</li><li>Knowledge of K-5 math curriculum and standards is preferred</li></ul><p><strong>WHAT TO INCLUDE IN YOUR APPLICATION</strong></p><ul><li>Your resume</li><li>A cover letter under 600 words, so that we can get to know you better</li></ul><p><strong>ABOUT IXL</strong></p><p>IXL Learning is a leading educational technology company on a big mission: delivering an immersive learning experience to all students, in all grades and subjects, in schools and homes worldwide. With 1 in 8 U.S. students already learning on IXL (answering over 50 million questions every day!), IXL inspires educators and learners around the world and is changing how students feel about learning and about themselves.</p>        </div><div>        <a href='https://www.ixl.com/company/jobs?p=job/oi185fwg' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CWZ10CyPTcOEfZtc-wSSCQ",
    "url": "https://www.remoteage.com/remote-jobs/technical-writer-britecore/",
    "title": "Technical Writer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "BriteCore",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 5:13:45 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Technical Writer</h2><div>Worldwide</div><div>Company: BriteCore<p></p></div><div>FULL-TIME</div><div><h3>Overview</h3><h2><strong>About BriteCore&nbsp;</strong></h2><p>BriteCore is a rapidly expanding, modern insurance software company that emphasizes work-life balance. We have around 150 employees and a growing workforce, both nationally and internationally. If you are looking to join a 100%-remote company that offers unlimited paid-time off and premiums for medical insurance fully paid for, apply below. We look forward to your submission.</p><h2><strong>Requirements</strong></h2><p>Sales Writers are responsible for completing inbound Requests For Information (RFIs) and Requests for Proposals (RFPs) from customers. BriteCore participates in roughly 20–30 formal RFIs each year. Writers have access to a database of prior questions and answers to help complete these requests; however, each submission is still tailored to the individual client.</p><p>Additionally, Sales Writers assist with writing BriteCore scripts that are used for training and marketing videos as well as training for conducting live demos. Writers will be required to research current and new BriteCore features, services, and products and communicate functionality of those features, services, and products to customers and potential customers.</p><h2><strong>Qualifications</strong></h2><ul><li>3+ years of experience</li><li>Comfortable working in the insurance field</li><li>Able to self start and seek out solutions independently</li><li>A working knowledge of Slack and the Google Suite of products</li></ul><p><strong>BriteCore is an equal opportunity employer. We celebrate diversity and are committed to creating an open and inclusive environment for all employees.</strong></p><p></p><div> <a href='https://hire.withgoogle.com/public/jobs/britecorecom/view/P_AAAAAAEAADyFc0hmEreKMS' rel='nofollow'>Apply for job</a></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pDmfyL2vSby7hlYQPiCnaw",
    "url": "https://remote.co/job/writers-editors/",
    "title": "Writers -Editors",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Great Place to Work Institute",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 5:06:14 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Writers -Editors at <span>Great Place to Work Institute</span></h2><div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p><strong>Department:</strong>&nbsp;Branding</p><p><strong>Location:</strong>&nbsp;Oakland, CA</p><p><strong>REPORTS TO:&nbsp;</strong><strong>Chief Content Officer</strong></p><p><strong>Great Place to Work&nbsp;</strong>is a global research, consulting and training firm that helps organizations identify, create and sustain great workplaces through the development of high-trust workplace cultures. We serve businesses, non-profits and government agencies in almost 50 countries on six continents. Our clients are those companies and organizations that wish to maintain Best Company environments, those that are ready to dramatically improve the culture within their workplaces, and those in between the two. Organizations that build trust and create a rewarding cycle of personal contribution and appreciation create workplace cultures that deliver outstanding business performance.</p><p><strong>Position Summary</strong></p><p>We are seeking highly-motivated writers and editors to work with other members of our content team to tell the stories of our clients and help tell the world why every company should focus on becoming a Great Place to Work For All. This role reports to the Chief Content Officer and will be a hybrid of editing and writing with a strong emphasis on co-authoring research reports and frequent contributions to the Great Place to Work website.</p><p>The ideal candidate should have a deep understanding of workplace culture, possess a discerning eye with meticulous attention to detail, and honor the golden rules of fact-checking. An understanding of the world of corporate human resources is beneficial but not required.<strong>&nbsp;This position may be based in our headquarters in Oakland, California, or can be remote.</strong></p><p>A high degree of collaboration is required with other members across the organization, including the brand, demand gen, marketing, and data/list teams. The candidate should think and act like a journalist, have fluency with business and financial data, possess excellent analytical and problem-solving skills, and be able to manage multiple projects concurrently.</p><p><strong>Primary Responsibilities</strong></p><ul><li>Interview executives and other sources to tell the story of their company’s culture</li><li>Write frequent thought pieces and articles for the website and social channels</li><li>Develop story ideas from our internal research database and Best Workplaces lists and write contributed articles to be published by our media partners</li><li>Contribute to brand newsletters and marketing campaigns</li><li>Edit contributed pieces submitted by our network of industry thought leaders and C-suite executives</li><li>Write press releases for our list and research team</li><li>Collaborate with our Events team to develop content for the annual Great Place to Work For All Summit</li></ul><p><strong>Experience Requirements</strong></p><ul><li>Education/Formal Training: BA degree required</li><li>5+ years as a journalist, writer, or editor</li><li>Prior background in workplace culture or human resources</li><li>Excellent writing, editing, and communication skills</li><li>Knowledge of how to link employee survey data to HR and business metrics in order to demonstrate the relationship between great workplaces and superior business performance</li></ul><p><strong>Skills and Abilities Required for Success</strong></p><ul><li>Proven project management experience</li><li>Strong organizational skills and attention to detail</li><li>Proven ability to manage virtual project teams</li><li>Ability to work independently</li><li>Expert in Microsoft Word, Excel, and PowerPoint</li><li>Strong collaborative relationship-building skills</li><li>Excellent writing, editing, and communication skills</li><li>High energy and sense of humor</li></ul>        </div><div>        <a href='https://www.greatplacetowork.com/careers' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6x-gq6tcQCay5r21lTZLnA",
    "url": "https://cjl.ist/2woJYXA",
    "title": "Community Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 2:54:28 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Community Manager</h2>   Location:    Remote    Remote  <div>  Role and job type: Full-time </div> <div>  <h3>Job Description</h3>  <p>You will be in charge of executing the community and social media strategy set by the communication and grant management team, including managing and moderating our social channels, organizing events, as well as co-writing articles and blog posts.</p>  <p>The ideal candidate is highly self-motivated, detail oriented, able to take feedback and constructive criticism positively, has exceptional communication skills, has an in-depth knowledge of blockchain social media channels and a has a proactive mindset to help us manage our growing community. Along the way, you will be supported by our team of strategists and grant managers, who will be helping out and setting you up for success.</p>  <h4>Why you should join us</h4>  <p>As well as having a reputable and highly visible role in the industry, you will establish an inside view in the ever-evolving blockchain industry and connections to the decentralized technology ecosystem. You will have the opportunity to learn from and collaborate with the greatest and brightest minds in the blockchain space.<br>You will be working with a multi-cultural team of people from all backgrounds, so don’t let the lack of technical knowledge keep you from applying, we can bring you up to speed!</p>  <h4>What you will be working on</h4>  <ul>   <li>Grow the community by generating content and engaging with a diverse audience</li>   <li>Manage the ECF social media communities (Twitter, public chat, Reddit, etc.). </li>   <li>Manage press relationships and press clippings </li>   <li>Monitor events in the ecosystem and identify relevant ones to ECF, including speaking opportunities </li>   <li>Help coordinate and organize community events around the world</li>   <li>Collaborate with the rest of the communications team to create compelling content</li>   <li>Track and report growth and engagement across social media channels</li>   <li>Assist team members with proofreading and editing</li>   <li>Make sure that the team has all the materials they need for public presentations (e.g. monitor and proofread their slides, fix the layout)</li>   <li>Assist with AMA sessions and community broadcasts on different channels.</li>   <li>Assist with FAQs, Wiki, etc.</li>  </ul>  <h4>Requirements</h4>  <ul>   <li>Extremely self-driven and able to execute in a diligent manner</li>   <li>Excellent communication (both written and verbal) skills</li>   <li>Passionate about the potential and future of decentralized technologies</li>   <li>Record of participation in the blockchain communities</li>   <li>Highly organized and detail-oriented</li>   <li>A quick responder to email and other communications–you’re motivated and excited to stay on top of things</li>   <li>Understanding of Ethereum community and the blockchain ecosystem</li>   <li>Experience in social media management, content generation, and events organization</li>   <li>Open-mindedness to feedback and suggestions from the ECF members and co-workers</li>   <li>Great redaction skills - previous experience in editorial writing is a plus</li>  </ul>  <h4>How to apply</h4>  <p>Please email your resume along with a short cover letter explaining why you are interested in ECF and why you would be a good fit to the role.</p>  <h4>Salary range</h4>  <p>Competitive</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5TByXW5hTTybaNyAuPmhtg",
    "url": "https://feeds.feedblitz.com/~/566795676/0/problogger/jobs~Experienced-Content-Writers-Wanted-Versatile-Writers-for-eCommerce-and-Blogs/",
    "title": "Experienced Content Writers Wanted: Versatile Writers for eCommerce and Blogs",
    "tags": [
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "eZdia Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Experienced Content Writers Wanted: Versatile Writers for eCommerce and Blogs</h2><div>Company: eZdia Inc</div>Location: Home Based<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><span>Do you have a solid work ethic? Do you stick to deadlines? Do you enjoy writing copy for blogs and eCommerce websites? If you answered “yes” to these questions, we’d love to hear from you.</span></p><p><span>CrewMachine is looking for experienced writers to create high-level copy for some of the biggest eCommerce companies around. We have a range of ongoing projects in immediate need of solid writers, including product content, blogs, and buying guides. If your application is successful, you could be working on anything from product descriptions and landing pages to buying guides and blurbs relating to tech, fashion, home goods, hardware tools, office supplies, and more. &nbsp;</span></p><p><span>The application process is simple, but rigorous. We are looking for the best to join our team.</span></p><p><span>We need contributors who:</span></p><ul><li><span>Are native to USA, CA, AU, or UK with English as their first language</span></li><li><span>Can produce compelling and flawless copy </span></li><li><span>Are familiar with SEO</span></li><li><span>Can follow instructions</span></li><li><span>Can positively accept and apply feedback</span></li><li><span>Can stick to deadlines</span></li><li><span>Have experience writing product copy</span></li><li><span>Submit only unique content</span></li><li><span>Are capable of doing thorough research</span></li><li><span>Understand what a reputable source is</span></li></ul><p><span>Get started by taking our mini test: </span><a href='https://goo.gl/AvapjZ' rel='nofollow'><b>https://goo.gl/AvapjZ</b></a></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "BjjdVqJ-Spyi4Nv2CA7QGw",
    "url": "https://feeds.feedblitz.com/~/566835924/0/problogger/jobs~Long-form-content-writer-related-to-USA-Immigration-and-Student-Visa/",
    "title": "Long form content writer related to USA Immigration and Student Visa",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SimpliVentures",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Long form content writer related to USA Immigration and Student Visa</h2><div>Company: SimpliVentures</div>Location: India<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p>We are looking for a freelance content/article writer to write for our USA Student Visa &amp; General USA Immigration blog based out of India</p><p>We will provide an outline and the writer would do more independent research and expand that outline into an article.</p><p>Some experience related USA Student Visa Or USA Immigration process is a must.</p><p>You can work from your home.</p><p>We would prefer someone who is in India or Indian in US since that’s the experience and perspective we are looking for.</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3MZQoDkSRlmdro0mDzGC-Q",
    "url": "https://problogger.com/jobs/job/experienced-content-writers-wanted-versatile-writers-for-ecommerce-and-blogs-3/",
    "title": "Experienced Content Writers Wanted: Versatile Writers for eCommerce and Blogs",
    "tags": [
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "eZdia Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Experienced Content Writers Wanted: Versatile Writers for eCommerce and Blogs</h2><div>Company: eZdia Inc</div>Location: Home Based<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><span>Do you have a solid work ethic? Do you stick to deadlines? Do you enjoy writing copy for blogs and eCommerce websites? If you answered “yes” to these questions, we’d love to hear from you.</span></p><p><span>CrewMachine is looking for experienced writers to create high-level copy for some of the biggest eCommerce companies around. We have a range of ongoing projects in immediate need of solid writers, including product content, blogs, and buying guides. If your application is successful, you could be working on anything from product descriptions and landing pages to buying guides and blurbs relating to tech, fashion, home goods, hardware tools, office supplies, and more. &nbsp;</span></p><p><span>The application process is simple, but rigorous. We are looking for the best to join our team.</span></p><p><span>We need contributors who:</span></p><ul><li><span>Are native to USA, CA, AU, or UK with English as their first language</span></li><li><span>Can produce compelling and flawless copy </span></li><li><span>Are familiar with SEO</span></li><li><span>Can follow instructions</span></li><li><span>Can positively accept and apply feedback</span></li><li><span>Can stick to deadlines</span></li><li><span>Have experience writing product copy</span></li><li><span>Submit only unique content</span></li><li><span>Are capable of doing thorough research</span></li><li><span>Understand what a reputable source is</span></li></ul><p><span>Get started by taking our mini test: </span><a href='https://goo.gl/AvapjZ' rel='nofollow'><b>https://goo.gl/AvapjZ</b></a></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ARtwcUcrRdCBtfg1PFHNkw",
    "url": "https://remote.co/job/writer-29/",
    "title": "Writer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=10, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Main Street Alliance",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 7:06:48 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Writer at <span>Main Street Alliance</span></h2><div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p><strong>Location: Flexible,</strong>&nbsp;prefer Washington, D.C.</p><p><strong>General Purpose:</strong>&nbsp;Main Street Alliance (MSA) seeks a writer to support driving our communications and media work across the country.</p><p><strong>Position Overview:</strong>&nbsp;Main Street Alliance (501(c)(3)) and Main Street Alliance Action Fund (501(c)(4)) are seeking a talented, self-directed, writer to produce quick turn around, high quality communications and media pieces to support MSA/AF’s strategic communications plan. This will be a contract position to start, but could develop into a permanent staff position with MSA/AF for the right candidate.</p><p><strong>About Main Street Alliance:</strong>&nbsp;Main Street Alliance is a national network of state-based small business coalitions working to elevate the voices of small business owners on issues that impact their businesses, their employees, and the communities that they serve. Founded in 2008 to ensure that small business owners voices were heard in the campaign to win affordable health care, Main Street Alliance now works on a range of issues in cities and states across the country, our policy agenda includes tax and budget fairness, comprehensive immigration reform, money in politics issues and a variety of job quality issues. We are led by a diverse group of small business owners at the state and national levels.</p><p><strong>Responsibilities:</strong></p><ul><li><strong>Drive proactive national narrative.&nbsp;</strong>Use experience and skill to develop earned and paid media pieces that create powerful public narratives by elevating member voices in support of MSA/AF’s mission and campaigns.</li><li><strong>Execute sharp and strategic campaigns.</strong>&nbsp;Use your experience and skills to support narrative campaigns through use of variety of tactics including, but not limited to: rapid-response, print, video, radio, and digital communications. Draft op-eds, letters to the editor, press releases and statements, and other materials supporting MSA campaigns and narrative. Draw on narrative and messaging research that supports racial, economic, and gender justice framing. Provide writing support and coaching to MSA staff and leaders.</li><li><strong>Think outside the box. Improve on existing, traditional strategies and bring new edgy ideas to the team.</strong></li><li><strong>Make No Small Plans.</strong>&nbsp;But do make well-written ones. Work with team to develop monthly (and longer-term) work plans to drive work forward.</li><li><strong>Be inclusive.</strong>&nbsp;Recognize and appreciate different ways of working and being.</li><li><strong>Be proactive.</strong>&nbsp;Ask questions. Look for new ways to engage. Take ownership of your work and bring ideas to the table.</li><li><strong>Model our values and culture.</strong>&nbsp;Model optimism inside and outside the organization, and reinforce our core values and culture. Model transparent and accountable decision-making, and build this culture on staff.</li></ul><p><strong>Experience</strong></p><p><strong>The ideal candidate should have the following experience and qualifications:</strong></p><ul><li>At least 2 years of communications experience in journalism, public relations, campaign management or a related field. The ability to take policy and information and transform them into exciting and useful messages.</li><li>Excellent writing, editing and verbal communication skills.</li><li>Ability to produce high quality pieces on a fast timeline.</li><li>Demonstrated commitment to social and economic justice, especially work within immigrant communities and communities of color.</li><li>Self-starter, able to work independently as well as in a team; enjoys creating and implementing new initiatives.</li><li>Highly collaborative style; experience developing and implementing strategic communications strategies alongside a team.</li><li>Familiarity with digital and emerging media tools and openness to expanding skills in this area a plus.</li><li>Demonstrated experience using database management and analytics software, graphic and web design software a plus.</li><li>Ability to speak Spanish or other languages a plus.</li></ul><p><strong>Compensation</strong></p><p>Compensation is based on experience; please include desired range in cover letter.</p><p><strong><em>We are looking for committed, enthusiastic people with a sense of humor to join our organizing team!&nbsp;</em></strong>Main Street Alliance is committed to equal opportunity, and are considering applicants of all races, gender, ages, sexual orientations, national origins, ethnicities, religion, and abilities. We urge people of color, and experienced organizers and activists of all backgrounds, to apply.</p>        </div><div>        <a href='https://www.mainstreetalliance.org/jobs_internships' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "f9gf8nxESEWDgofvD0DBcg",
    "url": "https://stackoverflow.com/jobs/194854/content-engineer-content-modeling-metadata-a?a=13lzFlxaCEyk",
    "title": "Content Engineer (Content Modeling, Metadata, Markup,Topology,Schema,Taxonomy) at [A]  ",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:frontend-developer/frontend/13",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=22}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "[A]",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Content Engineer (Content Modeling, Metadata, Markup,Topology,Schema,Taxonomy)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Frontend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>IT Consulting</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: [A] | No office location<br></div><h3>Technologies</h3><div></div><div>taxonomy</div><div>metadata</div><div>schema</div><div>content-management-system</div><div>ontology</div>                <h3>Job description</h3>                <div><p><strong>Do you love making content intelligent? We are looking for content engineers to help make the world smarter with intelligent content.</strong></p><p>[A]&nbsp;seeks motivated candidates with experience in some of the following area. This is a client-facing role and we’re looking for candidates with a mix of experience in some of the following content disciplines:</p><ul><li>Modeling</li><li>Metadata</li><li>Markup</li><li>Topology</li><li>Schema</li><li>Taxonomy</li></ul><p>The role will involve work from mostly your home office but may involve occasional travel to a client location. <strong>Candidate must be a resident of the United States.</strong></p><p>The&nbsp;Content Engineer will work with our practice to craft intelligent content structure for multi-channel marketing and increase the value of semantically rich content. You will participate in, or lead, client projects surrounding customer experience management and personalization.</p><p>You’ll define content structure, metadata, content reuse planning, taxonomy, and other content relationships. This includes syndication strategy, search engine optimization (SEO) factors, semantic web schemas, and implementation planning for the CEM / CMS platforms such as Sitecore, Adobe, Kentico, and Episerver.</p><p><strong>What You’ll Be Doing</strong></p><ul><li>Structuring content through building content models, taxonomies and metadata definitions</li><li>Leading client discovery onsite, gathering details and organized data about the current state and desired future state</li><li>Educating clients on the value of intelligent content, workflows around Content Engineering, and related topics meant to build a client’s internal resources and capabilities</li><li>Bridging the gap for clients between content strategy, the CMS platforms, operations, and other customer experience technologies</li><li>Collaborate on information architecture and UX prototyping</li><li>Determine schema strategy and structural rules</li></ul><p><strong>Skills We Are Looking For</strong>&nbsp;<br>Not all listed skills are required for this role. We are looking for somebody who is experienced in some of the following areas.</p><ul><li>Exceptional writing, facilitation, and communication skills (required)</li><li>Detail oriented, organized, self-motivated (required)</li><li>Collaborate well across distributed team (required)</li><li>Experience with content models, taxonomies, schemas, adaptive content</li><li>Experience with any/all of the following: marketing software, content management systems (CMS), customer experience management systems (CEM), DITA, SEO, the semantic web</li><li>Working understanding of the digital publishing stack including HTML5, CSS, JSON and related JavaScript systems</li></ul><p><br><br>Learn more about [A] at&nbsp;<a href='http://simplea.com/' rel='nofollow'>simplea.com</a>.</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/194854?reset=False&amp;ra=13lzFlxaCEyk&amp;oqs=a%3D13lzFlxaCEyk' rel='nofollow'>Apply now</a></div>            <h3>About [A]</h3>            <div><p><strong>[A] is the Content Intelligence Service.</strong></p><p>[A] is a distributed, private, professional services firm that provides strategic support for building content intelligence practices into organizations. [A] helps complex organizations establish content engineering standards and practices to compete in a multichannel, multimodal, AI-driven world.</p><p>[A] engineers intelligent content systems for CMS/CEM platforms, and offers integration, training, workshops and custom development. [A] helps clients value content as an enterprise asset, and enables future-ready content through use of the Master Content Model.</p><p><strong>What’s Your Name, [A]gain?</strong></p><p>Our name is easy. Just say “A.” The [A] brackets represent markup, microdata, content intelligence. The letter “[A]” represents the start, initiation, beginning of change. We are going to help change the world with intelligent content.</p><p><strong>Cultural Fit at&nbsp;[A]</strong></p><ul><li>You love learning, you love teaching.</li><li>You enjoy wearing multiple hats and roles, and titles are not important to you.</li><li>You do top-quality work, manage quality, and make everything you touch better.</li><li>You are comfortable working under strict confidentiality agreements and often behind-the-scenes.</li><li>You are self-organized and manage time and resources well.</li><li>You work alone well but communicate well within a team.</li></ul><p><strong>[A] Team Benefits</strong></p><p>Being an [A]gent comes with its benefits. Work from anywhere. Advance your career on the leading-edge of the content and technology sciences. Earn a competitive salary, and for longtime [A]gents, participation in a profit-sharing plan. But many [A]gents find the best part of working as an [A]gent are the other [A]gents you work with and the culture at [A].</p><p>We take care of each other and we honor each other's work and contributions to the team. We work to make ourselves better and our [A] team better. We make efforts to adapt new technologies and methodologies that can help us optimize our time, and we expect you to collaborate on these efforts if you’re an expert on any of those fields. We communicate and reach out to other [A] players. &nbsp;We love learning. We love teaching. We write. We code. We support each other. For the right people, working at [A] feels like coming home.&nbsp;</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Remote Workforce</span>                            </li>                            <li>                                <span></span>                                <span>Competitive salary</span>                            </li>                            <li>                                <span></span>                                <span>Shared company performance incentives</span>                            </li>                            <li>                                <span></span>                                <span>Individual training budget</span>                            </li>                            <li>                                <span></span>                                <span>A well-documented career path</span>                            </li>                            <li>                                <span></span>                                <span>Flexible hours &amp; personal independence</span>                            </li>                            <li>                                <span></span>                                <span>Other benefits based on location.</span>                            </li>                            <li>                                <span></span>                                <span>401K</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OBMl8TjsSea5SoyMZycc5Q",
    "url": "https://remote.com/jobs/browse/preview/content-and-growth-manager",
    "title": "Content and Growth Manager",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Indiez",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 9:38:10 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />EXPERIENCE: expert<br /><br />COMPANY: Indiez; 200-500 employees; 75-100% remote;<br /><br />SKILLS:<br />• Analytics<br />• Blogs<br />• Content Management<br />• Content Strategy<br />• SEO/SEM<br /><br />About Indiez:<br /><br />The software is eating the world. Every day there's a new dent in the universe... a new tech product that changes how things are done. However, If you look closely most of the products are not market standards and give a far worse experience than the leading once. The world needs better products!<br /><br />Most of the businesses struggle to build quality software. This is because hiring is costly and outsourcing to IT development shops gives a substandard quality. There's no mission-driven work anywhere in most IT cos.<br /><br />IT outsourcing is a $450 Bn Industry. Although being such a gigantic industry, it is catching rust because of commoditised IT shops and fragmented market.<br /><br />On the other side, There's a great amount of amazing talent that is underutilized or is badly matched. Most of the talent is rotting in office while thinking about making that trip to satisfy their wanderlust. Where's freedom and fulfillment?<br /><br />Indiez is a hassle-free and reliable platform for businesses to get high-quality software built. We take projects and delivers them via our community of top class software talent and partner agencies. Fulfillment is guaranteed by Indiez.<br /><br />We have helped brands like Uber, Domino's, Mckinsey and Company, Aditya Birla, Make my Trip and many such esteemed companies build amazing products. We’ve been featured in TechCrunch and was awarded as top 5 startups in India by TechinAsia.<br /><br />Content has been the key to our growth. Our co-founder was the top writer on Medium under ‘Startup’, ‘Entrepreneurship’ and ‘Business’ category. Some of our blogs have received thousands of reads and shares. Check them out here -<br /><br />https://hackernoon.com/9-things-that-i-learnt-from-the-most-successful-serial-entrepreneurs-6f6680e72429<br /><br />https://hackernoon.com/7-minute-read-to-save-100-000-on-your-app-idea-2d17db675a1<br /><br />Interested in building software for the world while changing the way we work? Keep reading.<br />Check us out at www.indiez.io<br /><br />Apply by filling this form - https://airtable.com/shrxZirgNaZzSY52B<br /><br />You'll be responsible for:<br /><br />- Defining the brand voice and tone<br />- Building a strong brand<br />- Crafting our content strategy and implementing across all our communications.<br />- Pitch content and marketing ideas for blogs, videos<br />- Creating Content - Blog Posts, Case Studies, Emails.<br />- Hiring and managing relevant freelancers if required.<br /><br />What we're looking for?<br />- Belief in a world where everyone will be working from anywhere, anytime and on things that they like. #futureofowork<br />- A knack for writing quality content<br />- Proven track record of helping companies build strong brand connections by communicating well<br />- Knowledge of SEO and analytics<br />- Ambitious and can be a torchbearer of the movement.<br />- Bonus points if you’ve built a significant following for yourself through blogging or social media<br />- Ability to write content better than what we have been writing.<br />- Focus on Quality over Quantity<br /><br />Perks:<br />The ability to work from wherever you want. Whether you prefer traveling and working from exotic beaches or spending time with your family and working from home, the choice is yours.<br />Off-sites across the world. Indonesia, Mexico, Srilanka… Anywhere.<br />Invitations to frequent Indiez events going on around the world, including dinners, tech talks, conferences, and more.<br />Extremely competitive compensation.<br />A chance to be a superhero!<br /><br />Hiring Process<br />* You’ll have to fill this form first - https://airtable.com/shrxZirgNaZzSY52B<br />* Once you fill this form, if we like what you have been doing, we’ll invite you to write a blog post.<br />* The assignment will be a paid assignment. :slightly_smiling_face:<br />* If we like your writing style, we’ll invite you for a call interview.<br />* If all goes well, we’ll get going ASAP!",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "tOlRKSKSTOO34DfdFVe_lA",
    "url": "https://remoteok.io/jobs/68575",
    "title": "Community Manager",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Officeninjas",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 3:31:22 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Community Manager</h2></span><br><span><h3>Officeninjas</h3></span> <span>verified</span></td><div><div>**WHAT WE DO **<br><br>The administrative profession isn’t what it used to be, and the influx of changing technologies and new responsibilities in an ever-evolving workplace has business implications beyond the front desk. <br><br>OfficeNinjas recognizes admins and workplace operators, aka “Ninjas,” for the curious, engaged, forward-thinking professionals they are. We exist to provide vital resources, educational content, vendor vetting, networking events, and industry insights to ensure they have every opportunity to lead a valued and fulfilling professional life.<br><br><br>**WHAT WE’RE LOOKING FOR **<br><br>We’re looking for a Community Manager (CM) with a distinctive voice who can champion the OfficeNinjas brand and harness the power of our global network.<br><br>The admin role is evolving, and Ninjas are leading the charge. Like all pioneers, they have big ideas and even bigger questions. The CM hears everything our community members share and eagerly responds with well-researched suggestions, a dose of encouragement, or an offer to facilitate a connection. <br><br>The ideal candidate knows how to balance their unique personality with the OfficeNinjas’ brand so that every interaction feels human and authentic. They’ve found the intersection of fun and professionalism. They live there now. <br><br>An integral member of OfficeNinjas’ fully remote team, the CM knows how to collect, synthesize, and report feedback in a way that helps our team better understand admins and anticipate their needs.<br><br>Most importantly, the person who lands this gig needs to LOVE working with people. We’re a company founded on relationships, and this job represents that. The CM must be a clear, efficient, and friendly communicator who thrives in a collaborative, remote work environment.<br> <br>Feeling excited and motivated? Then you’re exactly the type of candidate we’re looking for.<br><br>**WHAT YOU DO **<br><br>Using your powers of project management, you serve as the lead contact for OfficeNinjas Think Tank, a specialized group of highly vetted Ninjas who advise our team on business development, marketing efforts, and product development. <br>You manage every aspect of our volunteer program, including interviewing, selecting, and training reliable event volunteers who are passionate about the OfficeNinjas community.<br>Through guidance, organizational support, and brand education, you nurture the OfficeNinjas Ambassadors, a motivated group of admins who help generate awareness and excitement for our content, programs, services, and events.<br>You do more than just moderate our social media platforms. You create spaces that are supportive and informative by encouraging conversation and providing valuable content. <br>Using the SOP that you create, you manage our HelpScout account, ensuring that all customer support concerns are addressed with care and efficiency. <br><br>**WHAT YOU NEED TO HAVE**<br><br>25+ hours a week to consistently dedicate to OfficeNinjas (with room to increase hours) <br>Two years of experience in community management, preferably for a remote team<br>Good understanding of the business operations/administrative role (bonus if you’ve worked as a Ninja yourself).<br>Ability to maintain accuracy under pressure, handle multiple projects simultaneously, and adapt quickly to rapidly shifting priorities. <br>A builder’s sensibility. You understand that if it doesn’t exist, it’s time to take ownership and build it with scalability in mind. <br>Proficiency in Asana (or similar project management tool), G Suite, and Slack. <br>A healthy combination of big-picture perspective and appreciation for the details.<br>A passion for collaboration. Your team members’ success is your success. You want everyone, yourself included, to continue to learn and grow.<br>An appreciation for candor. You can handle it and offer it up.<br>Tech savviness. You’re constantly researching new tech tools, and you think every new software system is figureoutable.<br>Excellent written and verbal communication skills. You’re always respectful but you don’t mince words, and you get to the point in as few characters as possible.<br>Major chops in the problem-solving category. You’re constantly thinking ahead. And when issues do pop up, they don’t greatly impact your project’s progress or outcome.<br>A growth mindset. You seize opportunities to learn skills outside of your job description.<br><br> <br>**LAST WORDS**<br>We mentioned we appreciate candor, so here’s a bit of OfficeNinjas realness: we work hard and smart. We launch and execute new projects every 90 days, accomplishing in three months what most businesses do in a year. We’re looking for someone who can jump in the game, pick up the ball, and run with it.<br><br>The Community Manager is a long-term role, and they will be crucial to our success and growth. They’ll champion the OfficeNinjas brand and harness the power of our global network of admins. The job comes with a ton of responsibility, but an equal amount of opportunity and even more fulfillment.<br><br>Did this job description spark a little fire and give you goosebumps? If you’re excited to apply, we would love to learn more about you!<br><h2>Requirements</h2>Apply for the CM position here –&gt; http://bit.ly/officeninjas-cm<p>See more jobs at <span>Officeninjas</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zoKg8_zpTEOC1hzWDjhYsA",
    "url": "https://feeds.feedblitz.com/~/565680860/0/problogger/jobs~Writers-Wanted-for-Ski-ResortSki-Vacation-Blog/",
    "title": "Writers Wanted for Ski Resort/Ski Vacation Blog",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:marmalade/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "The Lodging Company",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Writers Wanted for Ski Resort/Ski Vacation Blog</h2><div>Company: The Lodging Company</div>Location: North America<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p>Hello from The Lodging Company!</p><p>We are a travel wholesaler specializing in North American ski vacations. We're increasing our online content through blogging, and are looking for freelance writers who are passionate about the ski industry. If you're a quality writer who skis, snowboards, or enjoys spending time at ski resorts (summer or winter), we want to talk with you.</p><p>What we need from you:</p><ul><li>The ability to write engaging blog posts for a wide audience</li><li>Collaboration with our content team to produce blog posts on a regular basis</li><li>Knowledge of and enthusiasm for the ski industry (take a broad interpretation of this – you don't need be a professional skier!)</li></ul><p>What you get by working with us:</p><ul><li>Creative input on your articles</li><li>Full credit on our established website</li><li>Competitive compensation on a per-article basis</li><li>The potential of a long-term working relationship with us</li><li>The opportunity to write high quality, original blog posts for your portfolio</li></ul><p>Bonus qualities – let us know if:</p><ul><li>You have a reputation in the ski industry</li><li>You live or have lived at or near a ski resort in North America</li></ul><p>How to apply:</p><ul><li>Contact us at <a rel='nofollow' href='mailto:content@lodgingcompany.com'>content@lodgingcompany.com</a></li><li>Put the word “marmalade” in your subject line</li><li>Include links to examples of your writing</li><li>Include a brief overview of your experience and qualifications (a full resume is <b>not</b> required)</li></ul><p>We look forward to hearing from you!</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pdI12s_bRWO2Bq3ssAqH6g",
    "url": "https://problogger.com/jobs/job/writers-wanted-for-ski-resort-ski-vacation-blog-2/",
    "title": "Writers Wanted for Ski Resort/Ski Vacation Blog",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:marmalade/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "The Lodging Company",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Writers Wanted for Ski Resort/Ski Vacation Blog</h2><div>Company: The Lodging Company</div>Location: North America<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p>Hello from The Lodging Company!</p><p>We are a travel wholesaler specializing in North American ski vacations. We're increasing our online content through blogging, and are looking for freelance writers who are passionate about the ski industry. If you're a quality writer who skis, snowboards, or enjoys spending time at ski resorts (summer or winter), we want to talk with you.</p><p>What we need from you:</p><ul><li>The ability to write engaging blog posts for a wide audience</li><li>Collaboration with our content team to produce blog posts on a regular basis</li><li>Knowledge of and enthusiasm for the ski industry (take a broad interpretation of this – you don't need be a professional skier!)</li></ul><p>What you get by working with us:</p><ul><li>Creative input on your articles</li><li>Full credit on our established website</li><li>Competitive compensation on a per-article basis</li><li>The potential of a long-term working relationship with us</li><li>The opportunity to write high quality, original blog posts for your portfolio</li></ul><p>Bonus qualities – let us know if:</p><ul><li>You have a reputation in the ski industry</li><li>You live or have lived at or near a ski resort in North America</li></ul><p>How to apply:</p><ul><li>Contact us at <a rel='nofollow' href='mailto:content@lodgingcompany.com'>content@lodgingcompany.com</a></li><li>Put the word “marmalade” in your subject line</li><li>Include links to examples of your writing</li><li>Include a brief overview of your experience and qualifications (a full resume is <b>not</b> required)</li></ul><p>We look forward to hearing from you!</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Kx87PB1wR4yBXo3RGK5vMQ",
    "url": "https://jobspresso.co/job/copy-editor-5/",
    "title": "Copy Editor",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Ranker",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 6:06:24 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Copy Editor</h2><div>Writing<br></div><div>Pacific Time Zone<br></div><div>Company: Ranker<br></div><div>Contract<br></div><h3>Overview</h3><p>Ranker is a new form of entertainment publisher with a unique crowd-sourced element. Our editors publish ranked lists on topics as broad as The Best Movies Of All Time to things as specific as the 10 Totally Weird Stranger Things Fan Theories That Could Explain Everything. Our readers vote, edit, and re-rank the stories as they see fit. Founded in 2009, the company made a number of breakthroughs in the last 18 months, which has led to explosive growth, now reaching more than 50MM unique visitors worldwide, spending on average 5 minutes per visit. Our business is driven primarily by programmatic advertising and is profitable.</p><p>Ranker is headquartered in LA and 70+ employees strong and growing.</p><p>We are currently looking for a Copy Editor/Proofreader with working knowledge of journalistic standards and best practices, grammar, sourcing, fact-checking, as well as recent experience using (and maintaining) a voice &amp; style guide. First and foremost you have a meticulous attention to detail, and an eagle eye when it comes to grammar, spelling, and consistency of style.</p><p>Secondly, you understand best practices when it comes to image-sourcing and attribution, as well as fact-checking references and spot-checking for plagiarism. As part of our Standards Department, the copy editor report to the Copy Director and will be the final stop for our content before publishing, and will ensure Ranker’s style standards and best practices are completely implemented on every piece of content that we publish.</p><p>Requirements</p><ul></ul><li>2+ years experience in copy editing for a high-profile entertainment, celebrity, movie, or television publication. Online highly preferred.</li><li>Minimum 2 years Digital Media experience</li><li>Experience utilizing a voice &amp; style guide to ensure all content is crisp, clean, properly fact checked, well-sourced, free of bias and legally low-risk.</li><li>Experience with large-scale cleanup projects that bring previously published content up to current standards preferred</li><li>Ability to work in a fast-paced environment for a data-driven publisher</li><li>Experience with various CMS</li><li>SEO knowledge/ experience preferred</li><li>A passion for pop culture</li><li>Problem-solver and effective communicator</li><li>Bachelor’s degree in English, journalism, communications, film, etc</li><p>Please note: This is a remote contract position, but reports to HQ in Los Angeles. Copy Desk hours will mirror that of our home office editorial department, so must fall between&nbsp;9am and 6pm PST.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://ranker.recruiterbox.com/jobs/fk01s2d/' rel='nofollow'>https://ranker.recruiterbox.com/jobs/fk01s2d/ →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8u642NOtTkiE9HTJmtYf3Q",
    "url": "https://feeds.feedblitz.com/~/564908934/0/problogger/jobs~Be-part-of-the-writers-community-who-are-helping-travelers-and-hotels-around-the-world/",
    "title": "Be part of the writer's community who are helping travelers and hotels around the world",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Arrivedo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Be part of the writer’s community who are helping travelers and hotels around the world</h2><div>Company: Arrivedo</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p><span>We want to change the way everyone travels. We want travelers to experience the best local insights every time and make the most out of their trip. This is your chance to help us change that.</span><span><br></span><span><br></span><span>Arrivedo works with a community of more than 1600 international freelance writers, (including, but not limited to) travel-oriented bloggers, authors, literature and creative writing students who create Neighborhood Guides for hotels all over the world. We currently host over 650 Neighborhood Guides for hotels in more than 120 cities around the globe, providing our services to renowned international chains like JW Marriott, Waldorf-Astoria, Four Seasons, Westin Hotels &amp; Resorts, Ritz-Carlton, as well as B&amp;Bs, hostels and boutique hotels in remote locations around the globe.</span><span><br></span><b></b></p><p><b>What does the Arrivedo Writers Community do?</b><span><br></span><span>Help travelers with local recommendations you share in a hotel’s Neighborhood Guides. </span></p><p><span><br></span><b>How do THEY do it? </b><span><br></span><b>1st: </b><span>Outreach to hotels: Approach hotels via email or in person offering to set up their writer’s profile in Arrivedo. (We provide support, resources, and incentives to help you)</span></p><p><b>2nd:</b><span> Gather hotels local recommendations: Interview hotel staff to collect the hotel’s local recommendations and insights into their neighborhood.</span><span><br></span><b>3th:</b><span> Create a Neighborhood Guide: Use Arrivedo’s editor to create 8-10 short articles showcasing the hotel’s local recommendations from themes ranging from routes, gastronomy, nightlife, cultural activities, essential tips and more. Here is an example Neighborhood Guide from Hotel Majestic in Chicago: https://arrivedo.com/dest/en/chicago/hotel/the-majestic-hotel-3.</span></p><p>&nbsp;</p><p><b>Why do THEY do it?</b><span><br></span><span>With Arrivedo you have the chance to go beyond and help travelers to experience the world in a different way with your written word. You have the opportunity to share and learn about other cultures. The unique community of Arrivedo Writers helps you with the best tips on how to communicate your ideas, outreach and even get to know others around the globe. </span></p><p>&nbsp;</p><p><b>What are the benefits?</b><span><br></span></p><ul><li><span>Getting certified as one of Arrivedo’s 1600 international travel writers.</span></li><li><span>Be part of our private network of Arrivedo Writers.</span></li><li><span>Being able to sell your writing services to any hotel in the world. Arrivedo does not take a commission from your deals with hotels. Transactions are 1-on-1 in between writers and hotels.</span></li><li><span>Improve your Sales skills. We assign you a coach to help you on the outreaching process and provide you with all needed material.</span></li><li><span>Be aware that hotels prefer to pay with free accommodation (normally 3 nights), but you can negotiate a monetary payment.</span></li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "eXSKtQu5Tqic23wwIBOoIg",
    "url": "https://problogger.com/jobs/job/be-part-of-the-writers-community-who-are-helping-travelers-and-hotels-around-the-world-2/",
    "title": "Be part of the writer's community who are helping travelers and hotels around the world",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Arrivedo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Be part of the writer’s community who are helping travelers and hotels around the world</h2><div>Company: Arrivedo</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p><span>We want to change the way everyone travels. We want travelers to experience the best local insights every time and make the most out of their trip. This is your chance to help us change that.</span><span><br></span><span><br></span><span>Arrivedo works with a community of more than 1600 international freelance writers, (including, but not limited to) travel-oriented bloggers, authors, literature and creative writing students who create Neighborhood Guides for hotels all over the world. We currently host over 650 Neighborhood Guides for hotels in more than 120 cities around the globe, providing our services to renowned international chains like JW Marriott, Waldorf-Astoria, Four Seasons, Westin Hotels &amp; Resorts, Ritz-Carlton, as well as B&amp;Bs, hostels and boutique hotels in remote locations around the globe.</span><span><br></span><b></b></p><p><b>What does the Arrivedo Writers Community do?</b><span><br></span><span>Help travelers with local recommendations you share in a hotel’s Neighborhood Guides. </span></p><p><span><br></span><b>How do THEY do it? </b><span><br></span><b>1st: </b><span>Outreach to hotels: Approach hotels via email or in person offering to set up their writer’s profile in Arrivedo. (We provide support, resources, and incentives to help you)</span></p><p><b>2nd:</b><span> Gather hotels local recommendations: Interview hotel staff to collect the hotel’s local recommendations and insights into their neighborhood.</span><span><br></span><b>3th:</b><span> Create a Neighborhood Guide: Use Arrivedo’s editor to create 8-10 short articles showcasing the hotel’s local recommendations from themes ranging from routes, gastronomy, nightlife, cultural activities, essential tips and more. Here is an example Neighborhood Guide from Hotel Majestic in Chicago: https://arrivedo.com/dest/en/chicago/hotel/the-majestic-hotel-3.</span></p><p>&nbsp;</p><p><b>Why do THEY do it?</b><span><br></span><span>With Arrivedo you have the chance to go beyond and help travelers to experience the world in a different way with your written word. You have the opportunity to share and learn about other cultures. The unique community of Arrivedo Writers helps you with the best tips on how to communicate your ideas, outreach and even get to know others around the globe. </span></p><p>&nbsp;</p><p><b>What are the benefits?</b><span><br></span></p><ul><li><span>Getting certified as one of Arrivedo’s 1600 international travel writers.</span></li><li><span>Be part of our private network of Arrivedo Writers.</span></li><li><span>Being able to sell your writing services to any hotel in the world. Arrivedo does not take a commission from your deals with hotels. Transactions are 1-on-1 in between writers and hotels.</span></li><li><span>Improve your Sales skills. We assign you a coach to help you on the outreaching process and provide you with all needed material.</span></li><li><span>Be aware that hotels prefer to pay with free accommodation (normally 3 nights), but you can negotiate a monetary payment.</span></li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pDuswCryTPyAk063aIGRjQ",
    "url": "http://workinstartups.com/job-board/job/72016/editor-at-film-daily/",
    "title": "Editor",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Film Daily",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 1:56:55 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Competitive salary + bonus structure<br />40 Hours per week<br />Contract length: 3 Months or longer<br /><br />Film Daily is looking for an online News editor for their busy, entertainment-focused newsroom. This person will oversee our growing editorial and video team, who are focused on creating unique, shareable content on the themes of film, TV, entertainment, and new media. The right person will oversee the blue-sky editorial strategy for the company, as well as managing day-to-day operations of the publication.<br /><br />The Editor will work hand-in-hand with the company directors, senior managers, partners, and editorial team to assure the highest level of content is produced to our tight deadlines.<br /><br />We work with amazing, storied clients and new emerging technologies & agencies.<br /><br />Our work environment is relaxed, but we tell it like it is. We value proficiency and promote from within. Positions tend to be flexible, with mainly work-at-home opportunities.<br /><br />Position requirements<br />Are you a film & TV obsessive?<br />Do you know your Kurosawa from your Kubrick? Your Lynch from your Leigh? Your Girls from your Broad City?<br />Are you a high achiever? Do you have a proven track record of delivering exceptional results (in your last role, at university, on your personal projects)?<br />Do you understand the way the film & TV industries works?<br />Do you know how to use web searches to learn new skills?<br />Are you a dedicated lifelong learner?<br />Are you looking for a new challenge?<br />Are you willing to do whatever it takes to achieve results?<br />Are you able to prioritize your workload?<br />Do you think change in Hollywood is long overdue?<br />What we can offer for the right candidate<br />Ongoing training<br />Access to stream endless films & TV<br />Invitations to red carpet events & exclusive film previews<br />Market rate salary & attractive bonus structure<br />Travel opportunities within the UK & USA<br />Responsibilities<br />Oversee editorial team-setting deadlines and host daily scrum meetings.<br />Review trending news and assign features to writers.<br />Manage production of daily newsletter, including liaising with sponsors & partners.<br />Make sure all features & newsletters go out on time.<br />Analyze all available data to create writer assignments.<br />Set measurable goals for teams.<br />Recruit new writers & video creators.<br />Ensure all content has been promoted via all available tools.<br />Create detailed editorial calendars based on all available data.<br />Plan editorial strategically considering the long view.<br />Grow Film Daily’s presence on social media platforms.<br />Conceptualise new & innovative ways to tell stories across our media platforms.<br />Fact-check, proofread, and edit copy where needed<br />Liaise with team to boost sales & revenue.<br />Monitor staff performance and give relevant feedback.<br />Work with online advertising platforms to monetise our content.<br />Work with our growth hacker on advertising arbitrage content production.<br />Work with our social media team to create viral content.<br />Manage a team of interns.<br />The ideal candidate must possess<br />Proven track record of editorial skills, with a portfolio and references to back it up<br />Deep understanding of online magazines<br />WordPress admin skills<br />Deep understanding of social media and its relation to online publishing<br />Encyclopedic knowledge of film & TV<br />Stoic, can-do attitude<br />Proofreading and copyediting skills<br />Clear understanding of journalistic ethics & legal principles<br />Experience in strategic planning and management<br />Great attention to detail<br />High motivation<br />Exceptional communication & interpersonal skills<br />Excellent team leadership skills with experience motivating teams and influencing key stakeholders<br />Past experience running a successful online magazine<br />Knowledge of photo- and video-editing software<br />Experience with real-time social reporting<br />Fluency in sourcing stock images & videos<br />Understanding of the importance of community<br />Love of the internet & technology<br />Understanding of the digital landscape, being ahead of new developments<br />3+ years management experience in a media company<br />Experience working with online advertising agencies & aggregators<br />Demonstrated ability to drive strategy and make smart business decisions<br />Great sense of humor<br />Patience<br />Ambition<br />Learn about a day in the life of a Film Daily staffer here.<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "t5v5_1goR5uOMZZh_4vsjg",
    "url": "https://feeds.feedblitz.com/~/564277839/0/problogger/jobs~Photography-Blog-Content-Editor/",
    "title": "Photography Blog Content Editor",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:iphone/apple/2",
      "DBG_TECH1:k/t/w:iphone/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "iPhone Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Photography Blog Content Editor</h2><div>Company: iPhone Photography School</div>Location: Anywhere<br><br>Job Type: Full-time<div>  <h4>Description</h4>  <div>                    <p>Attention Content Writers &amp; Editors:</p><h2>“Stop Wasting Your Time &amp; Energy Writing About Topics You Don’t Really Care About… Become The Editor Of These Leading Photography Websites Instead!”</h2><ul><li><div>If you’d love to combine your work with your passion for photography…</div></li><li><div>If you want to use your skills to help millions of photographers worldwide…</div></li><li><div>And if you’d love to work together with world-class photographers…</div></li></ul><p><strong>Then this opportunity could literally change your life!</strong>&nbsp;But only if &nbsp;you keep reading.</p><p>Our photography websites –&nbsp;<a href='http://iphonephotographyschool.com/' rel='nofollow'>iPhonePhotographySchool.com</a>&nbsp;and&nbsp;<a href='http://photographypro.com/' rel='nofollow'>PhotographyPro.com</a>– are visited by over a million readers each month, and we’re looking to grow them even further.</p><p>Publishing excellent photography tutorials for free is an essential part of our strategy, which is why we’re looking for a talented content editor who will&nbsp;<b>work with world-class photographers</b>&nbsp;to share their knowledge with the world – while also ensuring a consistent quality of writing.</p><p>This is a full-time position, and you can&nbsp;<b>work from anywhere in the world</b>.</p><p><a href='https://iphonephotographyschool.com/content-editor/?utm_source=ProBlogger' rel='nofollow'>Click Here To Become A Full-Time Content Editor For Our Photography Websites</a></p><div><div><div><h3>7 Reasons To Become A Full-Time Content Editor For Our Photography Websites</h3></div></div><div><div><div><h4>1. COMBINE YOUR WORK WITH YOUR PASSION</h4><p>Do you have to write about topics you don’t really care about? As a writer or editor you spend most of your day working. So why not focus this time on something you actually care about?</p><p>Join our company, and you’ll spend your days polishing tutorials written by the world’s leading photography experts, and occasionally writing your own posts about topics you know well.</p></div></div></div><div><div><div><h4>2. GET A STABLE INCOME YOU CAN COUNT ON</h4><p>If you’re a freelance writer or editor, you already know how challenging it can be to earn a good living from writing. While some months are great, others can be a real struggle financially…</p><p>Join our company, and you’ll get a competitive salary every single month, without ever having to look for new clients or side gigs again!</p></div></div></div><div><div><div><h4>3. WORK WITH THE BEST PHOTOGRAPHERS IN THE WORLD</h4><p>If you’d like to hone your craft as a photographer, then this is the perfect opportunity!</p><p>You’ll be collaborating with world-class photographers on a daily basis, and your job will be to bring their best techniques to the world in a simple and easy to understand way.</p></div></div></div><div><div><div><h4>4. HELP MILLIONS OF PEOPLE IMPROVE THEIR PHOTOGRAPHY</h4><p>Helping others is one of the most rewarding things you can do in life. While this is something that everyone should practice in their daily life, you can also do it while earning a living.</p><p>Join our company, and your work will directly benefit millions of people. You’ll not only inspire your readers to take beautiful photos, but also to preserve their most cherished memories!</p></div></div></div><div><div><div><h4>5. LEARN FROM WORLD-CLASS ONLINE MARKETERS</h4><p>With the overabundance of blogs and social media, more content is released today than ever before. But only a tiny proportion of that content will ever get any significant readership.</p><p>So what makes your content stand out from the crowd? Join our company, and you’ll learn the most up to date online marketing strategies that will help your work reach a global audience.</p></div></div></div><div><div><div><h4>6. JOIN A COMPANY YOU ACTUALLY BELIEVE IN</h4><p>As one of the world’s most successful photography training companies, we aim for excellence in everything we do, including the quality of our courses and customer support. We track customer satisfaction (NPS) for all our courses, and our scores are on par with companies like Apple.</p><p>Join our company, and you’ll never have to use your skills to promote poor quality products.</p></div></div></div><div><div><div><h4>7. WORK FROM ANYWHERE IN THE WORLD</h4><p>We understand that the best writers like to work on their own terms. So you can do this job from anywhere in the world –&nbsp;including your home, our office in Latvia, or any paradise location!</p><p>If the initial collaboration turns out to be successful, our company will pay for a week-long trip to Latvia where you’ll meet the rest of our team and get acquainted with our&nbsp;company culture.</p></div></div></div></div><div><div><div><div><h4>HERE’S WHAT WE EXPECT FROM YOU…</h4><ul><li><div>You’re a native English speaker with a passion for writing</div></li><li><div>You have worked or studied as a writer or editor before</div></li><li><div>You can explain technical concepts in very simple terms</div></li><li><div>You’re highly comfortable with technology and internet</div></li><li><div>You’re at least an intermediate-level photographer</div></li><li><div>You have an excellent attention to detail</div></li></ul><p>Please only apply if you meet all these criteria. Other applications will not be considered.</p><p><a href='https://iphonephotographyschool.com/content-editor/?utm_source=ProBlogger' rel='nofollow'>Click Here To Become A Full-Time Content Editor For Our Photography Websites</a></p></div></div></div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XSHGbAp-SbSwNSx9GtZ0ZA",
    "url": "https://problogger.com/jobs/job/photography-blog-content-editor-7/",
    "title": "Photography Blog Content Editor",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:iphone/apple/2",
      "DBG_TECH1:k/t/w:iphone/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "iPhone Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Photography Blog Content Editor</h2><div>Company: iPhone Photography School</div>Location: Anywhere<br><br>Job Type: Full-time<div>  <h4>Description</h4>  <div>                    <p>Attention Content Writers &amp; Editors:</p><h2>“Stop Wasting Your Time &amp; Energy Writing About Topics You Don’t Really Care About… Become The Editor Of These Leading Photography Websites Instead!”</h2><ul><li><div>If you’d love to combine your work with your passion for photography…</div></li><li><div>If you want to use your skills to help millions of photographers worldwide…</div></li><li><div>And if you’d love to work together with world-class photographers…</div></li></ul><p><strong>Then this opportunity could literally change your life!</strong>&nbsp;But only if &nbsp;you keep reading.</p><p>Our photography websites –&nbsp;<a href='http://iphonephotographyschool.com/' rel='nofollow'>iPhonePhotographySchool.com</a>&nbsp;and&nbsp;<a href='http://photographypro.com/' rel='nofollow'>PhotographyPro.com</a>– are visited by over a million readers each month, and we’re looking to grow them even further.</p><p>Publishing excellent photography tutorials for free is an essential part of our strategy, which is why we’re looking for a talented content editor who will&nbsp;<b>work with world-class photographers</b>&nbsp;to share their knowledge with the world – while also ensuring a consistent quality of writing.</p><p>This is a full-time position, and you can&nbsp;<b>work from anywhere in the world</b>.</p><p><a href='https://iphonephotographyschool.com/content-editor/?utm_source=ProBlogger' rel='nofollow'>Click Here To Become A Full-Time Content Editor For Our Photography Websites</a></p><div><div><div><h3>7 Reasons To Become A Full-Time Content Editor For Our Photography Websites</h3></div></div><div><div><div><h4>1. COMBINE YOUR WORK WITH YOUR PASSION</h4><p>Do you have to write about topics you don’t really care about? As a writer or editor you spend most of your day working. So why not focus this time on something you actually care about?</p><p>Join our company, and you’ll spend your days polishing tutorials written by the world’s leading photography experts, and occasionally writing your own posts about topics you know well.</p></div></div></div><div><div><div><h4>2. GET A STABLE INCOME YOU CAN COUNT ON</h4><p>If you’re a freelance writer or editor, you already know how challenging it can be to earn a good living from writing. While some months are great, others can be a real struggle financially…</p><p>Join our company, and you’ll get a competitive salary every single month, without ever having to look for new clients or side gigs again!</p></div></div></div><div><div><div><h4>3. WORK WITH THE BEST PHOTOGRAPHERS IN THE WORLD</h4><p>If you’d like to hone your craft as a photographer, then this is the perfect opportunity!</p><p>You’ll be collaborating with world-class photographers on a daily basis, and your job will be to bring their best techniques to the world in a simple and easy to understand way.</p></div></div></div><div><div><div><h4>4. HELP MILLIONS OF PEOPLE IMPROVE THEIR PHOTOGRAPHY</h4><p>Helping others is one of the most rewarding things you can do in life. While this is something that everyone should practice in their daily life, you can also do it while earning a living.</p><p>Join our company, and your work will directly benefit millions of people. You’ll not only inspire your readers to take beautiful photos, but also to preserve their most cherished memories!</p></div></div></div><div><div><div><h4>5. LEARN FROM WORLD-CLASS ONLINE MARKETERS</h4><p>With the overabundance of blogs and social media, more content is released today than ever before. But only a tiny proportion of that content will ever get any significant readership.</p><p>So what makes your content stand out from the crowd? Join our company, and you’ll learn the most up to date online marketing strategies that will help your work reach a global audience.</p></div></div></div><div><div><div><h4>6. JOIN A COMPANY YOU ACTUALLY BELIEVE IN</h4><p>As one of the world’s most successful photography training companies, we aim for excellence in everything we do, including the quality of our courses and customer support. We track customer satisfaction (NPS) for all our courses, and our scores are on par with companies like Apple.</p><p>Join our company, and you’ll never have to use your skills to promote poor quality products.</p></div></div></div><div><div><div><h4>7. WORK FROM ANYWHERE IN THE WORLD</h4><p>We understand that the best writers like to work on their own terms. So you can do this job from anywhere in the world –&nbsp;including your home, our office in Latvia, or any paradise location!</p><p>If the initial collaboration turns out to be successful, our company will pay for a week-long trip to Latvia where you’ll meet the rest of our team and get acquainted with our&nbsp;company culture.</p></div></div></div></div><div><div><div><div><h4>HERE’S WHAT WE EXPECT FROM YOU…</h4><ul><li><div>You’re a native English speaker with a passion for writing</div></li><li><div>You have worked or studied as a writer or editor before</div></li><li><div>You can explain technical concepts in very simple terms</div></li><li><div>You’re highly comfortable with technology and internet</div></li><li><div>You’re at least an intermediate-level photographer</div></li><li><div>You have an excellent attention to detail</div></li></ul><p>Please only apply if you meet all these criteria. Other applications will not be considered.</p><p><a href='https://iphonephotographyschool.com/content-editor/?utm_source=ProBlogger' rel='nofollow'>Click Here To Become A Full-Time Content Editor For Our Photography Websites</a></p></div></div></div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "9WSe0qDpSESYwIm8xULUQA",
    "url": "https://cjl.ist/2KUx6N9",
    "title": "Community Administrator",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 9:54:39 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Community Administrator</h2>   Location:    Remote    Remote  <div>  Role and job type:  Community Full-time </div> <div>  <h3>Job Description</h3>  <h4>Our Community Team Is Expanding!</h4>  <p>Due to rapid growth, we are looking for enthusiastic individuals looking to join a leading VC, helping high quality portfolio projects that we are currently assisting, with community support via Telegram. </p>  <h4>Community Administrator</h4>  <ul>   <li>The crypto space tends to move fast. Its investor audience expects questions to be answered at similar speed by Community Administrators. Investors perform due diligence profoundly and engage with Community Administrators to have critical questions answered. </li>   <li>Public image of a project stands or falls by the responsiveness of its Community Administrators. </li>   <li>The longevity and success of a project is ensured by the strength of its community support. </li>  </ul>  <h4>The Community Administrator</h4>  <ul>   <li>Is the face of Ledger Capital and its upcoming projects. He/She embodies its vision and professionalism, goes the extra for community members and investors, keeps a positive attitude at all times, and keeps disputes in public channels to a minimum (ideally settled via a private channel).</li>   <li>Shall implement the Ledger Capital’s Online Community Moderation Strategy.</li>   <li>Shall Monitor and moderate user-generated content to ensure that the online community is maintained as a safe and user-friendly environment. </li>   <li>Shall ensure a safe and legal community environment, promotion excellent customer service and help to cultivate a strong community around the project.</li>   <li>Shall coordinate with the internal Community Management Team. </li>   <li>Shall moderate communities located in social networking sites including Telegram, Twitter, Reddit, and other similar social media outlets, adapting methodology where appropriate. He/She will also disincentive the organizing of unofficial community channels. </li>   <li>Shall regularly feedback insights gained from community moderation into the Community Management Team.</li>   <li>Shall be flexible on working times when needed (especially during critical phases of a project).</li>   <li>Shall be prepared to work weekends.</li>  </ul>  <p><strong>Please note:</strong> If accepted you will be added to our roster and put onto projects when Ledger Capital assists with these. You will be only be paid during the times you’re actively working on projects.</p>  <p><strong>Please make sure to include your Telegram @ in the application</strong></p>  <h4>Salary range</h4>  <p>Competitive </p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "J8CIUc44TUyusgq8GhCIxQ",
    "url": "https://cjl.ist/2KNsngk",
    "title": "Copywriter / Reddit & Bitcointalk",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 11:59:54 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Copywriter / Reddit &amp; Bitcointalk </h2>   Location:    Remote    Remote  <div>  Role and job type: ️ Content Contractor </div> <div>  <h3>Job Description</h3>  <p>Hi all!</p>  <p>We are looking for a skilled content creator who is passionate about the cryptocurrency space and ICOs. The ideal candidate has a strong interest in the blockchain and has a fundamental knowledge of ICOs and blockchain’s technology.</p>  <p>It is an absolute MUST that you are familiar with ICOs, that you have a great profile on bitcointalk and reddit AND that you are a native English speaker.<br>Experience working with other cryptocurrency companies or related review sites is a plus.</p>  <p>The candidate must be hardworking, humble and having experience in writing attractive and interesting content in a easily understandable way and for a wide range of audiences from bitcointalk and reddit.</p>  <p>Please do describe your interest, as well as proof of past experience in cryptocurrencies during your application.</p>  <p>We will be offering a 2 years job if your testing period is succeeded. The fixed price that you see is for 10 articles.</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "r9rVOFs9QAqR6Fin_iCMhg",
    "url": "https://feeds.feedblitz.com/~/563858402/0/problogger/jobs~Content-Writer/",
    "title": "Content Writer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Must Amplify",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Content Writer</h2><div>Company: Must Amplify</div>Location: Brisbane<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><span>Our mission at Amplify is helping business owners and entrepreneurs find their voices, and we are looking for like minded people that want to align with that mission.</span></p><p>&nbsp;</p><p><span>Business owners want their voices to be heard by the right people, they want their customers to feel what they feel, they want them to understand what they are trying to say. But so many business owners and entrepreneurs can’t find the right words.</span></p><p>&nbsp;</p><p><span>At Amplify, we want to help our clients find those words. We even want to help them find the words for the conversations they don’t even know they need to have!</span></p><p>&nbsp;</p><p><span>Are you someone that wants to help us on this mission?</span></p><p>&nbsp;</p><p><span>We are looking for a couple of new people to join our team for regular content creation work.</span></p><p>&nbsp;</p><p><span>This includes:</span></p><p>&nbsp;</p><ul><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating new blog and article posts of 350-500 words each and some longer form</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating social media copy</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating lead gen documents</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Editing existing content</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating web page content</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Copy for email nurture campaigns</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Interviewing our clients for content extraction</span></li></ul><p>&nbsp;</p><p><span>If this interests you, please fill out ‘</span><a href='https://docs.google.com/forms/d/1SxE52tRgXOst7aXs68XYcW8qR_CWgzrJtqdv9HqIIYY/edit?usp=drive_web' rel='nofollow'><span>The Become an Amplifyer</span></a><span>’ form and include examples of sites that you have managed content for.</span></p><p>&nbsp;</p><p><span>Amplify is a team of passionate and dedicated people located in 9 time zones and we are very connected with each other.</span></p><p>&nbsp;</p><p><span>Communication is key, if this isn't your strength, then this role isn't for you. We prefer people in the team who have had experience working in a virtual team.</span></p><p><span>Applications without ‘</span><a href='https://docs.google.com/forms/d/1SxE52tRgXOst7aXs68XYcW8qR_CWgzrJtqdv9HqIIYY/edit?usp=drive_web' rel='nofollow'><span>The Become an Amplifyer</span></a><span>’ form will NOT be considered.</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UFd-B1LLT4-Mfoh1hVF4kw",
    "url": "https://feeds.feedblitz.com/~/563857088/0/problogger/jobs~iPhone-Photography-Writers-Needed/",
    "title": "iPhone Photography Writers Needed",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:iphone/apple/20",
      "DBG_TECH1:k/t/w:iphone/mobile/20",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=20, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=20, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "iPhone Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>iPhone Photography Writers Needed</h2><div>Company: iPhone Photography School</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <div><div><p><em>Attention Expert iPhone Photographers:</em></p><h2>“Get Paid To Help Millions Of People Improve&nbsp;Their iPhone Photography!”</h2></div></div><div><div><div><ul><li><div>If you want to get paid to combine your passion for photography and writing...</div></li><li><div>If you want to get high-profile exposure as a photographer and a writer...</div></li><li><div>And if you want to help millions of people improve their photography...</div></li></ul><p><b>Then this page could literally change your life…</b></p><p>But only if you keep reading.</p><p>iPhonePhotographySchool.com is the world's leading resource on iPhone photography. This website is visited by 1,121,104 readers each month, and we’re looking to grow it even further.</p><p>Publishing excellent photography tutorials for free is an essential part of our strategy. This is why we’re looking for expert iPhone photographers who want to share their knowledge with the world.</p><p>This is a long-term freelance position, and you can work from anywhere in the world.</p></div></div></div><div><div><div><h3>5 Reasons To Become A Photography Writer For iPhone Photography School</h3></div></div><div><div><div><h4>1. Combine Your Passion For Photography And Writing</h4><p>You love photography. You love writing. It's not always easy to find a way to combine your two passions, but it doesn't have to be the case.</p><p>Great photography and excellent writing is exactly what we're looking for.</p><p>Join us, and spend time doing what you truly love - writing about photography.</p></div></div></div><div><div><div><h4>2. Get High-Profile Exposure As A Photographer</h4><p>You already know this: to get recognition as a photographer, talent alone is not enough anymore. People have to have a way to discover you.</p><p>With 1,121,104 monthly readers, we're among the most established photography websites in the world. So when you'll get published on our site, unexpected opportunities will start flowing your way.</p><p>Our authors have gone on to become full-time photography teachers and participate in once in a lifetime photography projects - all thanks to getting discovered on our site.</p></div></div></div><div><div><div><h4>3. Help Millions Of People Improve Their Photography</h4><p>Helping others is one of the most rewarding things you can do in life. While this is something that everyone should practice in their daily life, you can also do it while earning a living.</p><p>Think about everything you've discovered as a photographer, and you'll realise how much you have to give back to others.</p><p>Write for us, and your work will directly benefit millions of people. You’ll not only inspire your readers to take beautiful photos, but also to preserve their most cherished memories!</p></div></div></div><div><div><div><h4>4. Fast-Track Your Growth As A Writer</h4><p>As a passionate writer, you'd love to get even better at your craft.</p><p>We get how important growth is for our writers. That's why your every article will receive a personalized video feedback from one of our world-class editors. They'll share every tip and trick they have to help you get better.</p><p>Write for us, and you'll improve your writing faster than ever before.</p></div></div></div><div><div><div><h4>5. Get Industry-Leading Compensation</h4><p>We value your work and unique knowledge as an expert iPhone photographer and writer, so we want to compensate your&nbsp;work fairly.</p><p>You'll receive ¢10 for every word and $2 for every image that goes in the final article. The more useful quality content you provide, the more you get paid.</p><p>Not only that, this is an industry-leading payment scheme. Think of it this way - you'll typically get to pocket between $200 and $400 for doing a job you love anyway.</p></div></div></div></div><div><div><div><div><h4>Here’s What We Expect From You…</h4><ul><li><div>You’re an excellent photographer with a vast iPhone photography portfolio</div></li><li><div>You can explain complex technical and photography concepts in simple terms</div></li><li><div>You’re a native English speaker with a passion for writing</div></li><li><div>You can produce polished articles that don't need much editing</div></li><li><div>You have an excellent attention to detail</div></li></ul><div>Please only apply if you meet all these criteria. Other applications will not be considered.</div><div></div></div></div></div></div><div><div><div><h4><a href='https://iphonephotographyschool.com/writer?utm_source=problogger' rel='nofollow'>Click Here To Apply</a></h4></div><p>If you delay submitting your application, someone else will be hired before you.</p></div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "nle-iWO3QdKGyPAn7ig8cw",
    "url": "https://problogger.com/jobs/job/content-writer-100/",
    "title": "Content Writer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Must Amplify",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Content Writer</h2><div>Company: Must Amplify</div>Location: Brisbane<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p><span>Our mission at Amplify is helping business owners and entrepreneurs find their voices, and we are looking for like minded people that want to align with that mission.</span></p><p>&nbsp;</p><p><span>Business owners want their voices to be heard by the right people, they want their customers to feel what they feel, they want them to understand what they are trying to say. But so many business owners and entrepreneurs can’t find the right words.</span></p><p>&nbsp;</p><p><span>At Amplify, we want to help our clients find those words. We even want to help them find the words for the conversations they don’t even know they need to have!</span></p><p>&nbsp;</p><p><span>Are you someone that wants to help us on this mission?</span></p><p>&nbsp;</p><p><span>We are looking for a couple of new people to join our team for regular content creation work.</span></p><p>&nbsp;</p><p><span>This includes:</span></p><p>&nbsp;</p><ul><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating new blog and article posts of 350-500 words each and some longer form</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating social media copy</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating lead gen documents</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Editing existing content</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating web page content</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Copy for email nurture campaigns</span></li><li><span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Interviewing our clients for content extraction</span></li></ul><p>&nbsp;</p><p><span>If this interests you, please fill out ‘</span><a href='https://docs.google.com/forms/d/1SxE52tRgXOst7aXs68XYcW8qR_CWgzrJtqdv9HqIIYY/edit?usp=drive_web' rel='nofollow'><span>The Become an Amplifyer</span></a><span>’ form and include examples of sites that you have managed content for.</span></p><p>&nbsp;</p><p><span>Amplify is a team of passionate and dedicated people located in 9 time zones and we are very connected with each other.</span></p><p>&nbsp;</p><p><span>Communication is key, if this isn't your strength, then this role isn't for you. We prefer people in the team who have had experience working in a virtual team.</span></p><p><span>Applications without ‘</span><a href='https://docs.google.com/forms/d/1SxE52tRgXOst7aXs68XYcW8qR_CWgzrJtqdv9HqIIYY/edit?usp=drive_web' rel='nofollow'><span>The Become an Amplifyer</span></a><span>’ form will NOT be considered.</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "SwljK7BCTbq0dW34eDVWVg",
    "url": "https://problogger.com/jobs/job/iphone-photography-writers-needed-2/",
    "title": "iPhone Photography Writers Needed",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:iphone/apple/20",
      "DBG_TECH1:k/t/w:iphone/mobile/20",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=20, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=20, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "iPhone Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>iPhone Photography Writers Needed</h2><div>Company: iPhone Photography School</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <div><div><p><em>Attention Expert iPhone Photographers:</em></p><h2>“Get Paid To Help Millions Of People Improve&nbsp;Their iPhone Photography!”</h2></div></div><div><div><div><ul><li><div>If you want to get paid to combine your passion for photography and writing...</div></li><li><div>If you want to get high-profile exposure as a photographer and a writer...</div></li><li><div>And if you want to help millions of people improve their photography...</div></li></ul><p><b>Then this page could literally change your life…</b></p><p>But only if you keep reading.</p><p>iPhonePhotographySchool.com is the world's leading resource on iPhone photography. This website is visited by 1,121,104 readers each month, and we’re looking to grow it even further.</p><p>Publishing excellent photography tutorials for free is an essential part of our strategy. This is why we’re looking for expert iPhone photographers who want to share their knowledge with the world.</p><p>This is a long-term freelance position, and you can work from anywhere in the world.</p></div></div></div><div><div><div><h3>5 Reasons To Become A Photography Writer For iPhone Photography School</h3></div></div><div><div><div><h4>1. Combine Your Passion For Photography And Writing</h4><p>You love photography. You love writing. It's not always easy to find a way to combine your two passions, but it doesn't have to be the case.</p><p>Great photography and excellent writing is exactly what we're looking for.</p><p>Join us, and spend time doing what you truly love - writing about photography.</p></div></div></div><div><div><div><h4>2. Get High-Profile Exposure As A Photographer</h4><p>You already know this: to get recognition as a photographer, talent alone is not enough anymore. People have to have a way to discover you.</p><p>With 1,121,104 monthly readers, we're among the most established photography websites in the world. So when you'll get published on our site, unexpected opportunities will start flowing your way.</p><p>Our authors have gone on to become full-time photography teachers and participate in once in a lifetime photography projects - all thanks to getting discovered on our site.</p></div></div></div><div><div><div><h4>3. Help Millions Of People Improve Their Photography</h4><p>Helping others is one of the most rewarding things you can do in life. While this is something that everyone should practice in their daily life, you can also do it while earning a living.</p><p>Think about everything you've discovered as a photographer, and you'll realise how much you have to give back to others.</p><p>Write for us, and your work will directly benefit millions of people. You’ll not only inspire your readers to take beautiful photos, but also to preserve their most cherished memories!</p></div></div></div><div><div><div><h4>4. Fast-Track Your Growth As A Writer</h4><p>As a passionate writer, you'd love to get even better at your craft.</p><p>We get how important growth is for our writers. That's why your every article will receive a personalized video feedback from one of our world-class editors. They'll share every tip and trick they have to help you get better.</p><p>Write for us, and you'll improve your writing faster than ever before.</p></div></div></div><div><div><div><h4>5. Get Industry-Leading Compensation</h4><p>We value your work and unique knowledge as an expert iPhone photographer and writer, so we want to compensate your&nbsp;work fairly.</p><p>You'll receive ¢10 for every word and $2 for every image that goes in the final article. The more useful quality content you provide, the more you get paid.</p><p>Not only that, this is an industry-leading payment scheme. Think of it this way - you'll typically get to pocket between $200 and $400 for doing a job you love anyway.</p></div></div></div></div><div><div><div><div><h4>Here’s What We Expect From You…</h4><ul><li><div>You’re an excellent photographer with a vast iPhone photography portfolio</div></li><li><div>You can explain complex technical and photography concepts in simple terms</div></li><li><div>You’re a native English speaker with a passion for writing</div></li><li><div>You can produce polished articles that don't need much editing</div></li><li><div>You have an excellent attention to detail</div></li></ul><div>Please only apply if you meet all these criteria. Other applications will not be considered.</div><div></div></div></div></div></div><div><div><div><h4><a href='https://iphonephotographyschool.com/writer?utm_source=problogger' rel='nofollow'>Click Here To Apply</a></h4></div><p>If you delay submitting your application, someone else will be hired before you.</p></div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "qNSNXRfRTEOu96TbMYcKWQ",
    "url": "https://cjl.ist/2MypL7M",
    "title": "Content Writer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 10, 2018 7:06:09 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Content Writer</h2>   Location:    Remote    Boston    US  <div>  Role and job type: ️ Content Full-time </div> <div>  <h3>Job Description</h3>  <p><strong>Job Summary</strong><br>Eximchain is looking for a talented Content Writer to be part of our growing team. The successful candidate will be responsible for creating compelling blog posts, social media content, web copy and documentation that will lead to appealing to our target audience and boosting brand awareness. The responsibility includes expanding our digital footprint and driving more value through online content. The ideal candidate should be able to present a proven track record of producing pieces that increase engagement and drive targeted quality leads. This position requires a high level of creativity and the ability to use data-driven insights to write optimised materials. A candidate experienced in B2B content writing or the supply chain industry is preferred. If you are familiar with producing online content and have an eye for detail, we’d like to meet you. This position is open for remote-working.</p>  <p><strong>Responsibilities</strong></p>  <ul>   <li>Research industry-related topics (combining online sources, interviews and studies) </li>   <li>Design the content strategy and curate the compelling story that applies the fast-changing industry trend in a timely manner</li>   <li>Write clear marketing copy to promote our technology/products</li>   <li>Regularly produce various content types, including email, social media posts, blogs and white papers </li>   <li>Edit content created by other members of the team </li>   <li>Schedule content publishing on time using content management tools</li>   <li>Prepare well-structured drafts using Google drive or content management tools</li>   <li>Use SEO best practices to generate traffic to our site </li>   <li>Actively manage and promote our blog, and pitch articles to relevant third-party platforms </li>   <li>Analyze content marketing metrics and makes changes as needed </li>   <li>Coordinate with marketing, product, business and tech teams to illustrate articles and to create innovative content ideas</li>   <li>Monitor the key industry issues and Eximchain related mentions online</li>  </ul>  <p><strong>Requirements</strong></p>  <ul>   <li>Bachelor’s degree in English, Journalism, Marketing or related field </li>   <li>A minimum of 5 years of experience in the relevant field</li>   <li>Knowledge of digital marketing tactics, including SEO, email marketing and web analytics </li>   <li>Proven work experience as a Content Writer, Copywriter or similar role in English</li>   <li>Portfolio of published articles </li>   <li>Excellent writing skills, as well as the ability to communicate and collaborate effectively </li>   <li>Experience doing research using multiple sources </li>   <li>The ability to consistently meet tight deadlines </li>   <li>Hands-on experience with content management tools, i.e. Medium, Hootsuite, GetResponse</li>   <li>Weekly call with the relevant team members</li>   <li>At least three years of experience writing for a B2B audience </li>   <li>Experience in the supply chain industry is a plus</li>   <li>Experience in the blockchain/cryptocurrency industry is a plus</li>   <li>Remote-working experience is a plus</li>  </ul>  <h4>Salary range</h4>  <p>Negotiable</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "gjLDDVEHRHGja-RzHWms1w",
    "url": "https://feeds.feedblitz.com/~/563474662/0/problogger/jobs~Editor-Content-Manager-Long-Term/",
    "title": "Editor / Content Manager - Long Term",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ClickThere, LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 10, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Editor / Content Manager – Long Term</h2><div>Company: ClickThere, LLC</div>Location: Remote<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>ClickThere, LLC is a performance marketing company led by founders who have acquired millions of customers and managed hundreds of millions of dollars in online spend. ClickThere is made up of an extremely nimble team bringing together world class talent to scale customer acquisition in highly competitive verticals for leading online companies.</p><p><strong>We're looking for a longer term manager contractor - not a per word writer position.</strong></p><p><strong>*** Please make sure to include your resume/salary requirements and experience in content strategy and managing teams of freelancers. ***</strong></p><p><strong>As our Content Manager/Editor you will:</strong></p><ul><li>Recruit, train, and manage freelance writers on our multiple website properties to generate high quality, memorable, and useful content</li><li>Create and enforce a style guide for each website property and likewise ensure all content matches</li><li>Edit posts, find and utilize photos, and push the “publish” button</li><li>Research and create new topic ideas with a focus on increasing our SEO</li><li>Design and implement a content calendar for each of our properties</li><li>Work with our in house designer and team to create interactive infographics, video, and other highly linkable and shareable content</li><li>Work with our third party SEO link building firms to create highly linkable content with a focus on increasing our organic rankings</li><li>Stay on top of the latest content marketing trends to ensure our websites and content fit the needs of our audiences</li><li>Writing some content yourself is welcomed and encouraged!</li><li>Never utter the words, “That’s not my job.”</li></ul><h3>Helpful Skills &amp; Experience</h3><ul><li>You must have experience in editing and writing content for websites with a high amount of SEO traffic</li><li>You must have experience in managing multiple freelancers</li><li>You must know how to research and write SEO keyword focused copy, headlines, descriptions, and alt text</li><li>You must be able to write kick-butt content yourself in the absence of freelancers</li><li>You should know basic HTML so that you can ensure all posts/content/copy looks and fits in to each website template</li><li>You must be okay taking input from various stakeholders and implementing feedback</li><li>You must be okay working on a variety of projects, daily</li><li>You must not be afraid to test new ideas, find winners, and pull back on losers</li><li>You must be okay with constant change - we move quickly and test often</li><li>Extremely strong written and oral communication skills come second nature - we’re remote after all</li><li>Do we sound picky? We know. It’s because we only want the best.</li></ul><h3>What We Value</h3><p>A driven self starter with a history of success. Always striving to exceed targets - we’re a performance marketing company after all! Clear and constant communication, transparency, open-mindedness, empathy, and a desire to win are just a few of ClickThere’s cultural values. We are looking for a person who understands this culture and will thrive within a team of people passionate about self-improvement, honesty and kicking ass every single day “at the office.”</p><h3>Where You’ll Work</h3><p>As a fully distributed team, you’ll be free to work from wherever in the world you desire.</p><h3>Warning!</h3><p>We’re not going to lie. This will be a demanding job with an extreme attention to performance. You should be a self starter who is able to handle multiple priorities and demanding stakeholders. We’re not unreasonable - we’re going to have fun and we’ll be in the trenches with you too.</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EAp9S8SJTAGiG8c_3AwP7Q",
    "url": "https://problogger.com/jobs/job/editor-content-manager-long-term/",
    "title": "Editor / Content Manager - Long Term",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ClickThere, LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 10, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Editor / Content Manager – Long Term</h2><div>Company: ClickThere, LLC</div>Location: Remote<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>ClickThere, LLC is a performance marketing company led by founders who have acquired millions of customers and managed hundreds of millions of dollars in online spend. ClickThere is made up of an extremely nimble team bringing together world class talent to scale customer acquisition in highly competitive verticals for leading online companies.</p><p><strong>We're looking for a longer term manager contractor - not a per word writer position.</strong></p><p><strong>*** Please make sure to include your resume/salary requirements and experience in content strategy and managing teams of freelancers. ***</strong></p><p><strong>As our Content Manager/Editor you will:</strong></p><ul><li>Recruit, train, and manage freelance writers on our multiple website properties to generate high quality, memorable, and useful content</li><li>Create and enforce a style guide for each website property and likewise ensure all content matches</li><li>Edit posts, find and utilize photos, and push the “publish” button</li><li>Research and create new topic ideas with a focus on increasing our SEO</li><li>Design and implement a content calendar for each of our properties</li><li>Work with our in house designer and team to create interactive infographics, video, and other highly linkable and shareable content</li><li>Work with our third party SEO link building firms to create highly linkable content with a focus on increasing our organic rankings</li><li>Stay on top of the latest content marketing trends to ensure our websites and content fit the needs of our audiences</li><li>Writing some content yourself is welcomed and encouraged!</li><li>Never utter the words, “That’s not my job.”</li></ul><h3>Helpful Skills &amp; Experience</h3><ul><li>You must have experience in editing and writing content for websites with a high amount of SEO traffic</li><li>You must have experience in managing multiple freelancers</li><li>You must know how to research and write SEO keyword focused copy, headlines, descriptions, and alt text</li><li>You must be able to write kick-butt content yourself in the absence of freelancers</li><li>You should know basic HTML so that you can ensure all posts/content/copy looks and fits in to each website template</li><li>You must be okay taking input from various stakeholders and implementing feedback</li><li>You must be okay working on a variety of projects, daily</li><li>You must not be afraid to test new ideas, find winners, and pull back on losers</li><li>You must be okay with constant change - we move quickly and test often</li><li>Extremely strong written and oral communication skills come second nature - we’re remote after all</li><li>Do we sound picky? We know. It’s because we only want the best.</li></ul><h3>What We Value</h3><p>A driven self starter with a history of success. Always striving to exceed targets - we’re a performance marketing company after all! Clear and constant communication, transparency, open-mindedness, empathy, and a desire to win are just a few of ClickThere’s cultural values. We are looking for a person who understands this culture and will thrive within a team of people passionate about self-improvement, honesty and kicking ass every single day “at the office.”</p><h3>Where You’ll Work</h3><p>As a fully distributed team, you’ll be free to work from wherever in the world you desire.</p><h3>Warning!</h3><p>We’re not going to lie. This will be a demanding job with an extreme attention to performance. You should be a self starter who is able to handle multiple priorities and demanding stakeholders. We’re not unreasonable - we’re going to have fun and we’ll be in the trenches with you too.</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "D0cBjVxmRUO6yNadWqkUsg",
    "url": "https://feeds.feedblitz.com/~/563917474/0/problogger/jobs~Backpacking-Freelance-Writer-amp-Gear-Tester/",
    "title": "Backpacking Freelance Writer & Gear Tester",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "99Boulders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Backpacking Freelance Writer &amp; Gear Tester</h2><div>Company: 99Boulders</div>Location: USA<br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>Hey there, Alex from 99Boulders here. I’m looking for a backpacking freelance writer and gear tester to, well, test backpacking gear and then write articles about it.</p><p>If you’re someone who goes on lots of backpacking trips then this gig is perfect for you. You’ll get free gear (you get to keep your favorite piece from each assignment) and you can profit from the backpacking trips you’re already taking because I'll pay you a flat fee to test the gear.</p><p>Here are all the juicy details:</p><p>&nbsp;</p><p><strong>RESPONSIBILITIES</strong></p><ul><li><strong>Test backpacking gear</strong>&nbsp;by taking it with you on your backpacking trips and also when necessary by designing and conducting side-by-side tests at home to compare various features</li><li><strong>Take photos of the gear and your testing processes</strong>&nbsp;to include in your articles. Smartphone photos are fine.</li><li><strong>Write articles and reviews of the gear based on your testing.</strong>&nbsp;The most common type of article you’ll write will be ‘best of’ articles ranking and reviewing the top options you’ve tested (<a href='https://www.99boulders.com/best-battery-packs-for-camping-and-backpacking' rel='nofollow'>Example</a>). I will occasionally also assign you articles on other topics related to backpacking and backpacking gear.</li><li><strong>Ship gear back to me when you’re done with it (occasionally).</strong>&nbsp;Each assignment will include multiple pieces of gear. You keep your favorite and ship back the rest. This occurs infrequently because I’m fine with you batching shipments. For example, our climbing gear tester has been working for the site for almost a year and has only had to ship gear back to me two or three times.</li><li><strong>Pick up gear from the nearest Amazon Locker (occasionally).</strong>&nbsp;Shipping you gear presents a minor problem: the package might be stolen from your doorstep. This has happened to us once before. If I am worried that an expensive piece of gear could be stolen I might choose to ship it to the Amazon Locker nearest to you for you to pick up.</li><li><strong>Conduct research and interview experts (occasionally).</strong>&nbsp;In order to be able to write some articles you might have to conduct internet research and/or interview experts via phone or email.</li></ul><p>&nbsp;</p><p><strong>BENEFITS</strong></p><ul><li><strong>Free gear</strong>&nbsp;– you get to keep your favorite piece of gear from each assignment</li><li><strong>Quality articles for your portfolio</strong>&nbsp;– one of our former writers included her 99Boulders articles in her portfolio and successfully pitched Backpacker magazine. Another writer had one of his 99Boulders articles republished on rockandice.com, a top climbing site.</li><li><strong>Ongoing and consistent assignments in a contract position</strong>&nbsp;– as long as you keep doing good work I'll keep having assignments for you. Seasonality and your own ability to get out in the field to test gear will affect frequency of assignments, but I’ll work with you to make the most of months where you don’t have any trips planned. I’m also highly flexible and am happy to schedule assignments so that they best fit your schedule.</li><li><strong>Competitive pay and compensation for testing</strong>&nbsp;– I offer a competitive per-word rate for articles and pay a flat fee for the testing portion of each assignment. You also get to invoice me for shipping costs so there's no cost to you to ship me back the gear.</li><li><b>Ability to work remotely on your own time</b></li><li><strong>Ability to pitch me your own article ideas</strong></li><li><strong>Consideration for related assignments and positions</strong>&nbsp;– if you do a good job testing backpacking gear you’ll be among the first considered for any future positions that may open up and any future assignments involving other types of outdoor gear, such as outdoor clothing and footwear</li></ul><p>&nbsp;</p><p><strong>REQUIREMENTS</strong></p><ul><li><strong>Living in US</strong></li><li><strong>Fluent in English</strong></li><li><strong>3+ years backpacking experience</strong></li><li><strong>Freelance writing experience</strong></li><li><strong>You must be the type of backpacker who goes on lots of backpacking trips.</strong>&nbsp;If you aren’t, you won’t have enough chances to adequately test the gear at a decent rate, and I won’t be able to assign you many assignments.</li></ul><p>Bonus points if you have any of the following:</p><ul><li>Professional or exceptional backpacking experience (e.g. thru-hiked the AT, worked as a NOLS instructor)</li><li>Some photography chops</li></ul><p>NOTE: Your testing will mainly focus on lightweight and ultralight backpacking gear. If you’re the type of backpacker who isn’t much concerned with weight then your gear preferences won’t align well with those of your readers and as a result you won’t be a good fit for the position.</p><p>&nbsp;</p><p><strong>INTERESTED? LET'S TALK NEXT STEPS</strong></p><ol><li>Apply via the link below</li><li>If I like your application I’ll reach out to you to discuss payment rates</li><li>Once we agree on payment I’ll move you on to a paid trial which will consist of 1-2 trial assignments</li><li>If you do a good job on the trial assignments we’ll have a brief phone interview</li><li>If I decide to hire you I will ask you to sign a contract and fill out a W-9</li></ol>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kGIa5uliSA-nif2urELGoQ",
    "url": "https://problogger.com/jobs/job/backpacking-freelance-writer-gear-tester/",
    "title": "Backpacking Freelance Writer & Gear Tester",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "99Boulders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Backpacking Freelance Writer &amp; Gear Tester</h2><div>Company: 99Boulders</div>Location: USA<br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>Hey there, Alex from 99Boulders here. I’m looking for a backpacking freelance writer and gear tester to, well, test backpacking gear and then write articles about it.</p><p>If you’re someone who goes on lots of backpacking trips then this gig is perfect for you. You’ll get free gear (you get to keep your favorite piece from each assignment) and you can profit from the backpacking trips you’re already taking because I'll pay you a flat fee to test the gear.</p><p>Here are all the juicy details:</p><p>&nbsp;</p><p><strong>RESPONSIBILITIES</strong></p><ul><li><strong>Test backpacking gear</strong>&nbsp;by taking it with you on your backpacking trips and also when necessary by designing and conducting side-by-side tests at home to compare various features</li><li><strong>Take photos of the gear and your testing processes</strong>&nbsp;to include in your articles. Smartphone photos are fine.</li><li><strong>Write articles and reviews of the gear based on your testing.</strong>&nbsp;The most common type of article you’ll write will be ‘best of’ articles ranking and reviewing the top options you’ve tested (<a href='https://www.99boulders.com/best-battery-packs-for-camping-and-backpacking' rel='nofollow'>Example</a>). I will occasionally also assign you articles on other topics related to backpacking and backpacking gear.</li><li><strong>Ship gear back to me when you’re done with it (occasionally).</strong>&nbsp;Each assignment will include multiple pieces of gear. You keep your favorite and ship back the rest. This occurs infrequently because I’m fine with you batching shipments. For example, our climbing gear tester has been working for the site for almost a year and has only had to ship gear back to me two or three times.</li><li><strong>Pick up gear from the nearest Amazon Locker (occasionally).</strong>&nbsp;Shipping you gear presents a minor problem: the package might be stolen from your doorstep. This has happened to us once before. If I am worried that an expensive piece of gear could be stolen I might choose to ship it to the Amazon Locker nearest to you for you to pick up.</li><li><strong>Conduct research and interview experts (occasionally).</strong>&nbsp;In order to be able to write some articles you might have to conduct internet research and/or interview experts via phone or email.</li></ul><p>&nbsp;</p><p><strong>BENEFITS</strong></p><ul><li><strong>Free gear</strong>&nbsp;– you get to keep your favorite piece of gear from each assignment</li><li><strong>Quality articles for your portfolio</strong>&nbsp;– one of our former writers included her 99Boulders articles in her portfolio and successfully pitched Backpacker magazine. Another writer had one of his 99Boulders articles republished on rockandice.com, a top climbing site.</li><li><strong>Ongoing and consistent assignments in a contract position</strong>&nbsp;– as long as you keep doing good work I'll keep having assignments for you. Seasonality and your own ability to get out in the field to test gear will affect frequency of assignments, but I’ll work with you to make the most of months where you don’t have any trips planned. I’m also highly flexible and am happy to schedule assignments so that they best fit your schedule.</li><li><strong>Competitive pay and compensation for testing</strong>&nbsp;– I offer a competitive per-word rate for articles and pay a flat fee for the testing portion of each assignment. You also get to invoice me for shipping costs so there's no cost to you to ship me back the gear.</li><li><b>Ability to work remotely on your own time</b></li><li><strong>Ability to pitch me your own article ideas</strong></li><li><strong>Consideration for related assignments and positions</strong>&nbsp;– if you do a good job testing backpacking gear you’ll be among the first considered for any future positions that may open up and any future assignments involving other types of outdoor gear, such as outdoor clothing and footwear</li></ul><p>&nbsp;</p><p><strong>REQUIREMENTS</strong></p><ul><li><strong>Living in US</strong></li><li><strong>Fluent in English</strong></li><li><strong>3+ years backpacking experience</strong></li><li><strong>Freelance writing experience</strong></li><li><strong>You must be the type of backpacker who goes on lots of backpacking trips.</strong>&nbsp;If you aren’t, you won’t have enough chances to adequately test the gear at a decent rate, and I won’t be able to assign you many assignments.</li></ul><p>Bonus points if you have any of the following:</p><ul><li>Professional or exceptional backpacking experience (e.g. thru-hiked the AT, worked as a NOLS instructor)</li><li>Some photography chops</li></ul><p>NOTE: Your testing will mainly focus on lightweight and ultralight backpacking gear. If you’re the type of backpacker who isn’t much concerned with weight then your gear preferences won’t align well with those of your readers and as a result you won’t be a good fit for the position.</p><p>&nbsp;</p><p><strong>INTERESTED? LET'S TALK NEXT STEPS</strong></p><ol><li>Apply via the link below</li><li>If I like your application I’ll reach out to you to discuss payment rates</li><li>Once we agree on payment I’ll move you on to a paid trial which will consist of 1-2 trial assignments</li><li>If you do a good job on the trial assignments we’ll have a brief phone interview</li><li>If I decide to hire you I will ask you to sign a contract and fill out a W-9</li></ol>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "P1KKA3l1S3Wgp3TO6gP2Rw",
    "url": "https://remoteok.io/jobs/68396",
    "title": "Identity Architecture Content Padawan",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=5, c=2, mobile=1, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Auth0",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 8, 2018 6:23:18 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Identity Architecture Content Padawan</h2></span><br><span><h3>Auth0</h3></span></td><div><div><br>Auth0, a global leader in Identity-as-a-Service (IDaaS), provides thousands of enterprise customers with a Universal Identity Platform for their web, mobile, IoT, and internal applications. Its extensible platform seamlessly authenticates and secures more than 1.5B logins per month, making it loved by developers and trusted by global enterprises. Auth0 has raised more than $110 million to date and continues its global growth at a rapid pace. We are consistently recognized as a great place to work based our outstanding leadership and dedication to company culture, and are looking for the best people to join our incredible team spread across more than 35 countries!<br><br><br>Auth0 is experiencing tremendous growth, onboarding new technical personnel at breakneck pace. New hires are always excellent professionals, but they often lack a background in identity - and even when they do, they need to ramp up fast on Auth0 features set. We want to capture the essence of how Auth0 solves identity and development problems, and make it available in form of educational material that can be used by our new hires and customers to ramp up as efficiently as possible.<br><br><br>Identity is a complex subject, and making someone productive entails profound understanding of its underlying principles combined with exceptional communication skills. We are recruiting a passionate technical content manager who’s willing to dive deep in identity architecture and product, gain solid understanding of both big picture and fine grained details, and reemerge to explain to non-experts what they need to know to use Auth0 effectively, securely and following industry best practices.<br><br><br>You won’t be alone in this challenge! You can expect to work shoulder to shoulder with world class experts, supercharging your own ramp up in identity, architecture and technical communication. With the kind of knowledge you’ll acquire, you’ll be positioned to decide on what to do next. This is a unique opportunity.<br><br><br>You will:<br><br> Design and author exceptional end to end educational content for developer<br><br> Define well thought, custom-tailored tables of content, courses structure<br><br> Author clarifying code samples and labs<br><br> Produce engaging, easy to follow, comprehensive written documentation<br><br> Script and deliver engaging video courses<br><br> Identify and catalog use cases<br><br> Gather tribal knowledge and best practices from existing customer engagements<br><br> Deliver classes and workshops &nbsp;<br><br>You might be a good fit for this role if you:<br><br>• Have solid development experience (any or all of web, mid tier, mobile). Preferred languages: JS, node, c#, java<br><br>• Have an inexhaustible desire to make your audience truly learn and understand, no matter how hard the topic is<br><br>• Are an excellent communicator across multiple mediums, in particular written documentation<br><br>• Have passion and willingness to go deep on things<br><br>• Have had exposure to (or even better, experience in) the challenges of distributed architecture and/or security<br><br><br>Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will confirm work authorization for candidates residing in the United States.<p>See more jobs at <span>Auth0</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vv7Dwc0CQ6qYzxNhVAJAJw",
    "url": "http://workinstartups.com/job-board/job/71684/community-manager-at-inspiral/",
    "title": "Community Manager",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Inspiral",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2018 2:51:29 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Inspiral is a venture-backed company that empowers people around the world to share knowledge and skills instantly. Become a cook, fix appliances, assemble furniture - learn any task in seconds. We build practical science fiction to create the dream of instant knowledge. We are a unique founding team featuring a unicorn founder, a growth hacker, and a technology wizard. Additionally, we are fortunate to be joined by an incredible advisory board and support network featuring some of London’s top entrepreneurs.<br /><br />Inspiral is a venture-backed company that empowers people around the world to share knowledge and skills instantly. Become a cook, fix appliances, assemble furniture - learn any task in seconds. Instant knowledge. Practical science fiction.<br /><br />We are a unique founding team featuring a unicorn founder (one of the TOP 10 most influential women entrepreneurs), a growth hacker, and a technology wizard. As a cherry on top, we are lucky to be joined by an incredible advisory board and support network featuring some of London’s top entrepreneurs.<br /><br />As a platform featuring user-generated content, our creator community is the centerpiece of our business. This is why we are looking for a highly proactive community manager to join our small team and help shape the future of instant education.<br /><br />For this role we ideally look for: <br />* Passion for tech-for-good products and building something meaningful <br />* Data-conscious, iterative approach to problem-solving <br />* Ability to start and foster relationships with a variety of different personalities <br />* Outgoing personality and proactive attitude towards your work <br />* Creativity and ability to learn fast<br /><br />Nice to have’s: <br />* Enthusiasm for content creation on platforms like Snapchat, Instagram, Youtube <br />* Experience with kick-starting and managing an online community <br />* Past projects using social media marketing strategies and tools <br />* Experience producing content and writing newsletters<br /><br />In your application please include: <br />* Any online profiles (LinkedIn, Twitter, etc.) <br />* A description of your professional experience (LinkedIn, CV, or similar) <br />* No long cover letter needed (we prefer meeting you)<br /><br />We love people with experience. But even more, we love people who love our open culture and working together as a team. We are looking for ambitious self-starters with a growth mindset who are enthusiastic about our mission and think on a truly global scale.<br /><br />You will be working directly together with the co-founding team featuring one of Europe’s top tech entrepreneurs as well as an experienced growth hacker. If you love creating the future of instant education as much as we do - apply now and let’s grab a coffee!",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LzZYUoeHT66M5ErJpx2xFw",
    "url": "https://feeds.feedblitz.com/~/562526234/0/problogger/jobs~Experienced-Editor-for-a-Technology-blog/",
    "title": "Experienced Editor for a Technology blog",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/apple",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "apple"
    ],
    "hiringOrganization": {
      "name": "SJD Infotech",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 4, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Experienced Editor for a Technology blog</h2><div>Company: SJD Infotech</div>Location: Anywhere<br><br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>Upcoming site JoyofApple.com (sister site of JoyofAndroid.com) is looking for an experienced editor on a part time basis (1 to 2 hours per weekday) to edit articles that will be published on the site.</p><p>Working closely with a team of writers, Editor will review, edit, feedback to writers and on some occasion will write articles. Editor will standover the quality of articles published and ensure&nbsp;that the content adheres to JoyofApple's standards and processes.</p><p><strong>Responsibilities include: </strong></p><ul><li>Creating and maintaining the Joy of Apple content calendar</li><li>Work with writers and feedback diplomatically</li><li>Edit and proofread articles before they get published</li><li>Ensure posts adhere to SEO best practices and internal guidelines</li><li>Work hand in hand with content promotion team members to drive traffic with high quality and identifiable content</li><li>Work closely with the Head of Content on strategic content initiatives and editorial team processes</li></ul><p><strong>You:</strong></p><ul><li>Must own an Apple phone</li><li>Own a Mac (optional)</li><li>Must have some experience being an editor</li><li>Have an understanding of the Apple space, applications and platforms</li><li>Have the ability to work remotely and independently, while meeting deadlines</li><li>Can motivate part time employees from across the globe to create great, compelling and informational content that drives readership</li><li>Understand the value of readership metrics and content testing to inform editorial strategy</li></ul><p><strong>Contact us with the following details:</strong></p><ul><li>Share us a short story about you - to illustrate why we should hire you</li><li>List us the Apple devices you own</li><li>Your location</li><li>Your hourly rate</li><li>Your availability and work timezones</li><li>Tell us about your editor experience</li></ul>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "msu4MpXSSWKdg7R9pxa7lw",
    "url": "http://workinstartups.com/job-board/job/71485/content-creation-for-health-amp-wellbeing-app-at-earthmiles-ltd/",
    "title": "Content Creation for Health &amp; Wellbeing App",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=16, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Earthmiles Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 30, 2018 5:53:58 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "We’re looking to hire a phenomenal Content Creator to work with us on Earthmiles’ exciting mission! At Earthmiles, we’re helping people be healthier and happier – and have some fun on the way. Earthmiles app uses gamification-based behaviour modification tools to incentivise healthier living. We are a 9-member team of passionate and high energy people who want to make a real difference.<br /><br />If you’re looking to work in a creative and driven team, being involved in something with massive social impact, this is the place for you. If you have a passion for health & fitness, you will identify with our mission even more.<br /><br />As our Content Creator, you will be responsible for a lot of the content that appears within our two mobile platforms - Earthmiles and Earthmiles@Work. Your content will also be distributed across our other channels such as our website's blog, our company's LinkedIn page and client newsletters.<br /><br />The blog pieces would be well-researched, unbiased articles covering a variety of cutting edge topics relating to various aspects of health & wellbeing. You will use your keen intuition and tendency to find the &quot;right word&quot; to create informative, educational but enjoyable pieces of content in various formats.<br /><br />We can also create a secondary opportunity for you to collaborate with our business development team, sales team, or client launch events team to have another aspect to your role and develop your skills more broadly.<br /><br />There is a lot of potential for flexibility and independence in the role to be a driven, self-starting entrepreneurial person. However you will have structured guidance and a lot of input from the senior team. If you can work very hard and take a lot of responsibility, we will encourage you to run with things independently. At Earthmiles we don’t believe in micromanaging, but in each person pulling their own weight. We aim to provide an environment that fosters your personal development and a competitive salary commensurate with your experience and skills.<br /><br />Must-haves: <br /><br />Native-level written and spoken English communication skills. Very good grammar is a must.<br />Organised, with really good attention to detail (i.e. checking your own work and making sure you are happy with your output. Holding yourself to a very high standard.)<br />A flair for finding the right word, and / or written sense of humour / ability to write “on-brand” messages would be a bonus<br />An ability to do grounds-up research to put together content on a variety of topics (e.g. sleep, nutrient deficiency, etc) from trusted (cited) resources<br />An enthusiasm for hard work and building something amazing (“mission-driven”)<br />A passion for people, health and wellbeing, and making a difference<br /><br />Good-to-haves:<br /><br />An eye for design aesthetics, and some basic skills in putting together digital content using Adobe Photoshop or other clients would be a bonus<br />A demonstrable interest in startups<br />Experience in use of MailChimp-style email clients, etc. would be an added bonus<br />Love for health, fitness, and wellbeing, and a deep interest in these topics<br />A creative eye, and a love for writing. An ability to write all week, hit deadlines and create a specified amount of content.<br />-------------------------<br />Please respond to this opportunity with a Word or PDF version of your CV, a short paragraph in your email explaining what attracted you to this role and why you believe you would be suitable for it.<br />Please remember to include your contact email and phone number in your email or your CV so we can get in touch with you",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JddEgXsXR1-33nGSK3QR2A",
    "url": "https://cjl.ist/2Orwa5X",
    "title": "Technical Documentation Writer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/nodejs",
      "TECH1/python",
      "TITLE1/writer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go",
      "nodejs",
      "python"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 30, 2018 1:10:07 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Technical Documentation Writer</h2>   Location:    Remote    Stoke Upon Trent    UK  <div>  Role and job type: ️ Content Full-time </div> <div>  <h3>Job Description</h3>  <p>As a Technical Documentation Writer, you will work closely with our global team to create and maintain content that enables our users to do amazing things with Radix. You will work with product managers, developers, quality engineers, developer advocates, technical support, and marketing to create content that not only provides useful information but also serves to enhance the overall user experience.</p>  <p><strong>Your main responsibilities are:</strong></p>  <ul>   <li>Interview project team members, subject matter experts, customers, and product support to determine required technical and user information.</li>   <li>From planning to delivery, you will work with stakeholders to plan and document new features/APIs. You will be responsible for creating appropriate content in the form of concepts and architecture guides, developer guides, code samples, language references, API references, and other online material such as training videos.</li>   <li>Translate technical and complex concepts into concise and comprehensive instructions and explanations.</li>   <li>Opinions on what technologies and standards we should use now and in the future, we always want to hear new ideas.</li>   <li>Review and edit documents written by other staff and work with non-writers on ways to improve their writing skills and contributions to documentation.</li>   <li>Work independently with minimal supervision.</li>   <li>Implementation, consistent delivery, and on-going improvement of live and virtual training programs.</li>   <li>Work closely with the support and implementation teams to identify areas of improvement in product training and documentation.</li>   <li>Research and write documentation that is technically accurate, consistent, appropriate for the audience, and consistent with our writing style.</li>   <li>Create product style sheets and style guides to ensure consistency between multiple authors and products.</li>   <li>Make customer-requested changes/edits to existing documentation, as appropriate.</li>   <li>Prior experience with startups and working with agile, cross-functional teams is a plus. In-depth knowledge about DLT or blockchain technology is not required, but candidates should generally be interested in the technologies poised to transform the way we live and be open to learning deeply about blockchain topics.</li>  </ul>  <p><strong>Must have:</strong></p>  <ul>   <li>A minimum of 3 years of technical writing experience on enterprise infrastructure software technologies, preferably with a database or data management software development focus.</li>   <li>Experience with multimedia with a proven ability to translate complex software processes into an easy to understand multimedia format such as infographics or short videos.</li>   <li>Able to read/write/execute basic sample code written in one or more of the following programming languages: Java, Javascript, Python.</li>   <li>General knowledge of SEO and marketing analytics best practices.</li>   <li>Have done and like to do demonstrably hard things</li>   <li>Opinions on what technologies and standards we should use now and in the future, we always want to hear new ideas.</li>   <li>Interest in DLT/Blockchain Technologies.</li>  </ul>  <p><strong>Nice to have:</strong></p>  <ul>   <li>Working knowledge of HTML or JavaScript.</li>   <li>Knowledge of DLT/blockchain technology such as decentralization and cryptographic protocols.</li>   <li>Knowledge and experience with a relational/NoSQL database</li>   <li>Knowledge of git, branching, continuous integration and modern development pipelines.</li>   <li>Strong visual and aesthetic sense.</li>   <li>Great interpersonal skills and a willingness to go above and beyond when collaborating with the rest of the team.</li>  </ul>  <p><strong>Benefits:</strong></p>  <ul>   <li>£30-45K salary. We know it’s the people that make a startup win and fail and we recognise that in our benefits.</li>   <li>Flexible working - our normal working hours are 9 to 6 but we trust you to manage your time if something different works for you.</li>   <li>3 months located with our CTO, Dan, in Stoke, England. After this period, you may locate anywhere</li>   <li>To be part of something amazing. We’re creating friction free access to the digital economy and it’s going to change the world</li>  </ul>  <h4>Salary range</h4>  <p>£30-45K</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "KpMy4ttsQZ2oGuh-a2Ekww",
    "url": "https://cjl.ist/2mRFHXn",
    "title": "Developer Community Evangelist",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 30, 2018 12:54:14 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Developer Community Evangelist</h2>   Location:    Remote    London  <div>  Role and job type:  Community Full-time </div> <div>  <h3>Job Description</h3>  <p><strong>Responsibilities:</strong></p>  <ul>   <li>Responding to community enquiries on Telegram, Discord, Reddit, Facebook, Zen Desk and others on a daily basis</li>   <li>Ensuring an open, welcoming and friendly tone on all Radix community platforms</li>   <li>Support the coordination and delivery of community events</li>   <li>Collect and share feedback on the platform with the Research and Product teams</li>   <li>Learning common requests and enquiries and proactively anticipating future issues or concerns</li>   <li>Working with the Head of Community to create support materials, FAQs and guides for our community</li>  </ul>  <p><strong>You have:</strong></p>  <ul>   <li>Excellent written and spoken English</li>   <li>An understanding of DLT and blockchain technologies and a passion for how they can change the world</li>   <li>Community or customer service experience</li>   <li>Done and like to do demonstrably hard things</li>  </ul>  <p><strong>You are:</strong></p>  <ul>   <li>Detail-oriented and organised.</li>   <li>A good multi-tasking making sure all tasks and enquiries are met in a timely manner</li>  </ul>  <p><strong>YOU MUST APPLY VIA WORKABLE </strong>- <a href='https://radixdlt.workable.com/jobs/765396' rel='nofollow'>https://radixdlt.workable.com/jobs/765396</a></p>  <h4>Salary range</h4>  <p>£18-23K</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "o9WXnj0yQKm1v4SRXBgmxQ",
    "url": "http://workinstartups.com/job-board/job/71438/technical-sales-representative-at-aurity/",
    "title": "Technical Sales Representative",
    "tags": [
      "DBG:surround``5N( cultur, 2N(remot, OR(work,worker)) )",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Aurity",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 4:47:39 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "DESCRIPTION<br /><br />We are Aurity, a cutting-edge team with a great passion for development, always looking for new solutions and the best technology. We work with clients from all around the world who have projects that keep us motivated and help us to learn and constantly grow. We support huge startups similar to Uber and Monzo in developing web, mobile apps and backends.<br /><br />If you’re looking for a new role, which includes Direct Sales, Account Management and Lead Generation whilst being rewarded well for your efforts then this one could be for you! We have been extremely successful in providing solid solutions to our clients and pairing them with the best developers.<br /><br />We’re looking for a results-driven sales representative to actively seek out and engage customer prospects. You will provide complete and appropriate solutions for every customer in order to boost top-line revenue growth, customer acquisition levels and profitability. You will be required to ;<br /><br />Seek out new leads, providing us with solid clients who require the assistance of developers.<br />Present, promote and sell technical products/services using solid arguments to existing and prospective customers<br />Perform cost-benefit and needs analysis of existing/potential customers to meet their needs<br />Establish, develop and maintain positive business and customer relationships<br />Reach out to customer leads through conferences, meetups, cold calling and emailing.<br />Take part in sales and strategic account management on projects ranging from £50k - £500k, to accelerate the company’s growth<br />Achieve agreed upon sales targets and outcomes within schedule<br />Coordinate sales effort with team members and other departments<br />Analyse the territory/market’s potential, track sales and status reports<br />Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.<br />Keep abreast of best practices, promotional trends and technology<br />Generating and following up new leads, sales and ensuring customer loyalty through excellent account management.<br />Following up new business opportunities and setting up meetings, planning and preparing presentations/proposals<br />Maintains internal CRM and meets minimum data standards<br />REQUIREMENTS<br /><br />You are a former entrepreneur, consultant, software agency project manager or business developer.<br />Passionate about the value add of technology to the business world<br />Have knowledge of React, React Native, Node, Elixir and other cutting-edge technologies.<br />You live in the territory of Western Europe or the United States<br />Available to travel to meet new clients and attend conferences<br />Familiarity with BRM and CRM practices along with ability to build productive business professional relationships<br />Highly motivated and target driven with a proven track record in sales preferably with projects above £50k<br />Excellent selling, communication and negotiation skills<br />Prioritizing, time management and organizational skills<br />BS/BA degree or equivalent<br />Ability to do market research and acquire knowledge and understanding of market Organisations and planning skills<br />Negotiating and influencing skills<br />8 years’ solid experience in B2B selling experience, ideally in the technology sector<br />You are a driven sales person, comfortable with selling in person, over the phone or email. Willing and ready to pick up a completely cold desk and turn clients in to tangible, high- returning partners.<br />BENEFITS<br /><br />A great opportunity for professional development within a innovative and fast growing company.<br />One month #hackerhouse that we arrange every 6-8 months at various tropical destinations.You can join the team there, have some fun and work! We make sure the internet connection is very good. Our next one will be in Bali.<br />The opportunity to work within a dynamic company with a start-up culture.<br />Remote working<br />Get paid for additional education and conferences.<br />For additional benefits take a look at our blog.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3CrUCnFaTBiGKbRKpQaeYw",
    "url": "https://unicornhunt.io/jobs/technical-sales-representative-at-aurity-ltd",
    "title": "Technical Sales Representative",
    "tags": [
      "DBG:surround``5N( cultur, 2N(remot, OR(work,worker)) )",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Aurity Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 2:19:18 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>We’re looking for a results-driven sales representative to actively seek out and engage customer prospects. You will provide complete and appropriate solutions for every customer in order to boost top-line revenue growth, customer acquisition levels and profitability. You will be required to ;</p><ul><li>Seek out new leads, providing us with solid clients who require the assistance of developers.</li><li>Present, promote and sell technical products/services using solid arguments to existing and prospective customers</li><li>Perform cost-benefit and needs analysis of existing/potential customers to meet their needs</li><li>Establish, develop and maintain positive business and customer relationships</li><li>Reach out to customer leads through conferences, meetups, cold calling and emailing.</li><li>Take part in sales and strategic account management on projects ranging from £50k - £500k, to accelerate the company’s growth</li><li>Achieve agreed upon sales targets and outcomes within schedule</li><li>Coordinate sales effort with team members and other departments</li><li>Analyse the territory/market’s potential, track sales and status reports</li><li>Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.</li><li>Keep abreast of best practices, promotional trends and technology</li><li>Generating and following up new leads, sales and ensuring customer loyalty through excellent account management.</li><li>Following up new business opportunities and setting up meetings, planning and preparing presentations/proposals</li><li>Maintains internal CRM and meets minimum data standards</li></ul> REQUIREMENTS <ul><li>You are a former entrepreneur, consultant, software agency project manager or business developer.</li><li>Passionate about the value add of technology to the business world</li><li>Have knowledge of React, React Native, Node, Elixir and other cutting-edge technologies. </li><li>You live in the territory of Western Europe or the United States </li><li>Available to travel to meet new clients and attend conferences</li><li>Familiarity with BRM and CRM practices along with ability to build productive business professional relationships</li><li>Highly motivated and target driven with a proven track record in sales preferably with projects above £50k</li><li>Excellent selling, communication and negotiation skills</li><li>Prioritizing, time management and organizational skills</li><li>BS/BA degree or equivalent</li><li>Ability to do market research and acquire knowledge and understanding of market Organisations and planning skills</li><li>Negotiating and influencing skills</li><li>8 years’ solid experience in B2B selling experience, ideally in the technology sector</li><li>You are a driven sales person, comfortable with selling in person, over the phone or email. Willing and ready to pick up a completely cold desk and turn clients in to tangible, high- returning partners.</li></ul> BENEFITS <ul><li>A great opportunity for professional development within a innovative and fast growing company.</li><li>One month #hackerhouse that we arrange every 6-8 months at various tropical destinations.You can join the team there, have some fun and work! We make sure the internet connection is very good. Our next one will be in Bali.</li><li>The opportunity to work within a dynamic company with a start-up culture. </li><li>Remote working</li><li>Get paid for additional education and conferences.</li><li>For additional benefits take a look at our blog.</li></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "wk_7MJPNSFSxrrNTuaIsDQ",
    "url": "https://feeds.feedblitz.com/~/561001240/0/problogger/jobs~Photography-Writer/",
    "title": "Photography Writer",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:flash/frontend/8",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Digital Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Photography Writer</h2><div>Company: Digital Photography School</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p><span>One of the world’s largest photography blogs </span><a href='http://www.digital-photography-school.com/' rel='nofollow'><span>www.Digital-Photography-School.com (dPS)</span></a><span> is seeking photographers to join our remote writing team! </span></p><p>&nbsp;</p><p><span>You need to be able to submit two articles per month or more about helpful photography tips and techniques. Your articles need to be of a high-quality, demonstrate a deep knowledge of digital photography and include your own original images. </span></p><p>&nbsp;</p><p><span>Ideally, we’re looking for people with heaps of photography experience (profession or semi-pro) and/or teaching and instructing experience. Some knowledge of WordPress and online writing is beneficial also. </span></p><p>&nbsp;</p><p><span>dPS aims to help beginner to intermediate photographers to improve their photography through well written, informative content including topics such as:</span></p><ul><li><span>Composition</span></li><li><span>Camera settings and techniques</span></li><li><span>How to use gear</span></li><li><span>Post-processing</span></li><li><span>Photo tutorials about various topics including: weddings, portraiture, sports, landscapes, street photography, wildlife, events, flash photography, etc.</span></li></ul><p>&nbsp;</p><p><span>Our articles need to focus on: how to, photography tips, or tutorial content. The more practical the better as they will be more useful to new photographers. If you have a high quality image library of your own pictures to use as examples in articles and have a very strong grasp of the English language (if it’s not your native language you must show a proficiency in English in your communication and/or trial) this will be especially advantageous.</span></p><p><span> &nbsp;</span></p><p><span>So if you can:</span></p><ul><li><span>Provide a link to your high quality professional photography portfolio</span></li><li><span>Show photography writing and/or teaching experience (do you lead photography workshops, write tutorials, write a photography blog? etc.)</span></li><li><span>Commit to writing at least two quality articles per month</span></li><li><span>Teach others about photography in a friendly, technical but easy-to-understand style</span></li></ul><p>&nbsp;</p><p><span>Apply today at.....</span></p><p><a href='http://digital-photography-school.com/writingapplication' rel='nofollow'><span>http://digital-photography-school.com/writingapplication</span></a><span> Include: your name, a paragraph about &nbsp;your relevant experience, at least one sample of your writing on digital photography, some suggested post titles/topics that you feel you'd be able to cover, and any other relevant information </span></p><p><span>Please make this submission by midnight (EST NYC time) August 31st, 2018. </span></p><p><span>Note that last time this was advertised we had a large number of applicants and it took some time to process. Once the cut off date arrives we will collate the responses and shortlist the most appropriate applicants. </span></p><p>&nbsp;</p><p><span>Shortlisted candidates will be invited to submit a trial post to be used on dPS (you will be remunerated for this) to see how it is received by readers and to let you see if it is a fit for you too. After all shortlisted candidates trial posts are published you will be notified as to whether your application has been successful or not. Please note: this process can take several weeks. This is a paid position (per post) as part of a dynamic writing team of photographers based all around the world. You will also receive additional promotion of your own photographic projects in your bylines on our popular site which reaches millions of readers around the world each month.</span></p>          </div>                <h4>Application Instructions</h4>    <div>                            Include: your name, a paragraph about &nbsp;your relevant experience, at least one sample of your writing on digital photography, some suggested post titles/topics that you feel you'd be able to cover, and any other relevant information<br><br>Please make this submission by midnight (EST NYC time) August 31st, 2018.<br><br>Note that last time this was advertised we had a large number of applicants and it took some time to process. Once the cut off date arrives we will collate the responses and shortlist the most appropriate applicants.                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3_VJHlzKTSqdMUAGbLR86w",
    "url": "https://problogger.com/jobs/job/2/",
    "title": "Photography Writer",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:flash/frontend/8",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Digital Photography School",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Photography Writer</h2><div>Company: Digital Photography School</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p><span>One of the world’s largest photography blogs </span><a href='http://www.digital-photography-school.com/' rel='nofollow'><span>www.Digital-Photography-School.com (dPS)</span></a><span> is seeking photographers to join our remote writing team! </span></p><p>&nbsp;</p><p><span>You need to be able to submit two articles per month or more about helpful photography tips and techniques. Your articles need to be of a high-quality, demonstrate a deep knowledge of digital photography and include your own original images. </span></p><p>&nbsp;</p><p><span>Ideally, we’re looking for people with heaps of photography experience (profession or semi-pro) and/or teaching and instructing experience. Some knowledge of WordPress and online writing is beneficial also. </span></p><p>&nbsp;</p><p><span>dPS aims to help beginner to intermediate photographers to improve their photography through well written, informative content including topics such as:</span></p><ul><li><span>Composition</span></li><li><span>Camera settings and techniques</span></li><li><span>How to use gear</span></li><li><span>Post-processing</span></li><li><span>Photo tutorials about various topics including: weddings, portraiture, sports, landscapes, street photography, wildlife, events, flash photography, etc.</span></li></ul><p>&nbsp;</p><p><span>Our articles need to focus on: how to, photography tips, or tutorial content. The more practical the better as they will be more useful to new photographers. If you have a high quality image library of your own pictures to use as examples in articles and have a very strong grasp of the English language (if it’s not your native language you must show a proficiency in English in your communication and/or trial) this will be especially advantageous.</span></p><p><span> &nbsp;</span></p><p><span>So if you can:</span></p><ul><li><span>Provide a link to your high quality professional photography portfolio</span></li><li><span>Show photography writing and/or teaching experience (do you lead photography workshops, write tutorials, write a photography blog? etc.)</span></li><li><span>Commit to writing at least two quality articles per month</span></li><li><span>Teach others about photography in a friendly, technical but easy-to-understand style</span></li></ul><p>&nbsp;</p><p><span>Apply today at.....</span></p><p><a href='http://digital-photography-school.com/writingapplication' rel='nofollow'><span>http://digital-photography-school.com/writingapplication</span></a><span> Include: your name, a paragraph about &nbsp;your relevant experience, at least one sample of your writing on digital photography, some suggested post titles/topics that you feel you'd be able to cover, and any other relevant information </span></p><p><span>Please make this submission by midnight (EST NYC time) August 31st, 2018. </span></p><p><span>Note that last time this was advertised we had a large number of applicants and it took some time to process. Once the cut off date arrives we will collate the responses and shortlist the most appropriate applicants. </span></p><p>&nbsp;</p><p><span>Shortlisted candidates will be invited to submit a trial post to be used on dPS (you will be remunerated for this) to see how it is received by readers and to let you see if it is a fit for you too. After all shortlisted candidates trial posts are published you will be notified as to whether your application has been successful or not. Please note: this process can take several weeks. This is a paid position (per post) as part of a dynamic writing team of photographers based all around the world. You will also receive additional promotion of your own photographic projects in your bylines on our popular site which reaches millions of readers around the world each month.</span></p>          </div>                <h4>Application Instructions</h4>    <div>                            Include: your name, a paragraph about &nbsp;your relevant experience, at least one sample of your writing on digital photography, some suggested post titles/topics that you feel you'd be able to cover, and any other relevant information<br><br>Please make this submission by midnight (EST NYC time) August 31st, 2018.<br><br>Note that last time this was advertised we had a large number of applicants and it took some time to process. Once the cut off date arrives we will collate the responses and shortlist the most appropriate applicants.                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "C3e2WP8OQ9WsBxvVRn7OYA",
    "url": "https://remoteok.io/jobs/68241",
    "title": "Freelance Writer to Simplify Legalese",
    "tags": [
      "DBG:surround``remot W OR(contractor,assist,ok)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Legalcom",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 26, 2018 5:47:13 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Freelance Writer to Simplify Legalese</h2></span><br><span><h3>Legalcom</h3></span> <span>verified</span></td><div><div>We're looking for reliable, talented freelance writers who love writing about a wide range of topics, including legal topics.<br><br>Most of our work is on legal topics. All topics related to legal are entry-level and not at an academic level.<br><br>You'll be writing about everything from why a certain legal contract is required for a business to writing a checklist article of best tools to use for an e-commerce store to increase sales.<br><br>**About The Work**<br><br>We understand the value of quality content. We're not looking for plain text articles, but well-researched articles to educate our customers: articles with images, links, quotes from research papers, expert's quotes etc.<br><br>Our articles are often 1000+ words, generally around 2,000 words. Some articles are beyond 10,000 words.<br><br>We're not looking to game search engines, but rather educate our customers about the legal contracts they're searching for. We aim to be a teacher to our customers.<br><br>We are looking for writers available for a minimum of one day/week. We have as much work as you can handle. We don't micromanage.<br><br>We are very clear on what we want for every article. We provide topics with a proposed structure including due dates and the minimum required length. There is sometimes communication back and forth during the revision session. But for the most part: you write the article, turn it in, we review and ask for edits if necessary and then publish it.<br><br>Writers get paid every other week, in US dollars by PayPal.<br><br>Depending on where we'll publish your work, and for as much as we can, we'll show your bio byline to give you author credits.<h2>Responsibilities</h2>* Native English speaker with strong writing skills. We can make an exception on this if you have English Proficiency qualification.* Exceptional online research skills* Well organized and reliable* Some degree of technical proficiency (using Google Docs, taking screenshots)It’s a major plus if you have any of the following:* Legal degree or paralegal experience<h2>Requirements</h2>Please format your subject line as follows: &quot;Your Name | Freelance Writer | Remote OK&quot; (example: John Doe | Freelance Writer | Remote OK).Send an email to office@legalcom.group with:* A 4-5 sentence introduction explaining why you think you would be a good fit* 3 URLs showcasing your work related to internet laws or technology* Your freelance writing ratesWe look forward to hearing from you!<p>See more jobs at <span>Legalcom</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "iMHkQy6BRja7KLGEHtY1Qw",
    "url": "https://feeds.feedblitz.com/~/560556522/0/problogger/jobs~Freelance-Writer-to-Simplify-Legalese/",
    "title": "Freelance Writer to Simplify Legalese",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Legalcom Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 24, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Freelance Writer to Simplify Legalese</h2><div>Company: Legalcom Group</div>Location: Anywhere<br><br>Job Type: Freelance<div>  <h4>Description</h4>  <div>                    <p>We’re looking for reliable, talented freelance writers who love writing about a wide range of topics, including legal topics.</p><p>Most of our work is on legal topics. All topics related to legal are entry-level and not at an academic level.</p><p>You’ll be writing about everything from why a certain legal contract is required for a business to writing a checklist article of best tools to use for an e-commerce store to increase sales.</p><p>&nbsp;</p><h3><span>About The Work</span></h3><p>We understand the value of quality content. We’re not looking for plain text articles, but well-researched articles to educate our customers: articles with images, links, quotes from research papers, expert’s quotes etc.</p><p>Our articles are often 1000+ words, generally around 2,000 words. Some articles are beyond 10,000 words.</p><p>We’re not looking to game search engines, but rather educate our customers about the legal contracts they’re searching for. We aim to be a teacher to our customers.</p><p>We are looking for writers available for a minimum of one day/week. We have as much work as you can handle. We don’t micromanage.</p><p>We are very clear on what we want for every article. We provide topics with a proposed structure including due dates and the minimum required length. There is sometimes communication back and forth during the revision session. But for the most part: you write the article, turn it in, we review and ask for edits if necessary and then publish it.</p><p>Writers get paid every other week, in US dollars by PayPal.</p><p>Depending on where we’ll publish your work, and for as much as we can, we’ll show your bio byline to give you author credits.</p><p>&nbsp;</p><h3><span>Job Requirements</span></h3><ul><li><span>Native English speaker with strong writing skills. We can make an exception on this if you have English Proficiency qualification.</span></li><li><span>Exceptional online research skills</span></li><li><span>Well organized and reliable</span></li><li>Some degree of technical proficiency (Google Docs, taking screenshots)</li></ul><p><span>It’s a major plus if you have any of the following:</span></p><ul><li><span>Legal degree or paralegal experience</span></li></ul><p>&nbsp;</p><h3><span>How Do We Work?</span></h3><p>We work remotely. We don’t need to sync time zones.</p><p>We work over Google Docs and email.</p><p>&nbsp;</p><h3><span>How To Apply?</span></h3><p><span>Please format your subject line as follows: Your Name | Freelance Writer | ProBlogger (example: John Doe | Freelance Writer | ProBlogger).</span></p><p><span>Please send an email to <span>[email&nbsp;protected]</span> with:</span></p><ul><li><span>A 4-5 sentence introduction explaining why you think you would be a good fit</span></li><li><span>3 URLs showcasing your work related to internet laws or technology</span></li><li>Your freelance writing rates</li></ul><p><span>We look forward to hearing from you!</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WAo-vkovQK251YmTW9HWXw",
    "url": "https://cjl.ist/2zXWJwl",
    "title": "ICO Reviews and Blockchain Articles Writer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 22, 2018 7:00:37 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>ICO Reviews and Blockchain Articles Writer </h2>   Location:    Remote    UK    Brazil  <div>  Role and job type: ️ Content Contractor </div> <div>  <h3>Job Description</h3>  <p>We are doing ICO Reviews as the MVP. After we establish a content frequency we will also publish other kinds of contents and will increase the number of posts and of course, the investment.</p>  <p>All the content is being posted in CryptoPig.com, we will also start sharing in Medium, Steemit, and Twitter.</p>  <p>The website structure is very simple now. We will develop new functionalities as we add more services to it.</p>  <p>Our team is currently composed by me, my partner, 2 researchers and 1 writer.</p>  <p>We are all connected in Telegram to discuss ideas and in Trello to manage the production flow. So we would like you to not just write the reviews, but to engage in this environment as well.</p>  <p>As you are a crypto expert, I am pretty sure you are also an investor. So besides payments, we will offer you the possibility to get into ICO pre-sales with us. We don’t want to just hire a freelancer, we want to build a great partnership and a strong team.</p>  <p>This is our review structure:</p>  <p><a href='http://cryptopig.com/blockcloud/' rel='nofollow'>http://cryptopig.com/blockcloud/</a><br><a href='http://cryptopig.com/dxchain/' rel='nofollow'>http://cryptopig.com/dxchain/</a></p>  <p>We want to keep the same topics and style for all our reviews.</p>  <p>Want to join our team?</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yS4SmmH_Q-OTU2PsEmkweA",
    "url": "http://workinstartups.com/job-board/job/71165/junior-copywriter-at-amplify-life/",
    "title": "Junior Copywriter",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:app-store/mobile/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/mobile",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Amplify Life",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 19, 2018 3:16:27 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Amplify Life is a personal challenge and coaching hub, recently available on the App Store and Google Play. <br />We are looking for a creative Copywriter to join our dynamic team based in a unique location on the outskirts of Horsham. With stunning countryside views, a team who are full of life and a quickly evolving brand, Amplify Life is truly an exceptional place to work. <br /><br />Reporting into the CMO, you will write clear, concise and compelling copy for various mediums (such as app and web copy, ads, blog posts and newsletters) to support health and fitness coaching content. You will conduct thorough research and interviews and work with creative professionals to build marketing projects and campaigns. Your words will inform and engage our target audiences.<br /><br />Our ideal candidate is a team-spirited, skilled and imaginative writer with an eye for detail. If you can grasp project requirements quickly and offer valuable insight, we’d like to meet you.<br /><br />Responsibilities include:<br />•    Writing clear, attractive copy with a distinct voice<br />•    Working closely with UX lead to define copy for the App and the website<br />•    Interpreting copywriting briefs to understand project requirements<br />•    Collaborating with designers, PR and other professionals on large- and small-scale marketing projects (e.g. email campaigns and landing pages)<br />•    Supporting our Social Media campaigns<br />•    Conducting high-quality research and interviews<br />•    Editing and proofreading copy as needed<br />•    Using SEO and ASO principles to maximize copy’s reach<br />•    Sourcing images and other content<br />•    Supporting sponsored features copy<br />What we are looking for:<br />•    Proven experience as a copywriter or related role<br />•    Knowledge of online content strategy and creation<br />•    Excellent writing, editing and proofreading skills<br />•    Experience with ASO and SEO<br />•    Strong research skills<br />•    Creativity<br />•    Collaborative spirit<br />•    Excellent time-management and organizational skills<br />•    BSc/BA in marketing, English, journalism or related field<br />•    Familiar with Sport/Fitness/Health industry<br /><br />Does this sound like you? Then please get in touch with your CV and up to three writing samples so we can get an idea of your best work. Feel free to include links to your content or portfolio in your application.<br /><br />Amplify can offer a competitive salary and benefits as well as 25 days holiday (excluding bank holidays). Our offices offer a stunning and peaceful setting to work in, a fully stocked soft drinks fridge, BBQ facilities, sun terrace, table tennis table, football and badminton facilities and a woodland adventure trail. <br /><br />Due to remote location access to a car is a must!<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4lBe_BjoTza3cQYYPUFnxQ",
    "url": "http://workinstartups.com/job-board/job/70899/entertainment-content-writers-at-film-daily/",
    "title": "Entertainment: Content Writers",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Film Daily",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2018 4:57:30 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Freelance writer rate + site credits + various perks<br />Minimum 3-month commitment & min. 1 feature per month<br /><br />Location: Anywhere in the known universe with an internet connection OR from our offices in LA, Mexico City, or York, UK<br /><br />Who we are: Always now, forever independent<br /><br />Film Daily is an online platform connecting audiences with indie filmmakers via news, views, and reviews.<br /><br />Our publication is growing quickly and we’re looking for a team of talented freelance scribes to write about the ever-expanding world of indie film, filmmaking, film festivals, and content streaming.<br /><br />Our target audience is Gen Z, Gen X, and Millennials. We aim to keep our audience entertained about entertainment.<br /><br />We foster a culture of communication, community, teamwork, and collaboration. Join us now!<br />Person specification<br /><br />We need streaming savvy content writers to join our team. You’ll love indie film and peak/cinematic TV and keep up to date with entertainment news. You’ll be able to write quickly, accurately and legally and know how to pitch an editor.<br /><br />•    Film & TV obsessive<br />•    You know your Kurosawa from your Kubrick, your Lynch from your Leigh, your Girls from your Broad City.<br />•    High achiever<br />•    You (think you) understand the way the film & TV industries works.<br />•    You know how to use web searches to learn new skills.<br />•    Dedicated lifelong learner<br />•    Looking for a new challenge<br />•    Willing to do whatever it takes to achieve results<br />•    Able to prioritize your workload<br />•    You think change in Hollywood is long overdue.<br />•    Impressive portfolio of published articles<br />•    Desire to work as a journalist or editor<br />•    Understanding of the way online publications work<br />•    Tenacious <br />•    You know A LOT about film and TV.<br />•    Words are just about your favorite thing.<br />•    You live on the internet.<br />•    You can take a complicated story and cut it down to 280 characters.<br />What we can offer <br /><br />•    Access to stream endless films & TV<br />•    Paid rates per article<br />•    Full credit/author page<br />•    As few or as many hours as you’d like<br />The Gig<br /><br />•    Film Daily is looking for the voices of your generation <br />•    We need contributors for our hungry website <br />•    Must have some social media and Wordpress experience<br />Skills<br /><br />•    Writing<br />•    Tweeting<br />•    Self-editing<br /><br />Find out what a day in the life of a Film Daily content writer looks like: https://filmdaily.co/obsessions/film-daily-content-warrior/<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
