{
 "items": [
  {
    "id": "_SVuLoTxSwWfGo6cHMMy2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/65966/rampd-consultant-at-granttree/",
    "title": "R&amp;D Consultant",
    "content": "DESCRIPTION<br /><br />Experience real freedom at work and help exciting companies get funding for their tech with full support towards CIMA qualification.<br /><br /><br />Do you love the thought of working with a wide variety of entrepreneurs and making a tangible difference to their business? Does the idea of helping big name clients on the tech scene excite you? Would you like to join a diverse, self managing team where you can shape the future of the business from day one? If this sounds like your cup of tea, read on.<br /><br /><br />We are looking for future talent to join our tax credits client management team who are as good with clients as they are crunching numbers behind the scenes. If you have passion for technology, a good head for figures and a love of learning then you could help hundreds of companies a year bring the future closer.<br /><br /><br />By the end of your first year<br /><br /><br />You will be well on the way to a CIMA qualification, with the full support of the company<br />You'll be an authority in government funding and will have learned how to read a company's financial statements.<br />You will have built great relationships with a large number of companies, big and small, giving you a deeper understanding of how start-ups work.<br />You'll also have had the chance to change the future of GrantTree, by taking part in running your team and the business as a whole.<br />REQUIREMENTS<br /><br />About you<br /><br />You are passionate about technology.<br />Ideally, you'll have previously nurtured B2B client relationships, or done something equivalent (like run your own business).<br />You are keen to learn about basic accounting principles and how HMRC’s R&D Tax Credits scheme works.<br />You're totally comfortable producing detailed spreadsheets and written text.<br />You will build rapport with the founders and technical leaders of our client companies, so that you can represent their business in the best way when applying for government funding.<br />If you have a background in technology (particularly software) or finance (corporate tax or accountancy) this is a definite bonus.<br />About us<br /><br />GrantTree was founded 6 years ago and employs 34 people. In our culture everyone has the freedom, power and trust to do great work. We call this open culture. Our open culture champions transparency and allows a flexible approach to work; it’s been successful for us so far, although it's not for everyone (check out our GlassDoor reviews to learn more).<br />BENEFITS<br /><br />We believe that people should be rewarded fairly for the work they do. At GrantTree there is transparency over salaries and the way we work them out. For this role, this is likely to lie between £25k and £35k. We also provide access to health insurance, cycle to work, and we have an annual profit sharing scheme for the whole team (which can be taken as shares or cash).<br /><br />Aside from money, we offer a place where you can be yourself. We want you to develop your skills and fulfil your potential. We have a flexible approach to working, and some of our staff work remotely most of the time. Our office near Old Street is bright and airy, with a well-stocked kitchen and a beautiful roof terrace. You can take up to 6 weeks as holiday each year.<br /><br />Equal opportunities<br /><br />Teams are stronger when they have a diverse range of people. Applications are welcomed from everyone, regardless of the categories they fit into. We also encourage talented ‘square pegs’, who don’t neatly fit into the person specification, to apply.",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 9:58:16 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "YbY9ng40Qq63m7UeCGL4-w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/9f8326e2-0b98-11e8-80ba-49fbb906adba",
    "title": "Full Time: Frontend Developer - Build the smartest way to buy a car (Remote - full time) at Unhaggle Inc. in Remote",
    "content": "<p>Unhaggle is currently the #1 web portal in Canada for new car buying. The data we provide powers our own tools and products, including our flagship consumer car buying service at Unhaggle.com and leading automotive portals including Yahoo Autos, MSN Autos, Autofocus, AutoGuide, Globe Drive, and others. We have also recently partnered with auto makers to launch a large eCommerce platform allowing the complete purchase of new cars online.</p><p>We are looking for Senior Front-end Developers with experience in web application development. <strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p><p>We use GitHub to manage tasks and code reviews as well as tools/services like Travis-CI, Docker, New Relic, Sentry, Browserstack, Stripe, Twilio, Solr and Redis.Our dev team is regularly connected in Slack for communication. We are constantly seeking the best tools available for our development team.</p><p>You will be primarily involved in the following projects/areas:</p><ul><li>Our new eCommerce platform for new car buying, serving major car brands</li><li>Our web portal unhaggle.com</li><li>Several SaaS products we built for Enterprise clients</li><li>Widgets we built for third-party integration, they run in some of the most popular auto websites in Canada.</li><li>We take quality seriously and you should expect to be involved in well written code bases following industry standards and good software development practices.</li></ul><p>Requirements:</p><ul><li>At least 3 years of Javascript professional experience.</li><li>At least 1 year of experience with the Django Web Framework is a bigplus.</li><li>Strong web development experience: we expect that you know XHTML, CSS and Javascriptvery well. Hands on experience with Javascript frameworks is a big plus, specially Vue.js</li><li>Proficient and hands on experience with responsive web sites, including the Bootstrap library.</li><li>You care about writing semantic well formed code and paying attention to standards and good practices.</li><li>Experience using version control software, Git is a plus.</li><li>Track record of delivering completed projects, preferably web-based.</li><li>Easy-going personality. You will actively participate in design discussions and code review.</li></ul><p>Bonus:</p><ul><li>Some experience with Linux is a big plus. You will be asked to deploy changes to our dev machines that are based in Linux (Ubuntu server). </li><li>Some experience with Python and/or experience with Django would be a big plus.</li></ul><p>We are helping consumers to get the best price on new cars in Canada and changing the industry along the way. Working at Unhaggle brings unique challenges, you will have the opportunity to leave a large footprint and have real impact in the product we ship every day to our customers.</p><p>No relocation available, we are a distributed team.</p><p>Please submit resume and cover letter to <a href='mailto:evandro@unhaggle.com' rel='nofollow'>evandro@unhaggle.com</a></p>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 2:03:24 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "W60I7QTHRN642NCYXXiG-Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166046/qlikview-evangelist-qlik?a=TGzAIMetrna",
    "title": "QlikView Evangelist at Qlik (London, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1k-5k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Public</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What makes us Qlik</strong></p><p>We’re motivated to help people make discoveries in data, share insights, make decisions and act with confidence. Making a difference, both in small and large ways, is our passion.&nbsp;</p><p>At the heart of Qlik is our Swedish soul, which guides everything from our culture and product design approach to our corporate social responsibility program. It’s what drives us to create a culture of innovation.</p><p>We believe data can change the world. And we believe people can, too</p><p>The&nbsp;QlikView Evangelist<br>As QlikView Evangelist for Qlik, you will be responsible for engaging with the QlikView customer based to highlight and promote the diverse benefits and use cases of QlikView.&nbsp; You will be an external facing individual with expert level QlikView knowledge from a business and technical perspective.&nbsp; You will help to drive and execute the go-to-market strategy for Qlik, with a primary focus on evangelizing QlikView to our customer base. This will entail engaging directly on Qlik Community at a technical level, supporting QlikView events and user groups, directly supporting sales engagements and developing positioning for QlikView.</p><p>In this highly visible role in a dynamic and rapidly growing worldwide organization, you will work closely with all areas of the business, including sales, technical pre-sales, product management, corporate marketing and our partner community.&nbsp;&nbsp;You will help articulate and deliver Qlik’s value proposition regarding QlikView.&nbsp;&nbsp;You will directly support the sales process through presentations, collateral creation, demonstrations, videos and other assets.&nbsp;The successful candidate will be an evangelist, a thought leader, spokesperson, and champion for QlikView.&nbsp;&nbsp;They will be both analytical and creative and must have direct hands on experience with QlikView.&nbsp;</p><p><strong>How you will spend your time as our next&nbsp;QlikView Evangelist?</strong></p><ul><li>Create core messaging and subsequent marketing collateral, such as sales presentations, whiteboard discussions, data sheets, technical whitepapers, videos and case studies</li><li>Engage through multiple channels including, Qlik Community, Videos, in person meeting and remote meetings to help customer maximize their investment in QlikView</li><li>Create core messaging and subsequent marketing collateral, such as sales presentations, whiteboard discussions, data sheets, technical whitepapers, videos and case studies</li><li>Help develop product positioning and messaging based on deeply understanding Qlik’s product capabilities, competitors and customer requirements</li><li>Work closely with sales and pre-sales organizations to optimally position Qlik products and help close and retain customers</li><li>Create innovative product demonstrations highlighting a range of industry and application-specific data analysis challenges</li><li>Deliver exceptional technical architecture presentations to present technical features and business benefits of QlikView</li><li>Be the go to QlikView expert within Qlik from a solution and technical standpoint</li></ul><p><strong>You will be&nbsp;successful&nbsp;if you have</strong></p><ul><li>A Minimum of a Bachelor's degree in Computer Science or equivalent. Advanced degree desirable</li><li>A Minimum of 5 years’ experience in relevant applications, relational database, web and client server technology.</li><li>Technical QlikView expertise, ability to create complex QlikView apps and manage QlikView server environments.</li><li>Excellent knowledge of systems and application design</li><li>Excellent interpersonal communication skills</li><li>The ability to conceptualize and execute appropriate marketing collateral to effectively communicate key differentiators</li><li>Experience in technical selling/marketing to large and diverse user communities. Strong consideration will be given to candidates that have spent some time in a technical customer-facing role.</li><li>Excellent written, presentation, and verbal communications skills; technical writing experience</li><li>Self-starter&nbsp;with the ability to define success metrics and drive self and organization to meet them</li><li>Ability to work as a remote employee as part of a geographically dispersed team</li><li>Results-oriented individual with an enthusiastic, can-do attitude and demonstrated pattern of accountable decision making</li><li>Attention to detail with the ability to prioritize, multi-task, and work within specific timeframes</li><li>Willingness to travel (estimate 20-30% travel)</li></ul><p><strong>Our way of giving back</strong></p><p>To our communities, to the world, and to you is a core part of the culture at Qlik.&nbsp;We encourage our employees to participate in our numerous&nbsp;<a href='https://www.qlik.com/us/company/social-responsibility' rel='nofollow'>Corporate Responsibility Program</a>&nbsp;initiatives.</p><p><strong>Location/Mobility<br><br></strong></p><p>We try to hire the best person for the job, whether they are on-site or virtual. A good cultural fit is the most important attribute for this role. A Qlik virtual workplace enables a team member to employ a self-motivated, disciplined, highly responsive approach in achieving team success.</p>                    </div>                            <h2>                About Qlik            </h2>            <div><p>Qlik® is the leading visual analytics platform and the pioneer of user-driven business intelligence. Its portfolio of cloud-based andon-premise&nbsp;solutions meets customers’ growing needs from reporting and self-service visual analysis to guided, embedded and custom analytics, regardless of where data is located. Customers using&nbsp;Qlik&nbsp;Sense®,&nbsp;QlikView® and&nbsp;Qlik® Cloud, gain meaning out of information from multiple sources, exploring the hidden relationships within data that lead to insights.&nbsp;Qlik&nbsp;does business in more than 100 countries with over 40,000 customers globally. Visit Qlik.com for more information. Visit Qlik.com for more information.</p><p><em>Qlik is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes / CVs submitted by search firms to any employee at Qlik via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Qlik. No fee will be paid in the event the candidate is hired by Qlik as a result of the referral or through other means. By submitting personal data to Qlik for yourself or another, you acknowledge that (i) you have permission from that person to send to Qlik their data (if sending on behalf of another), and (ii) that Qlik may process this personal data.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Amazing colleagues                            </div>                            <div>                                 Swedish Breakfast                            </div>                            <div>                                 Diverse employer                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/embedded",
      "TECH2/database",
      "TECH2/qlikview",
      "TECH2/server",
      "TECH2/web",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "database",
      "embedded",
      "qlikview",
      "server",
      "web"
    ]
  },
  {
    "id": "tb8SaAqoSK-zOgHO69v6EQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16300079",
    "title": "Buzz | Lead Node.JS Engineer | Onsite and REMOTE, INTERNS | Full-time | Mountain View, CA",
    "content": "<div>                  <span>Buzz | Lead Node.JS Engineer | Onsite and REMOTE, INTERNS | Full-time | Mountain View, CA<p>Buzz is a community building tool for B2B companies to showcase their products and reach out to their audience directly.</p><p>Compensation: 90K per year + (%.5 - %1.0) vesting in 4 years. Numbers can vary based on experience and location.</p><p>Apply: info@getbuzz.io</p><p>We are looking for a Lead Node.js engineer.- Proficient with Javascript.- Lead development of backend components in Express JS, Node JS and related technologies.- Manage and lead backend development, undertake planning and approach for a feature.- Strong understanding of databases, normalization, caching. Knex.js and Sequelize experience is a plus. Design ER diagrams.- Experience with database optimizations and NoSQL databases is a plus.- Experience with real-time (e.g. Socket.io) is a plus.- JQuery experience is a plus.- Self-driven, diligent, values own and others' time. Understands importance of shipping.</p><p>Our day to day workflow involves planning, developing new backend features, update and optimize the backend architecture. We start by planning with the User Interface. The UI and its flows allows us to design the database models. We create ER diagrams to see the full picture in data models. Then we design the routes, urls, and define what needs to happen. We then write the logic that drives the feature. We take a holistic approach. We refactor features into sub-apps if needed. We write tests using Mocha and Chai. We measure response times, find bottlenecks and optimize.</p><p>We work remotely, using online tools. Our main office is in Mountain View, CA. We work flexible times, and encourage you to set up the best working environment for yourself.We are a small, tightly knit team who truly cares about this product. We are looking for someone who will be just as excited.</p><p>You have your own space, your time, lots of flexibility, and control. Your contributions will make direct impact on our product.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 12:36:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "-mdm03pgRQ-JFXWhietquw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "y4XxpGV2RICqfW2eFp6I1A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gchuka92paene&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "AOIjSu83SnyZ05-yI9CYMg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "DjQxlK95RWKteYeo0A5TGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "6W8APqotReOsHIMcONhTfQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291549",
    "title": "CareMessage (YC W14) | Remote | https://caremessage.org",
    "content": "<div>                  <span>CareMessage (YC W14) | Remote | <a href='https://caremessage.org' rel='nofollow'>https://caremessage.org</a><p>CareMessage is looking for a Front End Software Engineer to help build the next generation of our web application to streamline care management and deliver interactive mobile programs to improve health outcomes. You will specialize in building responsive and elegant web applications that scale to millions of users in multiple languages.Our engineering team follows agile principles in a test driven development process. We are a remote first team that values open collaboration and shared ownership.</p><p>More info: <a href='https://boards.greenhouse.io/caremessage/jobs/220283' rel='nofollow'>https://boards.greenhouse.io/caremessage/jobs/220283</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 6:02:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "OQOu8aoXSn2CH3reWpqCFg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291244",
    "title": "Signal | Full-Time | SF or REMOTE in US We build the Signal private messaging app. Seeking engineers and designers who ...",
    "content": "<div>                  <span>Signal | Full-Time | SF or REMOTE in US<p>We build the Signal private messaging app.</p><p>Seeking engineers and designers who are passionate about delightful, intuitive and reliable software.</p><p></p><pre><code>  * Service Eng.  * Android Eng.  * Desktop Eng. (Electron &amp; web stack)  * Designer (UX, Graphic Design, etc)</code></pre>At Signal you can:<p></p><pre><code>  * Join a diverse team.  * Put the customer first.  * Build free &amp; open source software.  * Contribute to a fast-growing product.  * Engage with hard problems.  * Take ownership within your discipline.  * Shape the product as a whole.  * Participate in collective decision-making.  * Work remotely.  * Enjoy work-life balance.</code></pre><a href='https://signal.org/' rel='nofollow'>https://signal.org/</a>workwithus@whispersystems.org<p><a href='https://www.keyvalues.com/signal' rel='nofollow'>https://www.keyvalues.com/signal</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 5:31:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "4F_5NcGbQrCMk8r7egW-oA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286925",
    "title": "GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | https://github.com GitHub ...",
    "content": "<div>                  <span>GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | <a href='https://github.com' rel='nofollow'>https://github.com</a><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over 24 million people use GitHub to build amazing things together across 67 million repositories. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href='https://www.keyvalues.com/github' rel='nofollow'>https://www.keyvalues.com/github</a></p><p>Some of our open positions:</p><p>* Elasticsearch Infrastructure Engineer - Remote, US: <a href='https://boards.greenhouse.io/github/jobs/877285#.Wmkka5M-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/877285#.Wmkka5M-dTY</a></p><p>* Engineering Manager, Atom: <a href='https://boards.greenhouse.io/github/jobs/983209#.WmkkbZM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/983209#.WmkkbZM-dTY</a></p><p>* Marketplace Engineering Manager: <a href='https://boards.greenhouse.io/github/jobs/937423#.WmkkcJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/937423#.WmkkcJM-dTY</a></p><p>* Senior Data Analyst - Infrastructure: <a href='https://boards.greenhouse.io/github/jobs/961302#.WmkkcpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/961302#.WmkkcpM-dTY</a></p><p>* Senior Engineer Developer Experience: <a href='https://boards.greenhouse.io/github/jobs/993602#.WmkkcpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/993602#.WmkkcpM-dTY</a></p><p>* Senior Software Engineer - Canada: <a href='https://boards.greenhouse.io/github/jobs/983510#.WmkkdJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/983510#.WmkkdJM-dTY</a></p><p>* Senior Software Engineer - US: <a href='https://boards.greenhouse.io/github/jobs/953424#.WmkkdJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/953424#.WmkkdJM-dTY</a></p><p>* Site Reliability Engineer - Data Center: <a href='https://boards.greenhouse.io/github/jobs/875386#.WmkkdpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/875386#.WmkkdpM-dTY</a></p><p>Tech Stack: GitHub is a Rails 4 application that is composed of a large monolith and a constellation of services written in Ruby, Go, and a handful of other languages.  The app and its services are exposed both internally and externally via a GraphQL API.  We primarily rely on MySQL for persistent storage, Redis for temporary storage, and, as you might expect, a lot of git repositories.  We rely on Kubernetes for container orchestration.</p><p>email kirstenwright@github.com with questions!<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 1:27:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/ruby",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "ruby"
    ]
  },
  {
    "id": "xlWlrGgkQKmXWK0Qv6I7FQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286347",
    "title": "Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE |",
    "content": "<div>                  <span>Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE | <a href='http://8-food.com/' rel='nofollow'>http://8-food.com/</a><p>Early stage Shenzhen-based, Hong Kong registered company with two years of IP seeking talented Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, experience with production in thermoform, injection molding, blow molding, extrusion well regarded. Private office in Shenzhen (Houhai, near HK/Shenzhen Wan border crossing). Physical presence encouraged but not a daily requirement.</p><p>Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.</p><p>Email in profile, please include 'Candidate: Mechanical Engineer' in subject. No recruiters.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:04:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "7ccGMYi4TmayOrc7PhRxbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286127",
    "title": "ACLU -- National HQ, NYC | (remote is fine for eng positions)",
    "content": "<div>                  <span>ACLU -- National HQ, NYC | (remote is fine for eng positions)<p>+ Director of Data — Establish our Data Science &amp; Analytics team, leading building out data-driven strategies for all of the ACLU’s efforts</p><p>+ Fullstack Engineer — Development for advocacy, mobilization, fundraising and education digital products</p><p>+ Product Designer — UX &amp; UI design for new constituent-facing digital products</p><p>+ Data Analyst, Digital — Analyst driving strategy for all of ACLU’s digital efforts (website, online fundraising, email, social, etc)</p><p>+ Salesforce Technical Product Manager — Own, drive, improve the ACLU’s Salesforce roadmap</p><p>+ Salesforce Developer — Lead development on Salesforce</p><p>All jobs listed here: <a href='https://www.aclu.org/careers?office=26' rel='nofollow'>https://www.aclu.org/careers?office=26</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 11:36:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "8SkRsDkWSpKsarJnI_udpA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285356",
    "title": "MailChimp (https://mailchimp.com/about/jobs/) | Atlanta Brooklyn Oakland | Full-Time (FT) & Internships (INTERNS) MailChimp is the world’s leading ...",
    "content": "<div>                  <span>MailChimp (<a href='https://mailchimp.com/about/jobs/' rel='nofollow'>https://mailchimp.com/about/jobs/</a>) | Atlanta Brooklyn Oakland | Full-Time (FT) &amp; Internships (INTERNS)<p>MailChimp is the world’s leading marketing automation platform, and we send more than a billion emails a day. We democratize technology for small businesses, creating innovative products that empower our customers to grow.</p><p>I'm a Python / Go tooling engineer in Operations. I'm remote along with a handful of others. We've recently opened satellite offices in Brooklyn &amp; Oakland.</p><p>There are multiple job listings at <a href='https://mailchimp.com/about/jobs/' rel='nofollow'>https://mailchimp.com/about/jobs/</a> for all available positions / locations. To apply click on the job that best suits you and click on the button in the &quot;Apply Now&quot; box at the bottom of the posting.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:06:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "j4R5IV79SvGPKEw4decGOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284702",
    "title": "HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/",
    "content": "<div>                  <span>HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a><p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Frontend Hypewords: React/Redux for our reference impl. but we use other PWA stacks too - Vue.js/Vuex/Vuetify is next up</p><p>Backend Hypewords: Java/Kotlin, Amazon Aurora, Redis, Spring-Boot, Docker, Swagger, API Gateway</p><p>Systems Hypewords: AWS, Terraform, Ansible, AWS ECS/EKS, RDS, Datadog</p><p>Senior Platform Engineer: <a href='https://healthprize.com/careers-page/#op-205414-senior-platf..' rel='nofollow'>https://healthprize.com/careers-page/#op-205414-senior-platf...</a>.</p><p>Lead Site Reliability Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems...' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:06:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "ikrZ8oZETyOcf-FmGE9ZFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284292",
    "title": "KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time & interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience",
    "content": "<div>                  <span>KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time &amp; interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience<p>KEA is a voice recognition platform that processes and places orders automatically for merchants when customers call in. We seamlessly transforms incoming speech into tickets fed directly into businesses’ POS systems.</p><p>We are looking for Haskell / Python 3 folks for building speech recognition phone systems for businesses. Email us at hello@kea.cloud</p><p>Equity options / market salary / accommodation (if needed)</p><p>More details: <a href='https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqwuHAssq7vk3BJqDhXikY/edit?usp=sharing' rel='nofollow'>https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqw...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 8:25:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "C6aAl1g7QtaYSz4Lj6YTsg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283676",
    "title": "vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE",
    "content": "<div>                  <span>vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE<p>We are building a live streaming product and several functionalities around it. Our backend/streaming team uses several custom and open source media and streaming servers. We are currently hiring people for following open positions.</p><p>1. Backend Engineer (ES6/NodeJS/MongoDB/PostgreSQL) - Experience in NodeJS is necessary and should be able to work with APIs fluently. Also, experience with MongoDB, PostgreSql, Docker, Azure/AWS, Jenkins is required. (Exp 3+ years needed)</p><p>2. Fullstack Engineer (ES6/NodeJS/ReactJS) - Experience in ReactJS is absolutely necessary along with NodeJs, PostgreSql, MongoDB. (Exp 3+ years needed)</p><p>3. Frontend Engineer (ES6/ReactJS/ReactNative) - Experience in ReactJS + Redux and React Native + Redux is absolutely necessary along with other frontend related technologies. (Exp 3+ years needed)</p><p>4. Interns (paid) - We're hiring interns with one goal, to nurture them and employ them full time if they excelled in their internship period. This role has no specific stack attached to it. But we atleast expect that interns should know how to code in JS, HTML/CSS and should have strong computer science fundamentals. Also, this position if selected will require you to work for specific time period. On completion of that time period then full time employment will be considered. Also, expect 50% learning and 50% working. We won't be teaching you entire stuff but guide you on the path. This role is remote as well.</p><p>We offer a competitive salary based on your experience and all other benefits. Salary is no bar for the right candidate.</p><p>To apply, please send your resumes/cv at hnfeb@okverygood.anyalias.com . Do add [HN-FEB] in the title.</p><p>Note: There are multiple positions for each role. Please apply only if you suffice the requirements.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:25:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "kwDMbNh1TluRJcTmXJ6tNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283609",
    "title": "REMOTE (US Residents Only) or ONSITE in Connecticut/Virginia USA",
    "content": "<div>                  <span>REMOTE (US Residents Only) or ONSITE in Connecticut/Virginia USA<p>Emprise is an established nautical software and hardware company based in Ledyard, CT.</p><p>We're looking for several front-end developers with solid javascript/es6+ experience. Our application uses AngularJS (v1), lodash, html5, and scss. You'll also do a small amount of Java for server API endpoints/controllers.</p><p><a href='https://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c' rel='nofollow'>https://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f9...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:17:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "VZI5RMWVSI-xCvGamQ8m4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283525",
    "title": "Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Minneapolis, London, Bucharest, Remote | Fulltime | ONSITE or REMOTE | http://www.crowdstrike.com/ Crowdstrike Stops ...",
    "content": "<div>                  <span>Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Minneapolis, London, Bucharest, Remote | Fulltime | ONSITE or REMOTE | <a href='http://www.crowdstrike.com/' rel='nofollow'>http://www.crowdstrike.com/</a><p>Crowdstrike Stops Breaches.</p><p>We're hiring software and devops engineers to take the lead on automating our software and systems. Give us a shout if you're interested in the following areas, with other information listed at <a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a>.  We've over 25 Engineering positions open right now.</p><p></p><pre><code>  * Cassandra/Elastic/Kafka/Spark/Splunk Scaling and Automation  * Chef/Python/AWS/Docker/Virtualization Scaling and Automation  * Public, Private, Hybrid Cloud and Datacenter Growth at Scale  * Securing systems internally and externally with a focus on automation and visibility</code></pre>I'm hiring 5 positions you can see on the career site:<p></p><pre><code>  * Sr. Virtualization Engineer  * Sr. Network Engineer  * Systems Data Science Engineer  * Data Center Technician (Bay or Sacramento)  * Sr. Systems Engineer (Linux Automation and Optimization)</code></pre>We have a real devops approach - very egalitarian and enabling of engineers. There's tremendous mutual respect and as a result, we get a lot of leading edge stuff done very efficiently.Come join us! See our jobs at <a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a>.<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:10:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "R1lUH8DNTAO985bRp5nRYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283443",
    "title": "ReferWell | node.js contractor - 8-12 weeks | New York, NY / Upstate SC | REMOTE OK (US only), Contract | $50-$60 /hour",
    "content": "<div>                  <span>ReferWell | node.js contractor - 8-12 weeks | New York, NY / Upstate SC | REMOTE OK (US only), Contract | $50-$60 /hour<p>ReferWell ( <a href='https://www.referwell.com/' rel='nofollow'>https://www.referwell.com/</a> ) is delivering better outcomes for patients and better referrals for specialist and primary care doctors in the US.</p><p>Our main office is in Manhattan, and we have a developer presence near Spartanburg, SC, where we intend to set up a dev-focused office later this year.</p><p>The immediate need is for a contractor to assist in building out a hypermedia API for an ongoing partner integration.  The services making up this API run on a stack using docker, mysql, redis, and node.js.  The core need is for someone who is comfortable writing in a modern JS style (async/await, unit and bdt, etc), who avoids slow and unsafe patterns with SQL, and who has some experience with docker, ssh, git, and so forth.</p><p>Familiarity with any of JSON Hypermedia, OAuth2, AWS administration, microservices, Ansible, Consul, or Jenkins is a plus.</p><p>The contract is expected to last 8-12 calendar weeks, though number of hours for each week may vary.  We plan to get started in February, so the decision process should be short.</p><p>As mentioned, we will be setting up a physical office in SC in 2018; for a developer located in the Upstate, this contract could lead into a FT position.</p><p>Please use careers.dev@referwell.com to ask questions or send your details for consideration.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:02:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "v4JupIwYSEalagQhWbvzqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283171",
    "title": "Nexar | https://www.getnexar.com/ | Tel Aviv | REMOTE",
    "content": "<div>                  <span>Nexar | <a href='https://www.getnexar.com/' rel='nofollow'>https://www.getnexar.com/</a> | Tel Aviv | REMOTE<p>Nexar's mission to eliminate car collisions. We use AI, machine vision, sensor fusion, real-time networking and quite a few other buzzwords to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.</p><p>We're growing quickly (<a href='https://blog.getnexar.com/nexar-has-raised-30-million-in-series-b-funding-and-is-expanding-its-exec-team-5e9a59775b4d' rel='nofollow'>https://blog.getnexar.com/nexar-has-raised-30-million-in-ser...</a>) and looking for mobile (mid/senior iOS &amp; Android) engineers and product designers to help meet the challenge and opportunity in front of us.</p><p>We have a few really amazing remote team members and looking to add more anywhere in the world.  The job descriptions below are for our office in Tel Aviv but again we're very excited to add some remote only team members as well:</p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/ios-developer/39.60E' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/ios-developer/39.60E</a></p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/senior-android-developer/1B.603' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/senior-android-devel...</a></p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/product-designer/39.60F' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/product-designer/39....</a></p><p>If you have any questions feel free to contact me amitklein at getnexar dot com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 6:36:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "dotnet"
    ]
  },
  {
    "id": "ekPKfgeVSFKzNOqHO5EoXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5g89oku144k3lk&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "J9HlTE3KRgOR3ZKTFsnH3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gchuka92paene&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "608z82BuRYedJZfZimy_1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "7gGDhSusRQCjQb8uMyFjFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gsus169tlkba1&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "l5xZb6ZkTACsHCsYzJFdKQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/65622/social-media-influencers-at-brocodepodcast/",
    "title": "Social Media Influencers",
    "content": "Hello All,<br /><br /><br />Are you a social media influencer? Do you have entry level digital marketing experience? <br />Can you edit? Take cool pictures? Do you know how to grow a large audience organically?<br /><br /><br />This is the perfect chilled out freelance roll for you. We have a weekly cool podcast that is looking for people with different skills to join the team and yes you will be paid :).<br /><br /><br />We would love to pay for some cool people to join the team with the right weekly commitment.<br /><br /><br />Feel free to drop an email. Ideally London based, however open to committed people who can work remotely too.<br /><br /><br />Camerman<br />Marketers <br />Social influencers<br />Growth Hackers :)<br /><br /><br />Get in touch. Have fun ad get paid!",
    "urlFetchPending": false,
    "published": "Jan 29, 2018 12:45:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Xd5twHdsS_6M_YXsieTy-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/hotjar-hotjar-hero-americas",
    "title": "Hotjar: Hotjar Hero (Americas)",
    "content": "<div>  <div>    <h2>Hotjar Hero (Americas)</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/hotjar-hero-us/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/hotjar-hero-us/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><b>Note:</b> Although this is a remote position, due to the necessary overlap with Europe we are seeking candidates&nbsp;in&nbsp;EST&nbsp;only.<br></div><div>&nbsp;</div><div><br></div><div>The Hotjar Hero team supports thousands of users and customers in over 180 countries by providing world class service, documentation, and training. The Hero team also works closely with our product teams to help prioritize and define changes to Hotjar to continuously improve the overall user experience.</div><div></div><div><br></div><div>We are looking for extremely organized and self driven&nbsp;<strong>Hotjar Heroes</strong>&nbsp;to work in a remote role with a fast growing startup.</div><div><br></div><div>All new Heroes receive extensive technical, product, and marketing training&nbsp;–&nbsp;as well as a yearly budget for additional training and self development. With this knowledge you will help our users set up and use Hotjar features to improve the experience and performance of their sites and apps. This is a great opportunity to develop your career by learning new skills and joining a fast-growing startup.</div><div><br></div><div>&nbsp;</div><div><br></div><div><strong>About You</strong></div><div><br></div><div><strong>Empathy for the win.&nbsp;</strong>Our users come from a wide range of backgrounds and have a wide range of technical abilities. Hotjar Heroes need to be able to put themselves in the users’ shoes to help them resolve any questions while at the same time empowering users with knowledge.</div><div>&nbsp;</div><div><br></div><div><strong>Detail is key.&nbsp;</strong>Troubleshooting an issue isn’t always straightforward. Since our tool can get pretty technical, obsessing over details really helps. If you can’t solve it, that’s ok - just provide enough details to help the engineers as they investigate further.</div><div>&nbsp;</div><div><br></div><div><strong>Independent mindset.&nbsp;</strong>As a remote team, autonomy and self-motivation is necessary. One of our core values is Honesty. We don’t use apps to measure whether or not you're working, we simply trust you. Are you up to the challenge?</div><div>&nbsp;</div><div><br></div><div><strong>Learning is growing.&nbsp;</strong>Hotjar is always adding new capabilities and improving the way our tool works. This means Hotjar Heroes are always learning. Plus, it doesn’t stop there - everyone at Hotjar aims to learn 1% each day (machine learning, anyone?).</div><div>&nbsp;</div><div><br></div><div><strong>Go Team!</strong>&nbsp;Though we are spread across the world, our team is always in contact. We hold daily scrums, weekly planning, and company wide demos. We need to be prepared to step up if a team member is out. Or share a new idea we have for how to make the team or the company better. Being a team player is vital to the role of Hero.</div><div><br></div><div>&nbsp;</div><div><br></div><div><strong>What Hotjar Heroes do...</strong></div><div><br></div><ul><li>Creating 'WOW' moments by consistently delivering world-class support with empathy and understanding</li><li>Promptly interacting with users who contact us via our support channels</li><li>Accurately identifying, analyzing, and resolving technical and non-technical issues in a timely manner.</li><li>Updating the pipeline of user suggestions and feedback to improve Hotjar.</li><li>Escalating more complex problems to appropriate internal resources.</li><li>Writing (and updating) documentation for internal and external knowledge bases.</li><li>Occasionally providing demonstrations or webinars to users.</li><li>Working with Lead Heroes on gathering data from user communications on user needs and pain points.</li></ul><div>&nbsp;</div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is $44,000 to $60,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.</div><div><br></div><div><h4><b>Requirements</b></h4></div><div>Must have:</div><div><br></div><ul><li>Very strong English communication skills – both written and spoken. If you are fluent in other languages, tell us! German, French, Spanish and Japanese will be considered as assets.</li><li>Familiarity with the basics of HTML, CSS, Javascript, and using browser developer tools.</li><li>Ability to effectively communicate complex concepts that empowers our users without making them feel small.</li><li>Be able to work independently - accountable for your own actions and able to act with both urgency and integrity.</li><li>Experience working in technical support roles and teams, Agile experience a plus.</li><li>Desire and drive to always be learning.</li><li>Ability to work independently and within a team towards both personal and shared work goals.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul><div>&nbsp;</div><div><br></div><div>Nice to have:</div><div><br></div><ul><li>Proficiency with HTML, Javascript, and debugging using the browser developer tools</li><li>Experience in codifying and maintaining customer process documentations &nbsp;</li><li>Experience working with CRO, Marketing, or Design Agencies</li><li>Experience working remotely</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/hotjar-hero-us/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/hotjar-hero-us/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 3:39:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "pPlv5h0JTZuUVNtKNON10g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/epsilon-records-llc-music-producer-techno-deep-house",
    "title": "Epsilon Records LLC: Music Producer (Techno, Deep House)",
    "content": "<div>  <div>    <h2>Music Producer (Techno, Deep House)</h2>      <h4>Posted Jan 12</h4>    <h3>      <span>Epsilon Records LLC</span><br>      <span>Headquarters: Amsterdam, Netherlands</span><br>        <a href='http://epsilonrecords.com' rel='nofollow'>http://epsilonrecords.com</a>    </h3>  </div>    </div>  <div>    <div>Seeking talented music producers (Techno, Deep House) for publishing and distribution record-deals. Currently looking to sign 10 new artists. Up to $500 signing bonus upon distribution of your first 4 track EP. This position is 100% remote and we use Slack to collaborate.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your music here for consideration: <a href='https://epsilonrecords.droptrack.com/demo/' rel='nofollow'>https://epsilonrecords.droptrack.com/demo/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 11, 2018 4:15:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "gDVmRi_VQlK7WJdI55rKnQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/the-briellard-group/jobs/125766-investigative-journalist",
    "title": "Investigative Journalist",
    "content": "<div><h2>Investigative Journalist at The Briellard Group</h2><div>San Francisco, Atlanta, New York City, Remote · Full Time</div></div><div><div>Skills</div><div>Sales, Journalism, Sales and Marketing</div><div>Compensation</div><div>$40K–$100K<br>0.5%–5.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>InHerSoul &amp; InHisSoul Magazines are looking for international and US based journalists who have some investigative journalism experience and/or interest. Must have experience in sales, networking and excellent eye for a story. </p><p>Duties</p><p>Locate story leads as well as scout out various story leads that is applicable to the magazine (both print and digital)</p><p>Submit daily posts to online magazine blog (current events, etc)</p><p>Act as a media correspondent on screen and on air for various star studded events. </p><p>Any other duties as needed</p></div>",
    "urlFetchPending": false,
    "published": "Jan 6, 2018 9:53:08 PM",
    "tags": [
      "Atlanta",
      "Content Creator",
      "Customer Service",
      "Full Time",
      "Journalism",
      "New York City",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "San Francisco",
      "TECH1/frontend",
      "TECH1/mobile",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "mobile"
    ]
  },
  {
    "id": "L4SAaGteSu6UAwavaoFOug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16064036",
    "title": "SchoolKeep | A Few months in Parsippany, NJ then Remote | FULLTIME SDR | $60,000 - $80,000 + 4 weeks paid vacation",
    "content": "<div>                  <span>SchoolKeep | A Few months in Parsippany, NJ then Remote | FULLTIME SDR | $60,000 - $80,000 + 4 weeks paid vacation<p><a href='https://www.indeed.com/job/sales-development-representative-612c77e994947eed' rel='nofollow'>https://www.indeed.com/job/sales-development-representative-...</a></p><p>We’re looking for high-energy professionals with sound business acumen, natural sales instincts, and a passion for B2B software. Your mission as a Sales Development Representative (SDR) is to generate leads by through outbound and inbound sales techniques. Ideal candidates are recent college graduates that are tenacious, self-starting, and have a desire to get a start in high-tech sales.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 9:14:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "n_TTqOhpR2S2ehQK7uVhVQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16058693",
    "title": "Sift | Detroit, MI | Fulltime | ONSITE | https://www.justsift.com",
    "content": "<div>                  <span>Sift | Detroit, MI | Fulltime | ONSITE | <a href='https://www.justsift.com' rel='nofollow'>https://www.justsift.com</a><p>At Sift, we build applications to help organizations better understand their people. We want organizations to feel more like closely knit teams, where everyone supports each other to achieve their shared mission.</p><p>We’re just around 2 years old, but we’ve already secured 15,000+ users and over 20 clients. We’re proud to have Quicken Loans using our apps to better understand who makes up their amazing team.</p><p>- Mid/Senior Backend (Node.js, Express - DevOps (AWS, Azure, moving to containers) (REMOTE possible)</p><p>- Mid/Senior Frontend (React, React Native) (REMOTE possible)</p><p>Shoot me an email if you have any questions or apply through our jobs site, <a href='https://www.justsift.com/jobs/' rel='nofollow'>https://www.justsift.com/jobs/</a></p><p>Mat P, CTO, matp@justsift.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 8:00:06 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "xD1e8x8RR9WNZVm-6Ki98w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057774",
    "title": "https://jobsortio.herokuapp.com takes all the submissions, sorts by technology, and filters by location There is logic to minimize false ...",
    "content": "<div>                  <span><a href='https://jobsortio.herokuapp.com' rel='nofollow'>https://jobsortio.herokuapp.com</a> takes all the submissions, sorts by technology, and filters by location<p>There is logic to minimize false positives/negatives. For example, it does a pretty good job distinguishing between (c, c++, obj-c), (java, javascript), and (react, react native).</p><p>If you type &quot;remote&quot; in the location textbox, it will only show submissions that are available remotely. Open to implementing other features.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 5:00:06 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "c",
      "frontend"
    ]
  },
  {
    "id": "6ubHeCoQTLKWxwIvnEtWhA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16056215",
    "title": "Immunant | Irvine, CA | ONSITE | REMOTE (US-only) | www.immunant.com/page/jobs",
    "content": "<div>                  <span>Immunant | Irvine, CA | ONSITE | REMOTE (US-only) | www.immunant.com/page/jobs<p>Immunant is building systems security tools that prevent vulnerability exploits.</p><p>We are looking to fill the following full-time roles:</p><p>1) Compiler, linker, and loader expert. Deep knowledge of C/C++, and ELF as well as x86, and ARM/AArch64 machine code expected. Previous experience with compiler and linker development preferred.</p><p>2) Rust aficionado for language migration project. Familiarity with all things Rust expected. Maybe you've contributed to Rust already? Experience with language parsing, refactoring, analysis, and/or rewriting preferred.</p><p>Apply here: www.immunant.com/page/jobs<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 12:07:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "c",
      "other"
    ]
  },
  {
    "id": "NxIGJA6QQPSIXkKxseNxng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16055735",
    "title": "HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/ | $110k-160k + equity At HealthPrize, we are changing the ...",
    "content": "<div>                  <span>HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a> | $110k-160k + equity<p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Frontend Hypewords: React/Redux, Vue.js/Vuex/Vuetify, Webpack</p><p>Systems Hypewords: AWS (multi-region deployments), Terraform, ECS, Docker, Aurora, HIPAA/PCI Compliance</p><p>Front End Web Developer: <a href='https://healthprize.com/careers-page/#op-206457-front-end-we...' rel='nofollow'>https://healthprize.com/careers-page/#op-206457-front-end-we...</a>.</p><p>Lead Site Reliability Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems.' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 11:19:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "mbJTMXhVT3i0AVYjQGBAFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16055370",
    "title": "vVents | Backend, FullStack, Frontend developers, Interns (paid) | Anywhere | Full Time | REMOTE",
    "content": "<div>                  <span>vVents | Backend, FullStack, Frontend developers, Interns (paid) | Anywhere | Full Time | REMOTE<p>We are building a live streaming product and several functionalities around it. Our backend/streaming team uses several custom and open source media and streaming servers. We are currently hiring people for following open positions. People from timezone GMT +1 to GMT +7:30 will be preferred.</p><p>1. Backend Engineer (ES6/NodeJS/MongoDB/PostgreSQL) - Experience in NodeJS is necessary and should be able to work with APIs fluently. Also, experience with MongoDB, PostgreSql, Docker, Azure/AWS, Jenkins is required. (Exp 3+ years needed)</p><p>2. Fullstack Engineer (ES6/NodeJS/ReactJS) - Experience in ReactJS is absolutely necessary along with NodeJs, PostgreSql, MongoDB. (Exp 3+ years needed)</p><p>3. Frontend Engineer (ES6/ReactJS/ReactNative) - Experience in ReactJS + Redux and React Native + Redux is absolutely necessary along with other frontend related technologies. (Exp 3+ years needed)</p><p>4. Interns - We're hiring interns with one goal, to nurture them and employ them full time if they excelled in their internship period. This role has no specific stack attached to it. But we atleast expect that interns should know how to code in JS, HTML/CSS and should have strong computer science fundamentals. Also, this position if selected will require you to work for specific time period. On completion of that time period then full time employment will be considered. Also, expect 50% learning and 50% working. We won't be teaching you entire stuff but guide you on the path. This role is remote as well.</p><p>We offer a competitive salary based on your experience and all other benefits. Salary is no bar for the right candidate.</p><p>To apply, please send your resumes/cv at hnjan@okverygood.anyalias.com . Do add [HN-JAN] in the title.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 10:38:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "n54OeH8vT46w6yzlotvSXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16055318",
    "title": "KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time & interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience",
    "content": "<div>                  <span>KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time &amp; interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience<p>KEA is a voice recognition platform that processes and places orders automatically for merchants when customers call in. We seamlessly transforms incoming speech into tickets fed directly into businesses’ POS systems.</p><p>We are looking for Haskell / Python 3 folks for building speech recognition phone systems for businesses. Email us at hello@kea.cloud</p><p>Equity options / market salary / accommodation (if needed)</p><p>More details: <a href='https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqwuHAssq7vk3BJqDhXikY/mobilebasic#heading=h.rod8k8qow398' rel='nofollow'>https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqw...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 10:33:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "a0OLdGTmQxiEMBc6X744fQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16054356",
    "title": "Signal | Full-Time | SF or REMOTE in US We build the Signal private messaging app. Seeking engineers and designers who ...",
    "content": "<div>                  <span>Signal | Full-Time | SF or REMOTE in US<p>We build the Signal private messaging app.</p><p>Seeking engineers and designers who are passionate about delightful, intuitive and reliable software.</p><p></p><pre><code>  * Service Eng.  * Android Eng.  * Desktop Eng. (Electron &amp; web stack)  * Designer (UX, Graphic Design, etc)</code></pre>At Signal you can:<p></p><pre><code>  * Join a diverse team.  * Put the customer first.  * Build free &amp; open source software.  * Contribute to a fast-growing product.  * Engage with hard problems.  * Take ownership within your discipline.  * Shape the product as a whole.  * Participate in collective decision-making.  * Work remotely.  * Enjoy work-life balance.  https://signal.org/  workwithus@whispersystems.org  https://www.keyvalues.com/signal</code></pre><span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 9:00:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "DmN0cadsRzScPovEGXm_DQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16054172",
    "title": "Wiredcraft | Berlin, Chengdu, Shanghai, Shenzhen, Wuhan | Remote, Visa, Full-time or Intern | https://wiredcraft.com We help the largest ...",
    "content": "<div>                  <span>Wiredcraft | Berlin, Chengdu, Shanghai, Shenzhen, Wuhan | Remote, Visa, Full-time or Intern | <a href='https://wiredcraft.com' rel='nofollow'>https://wiredcraft.com</a><p>We help the largest organizations in the world create and grow digital products for tens of millions of users. We've built the software running the elections of Myanmar, maintain the mobile apps for Starbucks in China and maintain a payment solution for the Chinese market.</p><p>We keep our tech chops sharp (Node.js, React, Python, Golang, Ansible, Docker...) and contribute heavily to Open Source.</p><p>We value transparency, self-improvement and getting things done (and write about it all on our playbook [1]).</p><p>We're growing fast and recruiting across the board [2], in particular:</p><p>- Javascript Front-end Developers (<a href='https://wiredcraft.com/jobs/front-end-developer/' rel='nofollow'>https://wiredcraft.com/jobs/front-end-developer/</a>)</p><p>- Backend Developers (<a href='https://wiredcraft.com/jobs/backend-developer/' rel='nofollow'>https://wiredcraft.com/jobs/backend-developer/</a>)</p><p>- iOS &amp; Android Developers (<a href='https://wiredcraft.com/jobs/android-ios-developer/' rel='nofollow'>https://wiredcraft.com/jobs/android-ios-developer/</a>)</p><p>- DevOps (<a href='https://wiredcraft.com/jobs/devops/' rel='nofollow'>https://wiredcraft.com/jobs/devops/</a>)</p><p>1: <a href='http://playbook.wiredcraft.com/article/culture/' rel='nofollow'>http://playbook.wiredcraft.com/article/culture/</a></p><p>2: <a href='https://wiredcraft.com/jobs/' rel='nofollow'>https://wiredcraft.com/jobs/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 8:45:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "dSmkYnwHR7KumPp9TBBSSA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16053345",
    "title": "Open Collective | https://opencollective.com | New York City | REMOTE",
    "content": "<div>                  <span>Open Collective | <a href='https://opencollective.com' rel='nofollow'>https://opencollective.com</a> | New York City | REMOTE<p>Open Collective allows communities (like Open Source projects, meetups, etc) to raise and spend money transparently. You can charge membership fees, get donations from individuals or companies and spend it by filing expenses. The entire financial ledger is publicly viewable to ensure transparency. Some examples: <a href='https://opencollective.com/webpack' rel='nofollow'>https://opencollective.com/webpack</a>, <a href='https://opencollective.com/babel' rel='nofollow'>https://opencollective.com/babel</a>, and many more <a href='https://opencollective.com/opensource' rel='nofollow'>https://opencollective.com/opensource</a>.</p><p>We are a founding team of 3 (two engineers) and are looking to hire our first full-time engineer (<a href='https://medium.com/open-collective/open-collective-is-hiring-its-first-developer-550fa38fd2dd' rel='nofollow'>https://medium.com/open-collective/open-collective-is-hiring...</a>).</p><p>Send me a note at aseem@opencollective.com with your GitHub, LinkedIn, resume, etc.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 7:20:04 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "kVDwqs86QtW43wmRYFQJmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16052876",
    "title": "Sauce Labs | Berlin | Backend developer | Full Time We need more folks to help us build and improve our ...",
    "content": "<div>                  <span>Sauce Labs | Berlin | Backend developer | Full Time<p>We need more folks to help us build and improve our world-class cloud-based iOS and Android testing platform. Customers love us because we support a very wide range of devices with a variety of testing frameworks and we do it well.</p><p>That said, we have some challenges. Here's some:</p><p>* Adding support for new iOS and Android versions as soon as possible after launch</p><p>* Digging into low-level OS code to do things like remote control them, and doing this reliably across all devices</p><p>* Handling seamless deployments despite having state in the form of physical devices that we can't just abstract away</p><p>* Scaling to meet the demands of some very big customers</p><p>If you've got more questions about work here please let me know! I've worked for Sauce Labs on the real device team here in Berlin for over two years now and love it. Our stack is mostly Java/Docker/Angular with a bit of Python, haproxy, and soon React - you'll get your hands dirty in all sorts of tech all through the pipeline.</p><p>Here's the link to the Java backend position, roughly the same as my own position here: <a href='http://grnh.se/f8enm41' rel='nofollow'>http://grnh.se/f8enm41</a></p><p>If you're in SF, Vancouver, Poland (or even remote for the right person) we have a bunch more openings for web developers, customer success, product managers, and more: <a href='http://grnh.se/ex5dth1' rel='nofollow'>http://grnh.se/ex5dth1</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 6:30:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "3lVHltkzQzC9of6Bom3ndw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64588/bilingual-japanese-software-consultant-tokyo-japan-at-mongoose-gray/",
    "title": "Bilingual (Japanese) Software Consultant | Tokyo, Japan",
    "content": "*INTRODUCTION*<br /><br />Hello. We are a well-established, high-growth, investor-backed consulting firm. Very much boutique, with an almost startup-like approach and feel, we have big company ambitions. And a track record to prove it.<br /><br />*OUR CULTURE?*<br /><br />Tech-savvy, innovative, entrepreneurial, collaborative. Our consultants are fiercely loyal and this is borne out by a very low attrition rate.<br /><br />*WHAT DOES A TYPICAL DAY LOOK LIKE?*<br /><br />* Imagine owning the proof of concept, design, architecture, development and delivery of client solutions.<br />* Imagine engaging with developers, business analysts, change professionals, project managers and other stakeholders.<br />* Imagine being the face of the firm, showcasing solutions, outlining benefits, identifying future business opportunities.<br />* Imagine using your business acumen to ensure technical implementations are fit for purpose.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, adaptable and able to travel extensively throughout APAC and at times, globally, to client sites. The role will bring lots of autonomy and flexibility including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, advisor. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment but now operate in a more strategic, consultative, client-facing role which might encompass disciplines such as solution architecture, business analysis, project management and the like.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a firm that has world-class ambitions. In many ways progression will be exactly what you make it.<br /><br />*WHAT TECHNICAL SKILLS WILL I NEED?*<br /><br />* Programming background in .NET, Java, C# or similar.<br />* An understanding of object-orientated, structured development methodologies.<br /><br />*WHAT BUSINESS KNOWLEDGE WILL I NEED?*<br /><br />* Good understanding of project management, software development life cycles, structured programming methods and controls.<br />* An affinity for consulting, business analysis, change management, process re-engineering, business transformation.<br />* Prior experience of designing and implementing documented, supportable and extensive developments for clients.<br />* Able to solve business and technical challenges by using innovative and well-planned approaches.<br /><br />*SOFT SKILLS?*<br /><br />* Highly personable, engaging, client-facing, confident, credible, articulate, consultative, affable, charismatic.<br />* Gravitas and credibility to face off to senior business stakeholders, able to instil confidence.<br />* Sixth sense for identifying, troubleshooting and remediating issues, both business and technical.<br />* Sound commercial nous coupled with excellent stakeholder management skills and a strong technical background.<br />* Able to tailor a message to the audience, combined with exceptional presentation skills.<br />* International outlook and exposure, you will most likely have worked abroad at some point.<br />* Bilingual Japanese/English skills are essential.<br /><br />*THE NUMBERS?*<br /><br />JPY 12,000,000 + excellent benefits + share options.<br /><br />*INTERESTED?*<br /><br />Please apply including a copy of your CV and cover letter (yes we're a bit old school like that). We look forward to hearing from you.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:31:13 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "9eyQg1EyRTihsgxLpd0RKQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64588/technical-consultant-fluent-in-english-japanese-and-net-tokyo-japan-at-mongoose-gray/",
    "title": "Technical Consultant fluent in English, Japanese and .NET? | Tokyo, Japan.",
    "content": "*INTRODUCTION*<br /><br />Hello. We are a well-established, high-growth, investor-backed consulting firm. Very much boutique, with an almost startup-like approach and feel, we have big company ambitions. And a track record to prove it.<br /><br />*OUR CULTURE?*<br /><br />Tech-savvy, innovative, entrepreneurial, collaborative. Our consultants are fiercely loyal and this is borne out by a very low attrition rate.<br /><br />*WHAT DOES A TYPICAL DAY LOOK LIKE?*<br /><br />* Imagine owning the proof of concept, design, architecture, development and delivery of client solutions.<br />* Imagine engaging with developers, business analysts, change professionals, project managers and other stakeholders.<br />* Imagine being the face of the firm, showcasing solutions, outlining benefits, identifying future business opportunities.<br />* Imagine using your business acumen to ensure technical implementations are fit for purpose.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, adaptable and able to travel extensively throughout APAC and at times, globally, to client sites. The role will bring lots of autonomy and flexibility including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, advisor. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment but now operate in a more strategic, consultative, client-facing role which might encompass disciplines such as solution architecture, business analysis, project management and the like.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a firm that has world-class ambitions. In many ways progression will be exactly what you make it.<br /><br />*WHAT TECHNICAL SKILLS WILL I NEED?*<br /><br />* Programming background in .NET, Java, C# or similar.<br />* An understanding of object-orientated, structured development methodologies.<br /><br />*WHAT BUSINESS KNOWLEDGE WILL I NEED?*<br /><br />* Good understanding of project management, software development life cycles, structured programming methods and controls.<br />* An affinity for consulting, business analysis, change management, process re-engineering, business transformation.<br />* Prior experience of designing and implementing documented, supportable and extensive developments for clients.<br />* Able to solve business and technical challenges by using innovative and well-planned approaches.<br /><br />*SOFT SKILLS?*<br /><br />* Highly personable, engaging, client-facing, confident, credible, articulate, consultative, affable, charismatic.<br />* Gravitas and credibility to face off to senior business stakeholders, able to instil confidence.<br />* Sixth sense for identifying, troubleshooting and remediating issues, both business and technical.<br />* Sound commercial nous coupled with excellent stakeholder management skills and a strong technical background.<br />* Able to tailor a message to the audience, combined with exceptional presentation skills.<br />* International outlook and exposure, you will most likely have worked abroad at some point.<br />* Bilingual Japanese/English skills are essential.<br /><br />*THE NUMBERS?*<br /><br />JPY 12,000,000 + excellent benefits + share options.<br /><br />*INTERESTED?*<br /><br />Please apply including a copy of your CV and cover letter (yes we're a bit old school like that). We look forward to hearing from you.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:31:13 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "m6Us0ZfdQGSRMkQATEuF2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Senior+Ui+Ux+Consultant&c=Accolite&l=Remote&jk=5dd6457e3b5a30c6&rtk=1c1nu5qm35mghen3&from=rss",
    "title": "Senior UI/UX Consultant - Accolite Inc - Remote",
    "content": "<div><b>Senior UI/UX Consultant</b><br><span>Accolite Inc</span>     -<span>Remote</span>    <div>        <span>Contract</span>        </div></div><span><p><b>Job Summary</b></p><p><b>Role: Senior UI/UX Consultant (10+ Years Exp)</b></p><p><b>Location: Remote (20% Travel required all over USA)</b></p><p><b>Duration: Long Term Contract</b></p><p><b>Required Skills: </b></p><ul><li>Impeccable customer communication skills; consulting background preferred</li></ul><ul><li><b>Solid background creating web applications and web sites including consuming Restful APIs</b> *</li></ul><p>*</p><ul><li><b>Strong JavaScript/JQuery experience, bonus points for Node, Angular or other similar JavaScript frameworks.</b> *</li></ul><p>*</p><ul><li>Self-motivated; you don't require supervision and can set your own priorities</li></ul><ul><li>Server-side Java experience or similar technologies (PHP, ASP) a plus</li></ul><ul><li>Experience with closure templates like Soy or Free marker is preferred</li></ul><ul><li>Detailed understanding of the latest web design trends, technologies, techniques, and patterns</li></ul><ul><li>Ability to work well in a fast-paced environment and thrive on creative problem-solving</li><li>Equally passionate about user experience and interface design</li></ul><ul><li>Yoda-like knowledge of CSS and HTML and ability to hand-code your way out of the nastiest problems</li></ul><p><b>Portfolio Required: </b></p><p>Job Type: Contract</p><p>Required experience:</p><ul><li>HTML: 5 years</li><li>UI: 10 years</li><li>CSS: 5 years</li><li>UX: 10 years</li></ul><p>Required travel:</p><ul><li>25%</li></ul></span>",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 5:20:23 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "jUbEp-n8TuG6p7iQroBY_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8548-online-english-teacher-part-time-tutor-remote",
    "title": "Online English Teacher, Part time Tutor, Remote",
    "content": "Online English Teacher, Part time Tutor, Remote - Jobmote<div><div><h2>Online English Teacher, Part time Tutor, Remote</h2><h5>Qkids</h5></div></div><div><div><div><div><div><p><strong>ABOUT QKIDS:</strong> Qkids is a unique, interactive online English program. We connect English teachers to Chinese students with fun, user-friendly software.&nbsp;Qkids is ready to build lasting growth for both students and teachers.&nbsp;With your&nbsp;help, we can continue to impact cross-cultural communication positively. Join today, and let's shape the future of E-Learning together! </p><p><strong>Teacher testimonial video</strong> :&nbsp;<a href='https://www.youtube.com/watch?v=Zs9_Z0XSJ00' rel='nofollow'>https://www.youtube.com/watch?v=Zs9_Z0XSJ00</a> </p><p><strong>CONNECT ON</strong> </p><p>Facebook&nbsp;: <a href='https://www.facebook.com/JoinQkids/' rel='nofollow'>https://www.facebook.com/JoinQkids/</a>&nbsp; </p><p>Glassdoor&nbsp;: <a href='https://www.glassdoor.com/Reviews/QKids-Reviews-E1339997.htm' rel='nofollow'>https://www.glassdoor.com/Reviews/QKids-Reviews-E1339997.htm</a></p><p><strong>About the Job:</strong> </p><p>Employment type: Contract, part-time </p><p>Start date: ASAP </p><p>Location: Remote </p><p>Hours: 6-19 hours/week </p><p>Rate: $16-20 USD/hr </p><p>&nbsp;</p><p><strong>R</strong>** ESPONSIBILITIES:** Teach English to Chinese children between 5 - 12 years of age through Qkids’ interactive software program. Knowledge of Chinese is not necessary. Each class is 30 minutes. All curricula are preset and incorporated with animated characters and games. There is paid training before orientation. Further training and support is provided along with your coursework. &nbsp; </p><p><strong>R</strong>** EQUIREMENTS:** </p><ol><li><p>Available to teach a minimum of 6 hours (12 classes) per week from the following timeslots. There are 19 hours (38 classes) available weekly: every day: 05:40 - 06:10, 06:20 - 06:50, 07:00 - 07:30, 07:40 - 08:10, plus additional Friday and Saturday timeslots: 19:40 - 20:10, 20:20 - 20:50, 21:00 - 21:30, 21:40 - 22:10, 22:20 - 22:50. All as in <strong>EST</strong>. </p></li><li><p>Native fluency English speakers who are based in United States, Canada. This is due to the limitation of our internet server and we do not discriminate against nationality. </p></li><li><p>Earned a degree or currently enrolled in a university program. </p></li><li><p>Prior teaching experience&nbsp;or experience with early childhood education.&nbsp; </p></li></ol><p><strong>Hiring process: Application - invite to pre-demo - demo(paid) - trial classes (paid) - Hired!</strong> </p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 16, 2017 12:00:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/unknown",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "1cphpDDRQjGou7tdBUURug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Instructor&c=Rasmussen+College&l=Remote&jk=ee31ac775e40d313&rtk=1c1nu5qm35mghen3&from=rss",
    "title": "Full Time Instructor - Data Science Master's Program - Rasmussen College - Remote",
    "content": "<div><b>Full Time Instructor - Data Science Master's Program</b><br><span>Rasmussen College</span>     -<span>Remote</span>    </div><span>This role reports the Academic Dean.<br><br><b>Teaching Workload:</b><br><br>Full-time Instructors are assigned 5 work units per academic quarter as follows:<br><ul><li>3.75 work units for instruction</li><li>1.25 work units for scholarly work</li></ul><b>Required Qualifications:</b><br><ul><li>A doctoral degree in Business Intelligence, Data Analytics, Data Mining, Data Science, Big Data, or other data-driven technology. If doctoral degree is not in one of the areas listed above, a doctoral degree in Computer Science with a specialty in one ofthe listed areas or a doctoral degree in Computer Science two years field experience is required.</li><li>A minimum of three years of teaching experience at the graduate level is required.</li><li>A successful candidate should have expertise or experience in the majority of the following technologies: OLAP, OLAP for Data Mining, SQL, SAS, JAVA, R, Python, C++, Java, SQL, NoSQL, SQL Server, SAS, ETL, and Data Transformation Tools.</li><li>Additional consideration will be given to candidates who possess any of the following current certifications: Certified Business Analysis Professional (CBAP), SQL Certification, SAS Certification, and/or Tableau Certification.</li></ul><b>About Us:</b><br><br>Rasmussen College is a regionally accredited private college that is dedicated to changing lives and the communities it serves through high-demand and flexible educational programs. Since 1900, the College has been committed to academic innovation and providingthe highest standard of education while empowering students to pursue a college degree. Rasmussen College offers certificate and diploma programs through associate’s, bachelor’s and master’s degree programs online and across its 22 Midwest and Florida campuses.A pioneer in online education, the College is helping lead advancements in innovations such as competency-based education and comprehensive student support services that help working adults advance their careers. The College is also committed to providinga positive impact on society through public service and a variety of community-based initiatives. For more information about Rasmussen College, please visit rasmussen.edu .<br><br><b>At Rasmussen, we are proud to be an equal opportunity employer. We are committed supporting and encouraging diversity in the workplace. We welcome our employee’s differences regardless of race, color, creed, religion, gender, national origin, sexualorientation, marital status, age, gender identity, disability or veteran status.</b></span>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 5:12:58 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "wJogsOf6SNa-doooffy9XA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/planetary-emissions-management/jobs/39716-ecological-experimentalist",
    "title": "Ecological Experimentalist",
    "content": "<div><h2>Ecological Experimentalist at Planetary Emissions Management</h2><div>Cambridge, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Eddy Covariance, Sensors, Co2 Measurement, Soil Accumulation Chambers, Co2 Exsolvation, Aqueous Co2 Measurement, Isotopic Ecology</div><div>Compensation</div><div>$90K–$100K<br>0.5%–0.8%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>A skilled field ecologist with extensive sensor deployment and operation skills is sought for full time employment. Intimate knowledge of eddy covariance techniques and linked measurements of soil efflux and aqueous CO2 analysis is desired. Advanced knowledge of data handling and data analysis to support high performance continuous sensor operation is required. </p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 10:32:08 PM",
    "tags": [
      "Aqueous Co2 Measurement",
      "Cambridge",
      "Co2 Exsolvation",
      "Co2 Measurement",
      "Eddy Covariance",
      "Full Time",
      "Isotopic Ecology",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sensors",
      "Soil Accumulation Chambers",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "yFCi92xYQ6KfYkK6iDUh0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/planetary-emissions-management/jobs/14717-eddy-covariance-co2-instrumentation-techncian",
    "title": "Eddy Covariance CO2 Instrumentation Techncian",
    "content": "<div><h2>Eddy Covariance CO2 Instrumentation Techncian at Planetary Emissions Management</h2><div>Cambridge, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Big Data, CO2 LASER Technician, Licor, Eddy Covariance, Stable Isotopes, Radiocarbon</div><div>Compensation</div><div>$90K–$100K<br>0.25%–0.25%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 6:14:23 AM",
    "tags": [
      "Big Data",
      "CO2 LASER Technician",
      "Cambridge",
      "Eddy Covariance",
      "Full Time",
      "Hardware Engineer",
      "Licor",
      "REMOTE1/100",
      "Radiocarbon",
      "Remote OK",
      "Stable Isotopes",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "_BhKoqieTBSS2f-UHsIkng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/planetary-emissions-management/jobs/39714-theoretical-ecologist",
    "title": "Theoretical Ecologist",
    "content": "<div><h2>Theoretical Ecologist at Planetary Emissions Management</h2><div>Cambridge, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Data Analysis, Mathematical Modeling, Overseeing Field Operations, Sensor Design</div><div>Compensation</div><div>$80K–$90K<br>0.1%–0.4%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Seeking an innovative theoretical ecologist to work in the area of forest carbon cycling and sequestration in the context of carbon trading. Knowledge of economics and geochemistry with skills in diverse model and data analysis methods is desired. Sensor design and data collection in the field will also be required. </p><p> </p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 6:14:23 AM",
    "tags": [
      "Cambridge",
      "Data Analysis",
      "Full Time",
      "Mathematical Modeling",
      "Operations",
      "Overseeing Field Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sensor Design",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "XJD291LcT7WKtp4JL_WJCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/bookwithbit/jobs/57051-co-founder",
    "title": "Co-Founder",
    "content": "<div><h2>Co-Founder at bookwithbit</h2><div>Fort Smith, Remote · Cofounder</div><div></div></div><div><div>Skills</div><div>Django, Android, iOS Development, AWS/EC2/ELB/S3/DynamoDB, Amazon AWS EC2 API, Ethereum, Blockchain</div><div>Compensation</div><div>No Salary<br>10.0%–15.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Person skill with blockchain and Python . it is remote position person can work form wherever they are.  it is complete sweat equity offer.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 12:18:50 AM",
    "tags": [
      "AWS/EC2/ELB/S3/DynamoDB",
      "Amazon AWS EC2 API",
      "Android",
      "Blockchain",
      "Cofounder",
      "Django",
      "Ethereum",
      "Fort Smith",
      "Full-Stack Developer",
      "REMOTE1/50",
      "Remote OK",
      "TECH1/python",
      "TITLE1/unknown",
      "TZ/unknown",
      "iOS Development"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "wwshYjNfRAy9IgVsVI3j5w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/liven/jobs/130807-corporate-partnerships-contractor",
    "title": "Corporate Partnerships (Contractor)",
    "content": "<div><h2>Corporate Partnerships (Contractor) at Liven</h2><div>Melbourne, Remote · Full Time</div></div><div><div>Skills</div><div>Sales Strategy and Management, Sales and Marketing, Sales/Marketing and Strategic Partnerships</div><div>Compensation</div><div>$40K–$50K<br>No Equity</div></div><h3>Job Description</h3><div><p>Liven is an exciting new company which has been growing rapidly since launching 18 months ago. We believe in getting more from life and our mission is to help Australians enjoy new experiences while being socially conscious and without breaking the bank.</p><p>Customers use our app to save money at restaurants, pay their bill directly through the app like Uber, and to share their saving with a charity if desired using our Save &amp; Donate feature.</p><p>We have partnered with 9 of Australia’s favorite charities to make this possible in the world’s first system of this type.</p><p>We are looking to expand our customer base, and need the help of talented business development specialists to drive this growth. We are seeking well-presented professionals with excellent social and interpersonal skills.</p><p>You will:</p><p>-Identify and target Corporations in Melbourne, Sydney and Brisbane with 200+ employees who would like to add our membership to their employee salary packages as an additional benefit<br>-Identify and target local Sporting and Social Clubs and Charity organizations that have 100+ members or followers who can sell our memberships as a fundraising tool to support their club<br>-Approach these bodies, educate them about Liven and what we can provide them. This will require calls, emails, and face to face meetings<br>-Negotiate and sell Liven premium memberships to these bodies in bulk</p><p>Requirements</p><p>-Warm personality that makes people comfortable talking with you<br>-Confidence, even in the face of rejection<br>-You should be able to demonstrate a history of exceeding targets in sales<br>-You must be well presented and carry yourself with a professional demeanor at all times</p><p>Benefits</p><p>-Become an early employee of a fast-growing, exciting startup<br>-Have an impact on the company’s growth and evolution, with the potential to work in different cities as the company expands<br>-Uncapped commission structure, the potential to share in significant revenue if you work effectively</p></div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 8:50:20 PM",
    "tags": [
      "BD Manager",
      "Business Development",
      "Full Time",
      "Melbourne",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Sales and Marketing",
      "Sales/Marketing and Strategic Partnerships",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "fwqhPrIMToiORaJSCEBOSw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15865809",
    "title": "HealthPrize | Software Dev | Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/ | $110k-150k + equity At HealthPrize, we are changing the way ...",
    "content": "<div>                  <span>HealthPrize | Software Dev | Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a> | $110k-150k + equity<p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Frontend Hypewords: Vue.js/Vuex/Vuetify, Webpack (for our reference impl. but we use other PWA stacks too - React is next up now that it's under MIT)</p><p>Systems Hypewords: AWS (multi-region deployments), Ansible, Beanstalk, Docker, Aurora, HIPAA/PCI Compliance</p><p>Front End Web Developer: <a href='https://healthprize.com/careers-page/#op-206457-front-end-we..' rel='nofollow'>https://healthprize.com/careers-page/#op-206457-front-end-we...</a>.</p><p>Lead Systems Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems..' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 12:44:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "rVvS3Wn1RCai2aUsMS6M3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129546-city-launcher",
    "title": "City Launcher",
    "content": "<div><h2>City Launcher at Forkable</h2><div>New York City, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Help us bring Forkable to the world! Being a city launcher is like being a serial entrepreneur. You need to be very versatile, with lots of grit, attention to detail, initiative, and resourcefulness. And you should definitely like to travel!</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Full Time",
      "New York City",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown",
      "User Researcher"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hEm6lXz1Qo6lz6KGqq0pUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129544-city-launcher",
    "title": "City Launcher",
    "content": "<div><h2>City Launcher at Forkable</h2><div>San Francisco, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Help us bring Forkable to the world! Being a city launcher is like being a serial entrepreneur. You need to be very versatile, with lots of grit, attention to detail, initiative, and resourcefulness. And you should definitely like to travel!</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 8:47:03 PM",
    "tags": [
      "Attorney",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Igewg8IVSuu7aFitVu0cfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15862856",
    "title": "Mullvad VPN | Gothenburg, Sweden | Full-time, remote as received from their blog news: https://www.mullvad.net/blog/2017/12/5/hiring-full-time-rust... ...",
    "content": "<div>                  <span>Mullvad VPN | Gothenburg, Sweden | Full-time, remote<p>as received from their blog news:</p><p><a href='https://www.mullvad.net/blog/2017/12/5/hiring-full-time-rust-developer-iosandroid-app/' rel='nofollow'>https://www.mullvad.net/blog/2017/12/5/hiring-full-time-rust...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 7:21:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "LxkRzHeQTzGHdiRyeUzcPg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/act-cooperative-corporation-as/jobs/67237-fundraisers-co-workers-to-combat-climate-change",
    "title": "Fundraisers / co-workers - to Combat Climate Change",
    "content": "<div><h2>Fundraisers / co-workers - to Combat Climate Change at ACT Cooperative Corporation AS</h2><div>Oslo, Remote · Cofounder</div><div></div></div><div><div>Skills</div><div>Sales, Social Media Marketing, Sales and Marketing, Communication Skills, Digital Marketing, Crowdfunding</div><div>Compensation</div><div>No Salary<br>0.5%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ABOUT ACT <br>ACT’s Core Infrastructure team is seeking an iOS developer to help build the zero carbon footprint future version of our planet. Sounds interesting? Read on.</p><p>ACT’s Core Infrastructure team is seeking fundraisers to help build the zero carbon footprint future version of our planet. Sounds interesting? Read on.</p><p>We believe that the core problem of global warming is lack of global collaboration. Our goal is to support and enhance global collaboration facilitated by an ecosystem of carefully crafted software systems. Just like Wikipedia is a computer facilitated collaboration platform around building the world’s biggest encyclopedia – so will ACT enable collaboration around green shopping and help humans ACT together for a sustainable planet so that we can do our part to end global warming and also support fair trade.</p><p>- ACT is software technology with smart gamification to connect consumers around sustainable shopping and collaboration.<br>- The immediate goal of ACT is to reduce climate gasses and possibly be the “solution” to global climate change.<br>- ACT is a role model of a democratic organization: Max factor of 8 between highest and lowest paid, all employees has 1 vote, no person or organization can own voting shares (i.e. no external organization can control ACT, which is important to keep us a partner of independent advice).<br>- All software is expected to be open source and free, so that all can take action.</p><p>We have just finished a major design phase and now wish to start serious development of the software platform. We are looking to tell the world about our extraordinary solution for ACTion, that we believe will change the way we manage global climate change almost overnight.</p><p>We need to strengthen our team, our advisory board and council with experienced resources within multiple fields: Management, Communication/journalism/marketing, Financial management, Fundraising, Life cycle analysis &amp; research, Graphical design, Web development, Mobile development, Backend development, Networking.</p><p>WHY ACT?<br>Have you ever thought that it is impossible to solve global climate change and that your effort would mean so little?</p><p>What if you had the chance to work with one of the most ambitious climate change projects? We believe that ACT is one of the most hands-on solutions to mitigating climate change. These might sound like just 'great words,' but do the math yourself: E.g. If only 1700 people decided to use ACT to find the least fossil fuel consuming goods, service alternatives and register their purchases it would deliver a combined purchasing power of 63 million USD/year after tax*, which is the same amount Norway uses to conserve the Amazonas rainforest! And those 1700 people could decide to ACT tomorrow!</p><p>* Assuming a salary of 37,000 USD/year after tax.</p><p>JOB DESCRIPTION, FUNDRAISERS / MARKETEERS<br>ACT is now selling shares and applying for funding with various organizations. We need 2 highly motivated FUNDRAISERS / MARKETEERS to join our Core team in this exciting phase that will have a serious impact on sustainability of our planet. </p><p>At best the following requirements apply to you:</p><p>- You have applied and won support from Innovasjon Norge on multiple occasions.<br>- You have applied and won support from various other foundations.<br>- You have experience from selling shares.<br>- You have a good network.<br>- You have a good command of English.</p><p>The fundraisers will work closely with co-founders and be a part of our small team of entrepreneurs with a flat organizational structure. Since the company is in an early phase you will be able to shape your role in the company exactly how you like it best.</p><p>WORK PLACE<br>This job should at best be carried out as much as possible in co-location with ACT in Oslo, but we are open to remote work too.</p><p>APPLICATION<br>Please send your CV and some words introducing yourself, why you want to work with ACT, highlight relevant previous experience and your current situation.</p><p>For more information about this job and ACT please contact:</p><p>Thomas Jepsen<br>President, Founder &amp; CTO<br>ACT Cooperative Corporation AS</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 5:17:35 PM",
    "tags": [
      "Cofounder",
      "Communication Skills",
      "Crowdfunding",
      "Digital Marketing",
      "Oslo",
      "REMOTE1/50",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "Social Media Marketing",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "XlGJrJUBT-Giy9Veuk7mMg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/start-up-stealth/jobs/140895-cofounder",
    "title": "CoFounder",
    "content": "<div><h2>CoFounder at RiskPool</h2><div>Cleveland, Remote · Cofounder</div></div><div><div>Skills</div><div>Structured Finance</div><div>Compensation</div><div>No Salary<br>15.0%–50.0%</div></div><h3>Job Description</h3><div><p>startup: p2p insurance--from damage/theft--for your productivity tools (laptop, phone, etc), with your social/geographical/affinity network, offering potential for profit sharing (absent losses).   Currently in private Beta pilot.  Building model on the blockchain.  CoFounder should excel in product-market fit  and 1 or 2 additional buckets of work 1) product development around social behavior 2) growth hacking around network effects 3) legal/regulatory structure 4) structured financing/fundraising.  Remote OK.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:19:13 PM",
    "tags": [
      "Cleveland",
      "Cofounder",
      "Finance/Accounting",
      "Growth Hacker",
      "REMOTE1/100",
      "Remote OK",
      "Structured Finance",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "CEuOfQx1Ri6h1R1KdvKEYA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/overtime/jobs/80011-sportswriter-part-time-remote",
    "title": "Sportswriter (Part-Time / Remote)",
    "content": "<div><h2>Sportswriter (Part-Time / Remote) at Overtime</h2><div>New York City, Remote · Contract</div><div></div></div><div><div>Compensation</div><div>$0K–$1K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>** TO APPLY: Contact <a href='mailto:sam@itsovertime.com' rel='nofollow'>sam@itsovertime.com</a> with a sample article using any video from Overtime's social media or app. Read below for more info **</p><p>Overtime has a select number of part-time opportunities for Sportswriters located anywhere in the world.</p><p>RESPONSIBILITIES: </p><p>• Write articles using your own videos and others from the Overtime platform<br>• Work directly with our Editor In Chief and Director of Digital Content to pitch article ideas that will be featured on our website and social media -- which reaches millions worldwide<br>• Act as an ambassador for the Overtime brand and actively try to grow our community of athletes, coaches, fans and fellow Sportswriters</p><p>REQUIREMENTS: </p><p>• You love sports<br>• You're hungry AF<br>• You have some writing or social media experience</p><p>ABOUT OVERTIME:</p><p>Based in NYC, Overtime is funded by Greycroft Ventures, 645 Ventures, Fitz Gate Ventures, other leading VC firms and includes David Stern and NBA players among its investors. The company was co-founded with WME | IMG, the largest sports agency in the world, and the team behind Overtime is responsible for mobile apps with hundreds of millions of downloads worldwide.</p><p>TO APPLY: </p><p>Send your resume/LinkedIn and a sample article featuring a video you found on <a href='https://angel.co/overtime' title=&quot;Overtime&quot; rel='nofollow'><span>@</span><span>Overtime</span></a>'s Instagram or Twitter or our iPhone app to <a href='mailto:sam@itsovertime.com' rel='nofollow'>sam@itsovertime.com</a></p></div>",
    "urlFetchPending": false,
    "published": "Nov 29, 2017 8:53:45 PM",
    "tags": [
      "Content Creator",
      "Contract",
      "New York City",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  }
]
}
