{
 "items": [
  {
    "id": "x-wmYaC9SD6OfLwgX8iUKA",
    "url": "https://www.workingnomads.co/job/go/26056/",
    "title": "UX Research Participant Recruiter (Part-time, Remote)",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Study.com",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 17, 2019 8:46:52 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "crawled": "Jun 6, 2019 4:07:04 PM",
    "content": "<p><strong>UX Research Participant Recruiter (Part-time, Remote)</strong></p><p>We’re looking for a passionate UX Research Participant Recruiter to work online and help with Study.com user research operations such as scheduling and logistically facilitating user research sessions.</p><p><strong>As a contract UX Research Participant Recruiter, you'll receive the following:</strong></p><ul><li>Reliable Payments: Timely, reliable payments twice a month</li><li>Flexibility: Work from anywhere, completely online</li><li>Supportive Staff: Access to a supportive in-house team to answer your questions</li></ul><p><strong>We are looking for a&nbsp;UX Research Participant Recruiter who can handle the following responsibilities:&nbsp;</strong></p><ul><li>Partner with UX researchers to define scope and recruiting specifications for projects</li><li>Build and maintain a large network of potential candidates through proactive market research and on-going relationship management</li><li>Screen, interview and schedule candidates. Also, appropriately compensate the candidates depending on the kind of engagement we’ve had with them.</li><li>Recruit customers, partners and non-customers using different channels (like social media, the study.com website, recruitment events, etc.)</li><li>Be the custodian of research tools – help analyze what tools will serve us best and come up with a cost efficient, robust toolkit that takes our research capabilities to the next level</li><li>Understand how to prioritize projects and how to set up an internal recruitment request process that is easy for everyone at Study.com to follow</li><li>Keep track of participants recruited to ensure we don’t overpay participants, over-use the participants, or use the wrong kind of participants for a study</li><li>Execute NDAs</li><li>Work with external recruiting agencies as needed</li></ul><p><strong>Basic qualifications</strong></p><ul><li>2+ years of research participant recruiting experience</li><li>Must have experience working with different kinds of recruitment and research tools (like survey tools, UX research tools, etc.)</li><li>Bachelor’s Degree or equivalent work experience</li><li>Strong verbal and written communication skills (know how to deal with different kinds of candidates and when and how to follow up)</li><li>Ability to work in a team environment even if the candidate is remote</li><li>Ability to manage multiple recruitment tasks simultaneously</li></ul><p><strong>Preferred qualifications</strong></p><ul><li>Strong focus on participants and commitment to improving the research recruitment process</li><li>Ability to proactively network and establish effective working relationships. Continually seek new sourcing options and develop creative approaches to recruiting participants and rewarding them for their time</li><li>Self-sufficient and able to work with little direct supervision</li><li>Flexibility to work across different time-zones around the world</li></ul><p>Do you think you can be a <strong>UX Research Participant Recruiter&nbsp;</strong>for Study.com? Please apply now!</p><p><strong>About Study.com</strong></p><p>At Study.com, our quest is to make education fun and accessible. We’re working to help students with high quality answers to hard questions that they may have on their academic journey.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ubkvtr3FTtubj5TEgQZQhQ",
    "url": "https://unicornhunt.io/jobs/executive-recruiter-at-mark-and-maven",
    "title": "Executive Recruiter",
    "tags": [
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:gruntjs/nodejs/5",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=6, bigdata-ml=0, ruby=0, apple=0, java=13, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Mark and Maven",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 40000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 40k - 65k /Year"
    },
    "employmentType": "UNSET",
    "published": "May 13, 2019 10:34:25 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "crawled": "Jun 6, 2019 4:07:04 PM",
    "content": "<p>You are curious, and sick to death of spamming outbound recruitment messages to candidates on LinkedIn.<br></p><p>We get it, and we love that. Every recruiting position you’ve ever held has been interesting to you, but it’s always felt a little too much like grunt work when you get into it. You’re interested in meeting people, constantly building out your network, and offering great candidates in your network the opportunity of a lifetime. </p><p>You want freedom, opportunity, a place to learn and a time to shine. A way to meet and engage with clients learn about new business opportunities, on their terms.</p><p>You're one of those people who tries to keep your introduction of your company short, so that you could hear all about the people you’re talking to. You ask questions, find opportunities and gaps in knowledge, and try to bridge the gap between what people need and what you have learned (and can offer).</p><p>If you're for that kind of challenge, get in touch.</p><p>We need:</p><p>• a candidate-centric, empathetic mindset</p><p>• ability to soak up knowledge...</p><p>• ...and transfer it, simply and effectively</p><p>Your colleagues say you:</p><p>• are easy to work with</p><p>• are always on top of the latest tech/apps/trends</p><p>• think laterally</p><p>• are driven but...</p><p>• ...don't have sharp elbows</p><p>• are a person they would also enjoy going to the movies or having a coffee with</p><p>Your mom says that you:</p><p>• have been reading the business section of the newspaper since you were 10</p><p>• are an inventor at heart</p><p>• get your hands dirty</p><p>What’s in it for you: </p><p>• you get a competitive salary, commissions, and full autonomy</p><p>• a complete crash course on early stage startups, investment, and the tech sector (if you need it!)</p><p>• a network with some of the most innovative entrepreneurs in the UK</p><p>• flexible work: working from home when you want, where you want, why you want to (we trust you)</p><p>• continual learning &amp; development opportunities</p><p>• quarterly sprints around the world - we’ll fly you in for team building and learning (the last one was in Cyprus)</p><p>Compensation: £40,000-65,000 commensurate with experience</p><p>Equity: 0.01 - 0.025%</p><p>Mark and Maven is rewriting how the entire technology industry - the entire world! - recruits. The days of the resume are over. We’ve moved passed them. Now we’re helping to rebalance gender and ethnic representation across the whole economy by using private, ethical candidate data to showcase who’s really best for every role. And we’re looking for someone like you.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "g4c9NVLmTL-DbSIgVJf5Pg",
    "url": "https://weworkremotely.com/remote-jobs/clevertech-hr-assistant-n-america-only-remote",
    "title": "Clevertech: HR Assistant (N. America Only - Remote)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 3, 2019 10:53:38 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "crawled": "Jun 6, 2019 4:06:06 PM",
    "content": "<h2> HR Assistant (N. America Only - Remote) </h2><div><div><h4><i>*Please note that although this role is remote, we are only considering candidates within North America*</i></h4></div><div><i><br></i></div><div><h4>About You</h4></div><ul><li>You have solid experience supporting a team and staying organized.<br><br></li><li>You are a go-getter and love diving into any task - big or small.<br><br></li><li>You're fun! You’re charismatic! And you enjoy research and talking with people. You thrive on fast-paced deadlines, managing complex projects and shocking your team with neat tricks and innovative problem-solving skills.<br><br></li><li>You love social media and community engagement.<br><br></li><li>You're available from 9am-5pm EST and it's a HUGE plus if you have previous experience on a distributed team!<br><br></li></ul><div><h4>Who We Are</h4></div><div>Clevertech is a leading consultancy that is on a mission to build transformational digital solutions for the world’s most innovative organizations. Enterprise companies turn to Clevertech to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. By partnering with Clevertech these companies are propelling forward and changing their industries, business models and more.</div><div><br></div><div>Based in New York City with fully remote development teams, Clevertech has built core product offerings for clients whose value was revealed in transactions valued in excess of $100 million.</div><div><br></div><div>The problems we solve everyday are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. We are hiring team members who are passionate and energized by the vision of empowering our customers in a complex industry through technology, data and a deep understanding of client concerns. In order to grasp the scale of problems we face, ideally you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries.</div><div><br></div><div><h4>Our Benefits</h4></div><div>We know that people do their best work when they’re taken care of. So we make sure to offer great benefits that promote personal and professional growth!</div><div><br></div><ul><li>Competitive Vacation Package</li><li>Annual Financial Allowance for YOUR development</li><li>Flexible Family Leave</li><li>Clevertech Gives Back Program</li><li>Clevertech U (Leadership Training Program, Habit Building, New Skills Training)</li><li>Clevertech Swag</li><li>Strong Clevertech Community</li></ul><div><h4>How We Work</h4></div><div>Why do people join Clevertech? To make an impact. To grow themselves. To be surrounded by developers who they can learn from. We are truly excited to be creating waves in an industry under transformation.</div><div><br></div><div>True innovation comes from an exchange of knowledge across all of our teams. To put people on the path for success, we nurture a culture built on trust, collaboration, and personal growth. You will work in small feature-based cross-functional teams and be empowered to take ownership.</div><div><br></div><div>We make a point of constantly evolving our experience and skills. We value diverse perspectives and fostering personal growth by challenging everyone to push beyond our comfort level and try something new.</div><div><br></div><div>The result? We produce meaningful work</div><div><br></div><div><h4>Getting Hired</h4></div><div>We hire people from a variety of backgrounds who are respectful, collaborative, and introspective. Members of the tech team, for example, come from diverse backgrounds having worked as copy editors, graphic designers, and photographers prior to joining Clevertech.</div><div><br></div><div>Our hiring process focuses not only on your skills but also on your professional and personal ambitions. We want to get to know you. We put a lot of thought into the interview process in order to get a holistic understanding of you while being mindful of your time. You will solve problems derived from the work we do on a daily basis followed by thoughtful discussions around potential fit. Whatever the outcome, we want you to have a great candidate experience.</div><div><br></div></div><div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
