{
 "items": [
  {
    "id": "tDJU-d77QoufOqMF3XcIaw",
    "url": "http://jobmote.com/jobs/12468-remote-cassandra-dba-role",
    "title": "Remote Cassandra DBA Role",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "Jun 6, 2018 1:20:49 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Remote Cassandra DBA Role - Jobmote<div><div><h2>Remote Cassandra DBA Role</h2><h5>Access Data Consulting</h5></div></div><div><div><div><div></div></div><div><div><div><p>Top 3 things-Cassandra DBA experience-Linux background-Cloud, Agile, DevOps backgroundInterview process:30 minute phone screenTechnical interview via WebEx or in-personCassandra Database experience required5 years of senior level server administration experience in a large-scale production environment.Strong understanding of development workflow and process.Strong understanding of quality assurance methodologies, workflow, and process.Deep understanding of centralized (n-tier) and decentralized (client/server) environment models.Deep understanding of database management, database server clustering and database instance management.Extensive experience using virtualization technologies to enhance velocity of pre-production lifecycle environment.Proven ability to conceptualize and implement a new architecture/infrastructure based off a BRD (Business Requirements Document).Experience with deployment configuration and automation.Expertise in building scalable, high performance systems that support entire pre-production lifecycle.Ability to rapidly assess, analyze, and resolve complicated issues with little initial information or direction and with varying degrees of ambiguity.Proficient in scripting languages.Ability to prioritize and delegate responsibilities for multiple competing priorities in a fast-paced environment.Excellent verbal and written communication skills.Ability to work well with people and be both highly motivated and motivating.Strong presentation and leadership skills - provided by Dice Cassandra DBA, Linux, Cloud, Agile<br>Associated topics: data analyst, data center, data integrity, data management, data warehouse, database, database administrator, etl, sql, sybase </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "8HL1DT0VSuqVnvtWFlSzaA",
    "url": "http://jobmote.com/jobs/12366-magento-developer-west-yorkshire-and-remote-oop-php-mysql",
    "title": "Magento Developer / West Yorkshire and Remote / OOP PHP / MySQL",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:laravel/php/16",
      "DBG_TECH1:k/t/w:magento/php/96",
      "DBG_TECH1:k/t/w:php/php/25",
      "DBG_TECH1:k/t/w:symfony/php/8",
      "DBG_TECH1:k/t/w:twitter-bootstrap/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=145, embedded=0, frontend=16}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 4:20:46 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Magento Developer / West Yorkshire and Remote / OOP PHP / MySQL - Jobmote<div><div><h2>Magento Developer / West Yorkshire and Remote / OOP PHP / MySQL</h2><h5>X4 Group</h5></div></div><div><div><div><div></div></div><div><div><div><p>Magento Developer required West Yorkshire and Remote / OOP PHP / MySQL / CSS / HTML / JavaScript / MVC</p><p>I wondered if I might be able to interest you in a new Permanent opportunity I have for a <strong>Magento Developer</strong> , based in the <strong>West Yorkshire</strong> area.</p><p>Role: <strong>Magento Developer (Frontend, Backend or Full Stack)</strong><br>Location: <strong>West Yorkshire (Remote working permitted as long as can commute to the office occasionally)</strong><br>Salary: <strong>£30,000 to £50,000</strong></p><p>My client is a vibrant <strong>digital agency</strong> , which has experienced a rapid period of growth and expansion. With a move into in-house products and applications there is new opening within the team for a skilled Magento developer who can come in and coRemote working permitted as long as can commute to the office occasionallympliment their current development team. They are constantly developing new innovative products meaning their is always scope for new projects. They pride themselves on creating a supportive and enjoyable working environment giving all employees the opportunity to flourish.</p><p>They are looking for more Mid to Senior level Magento Developers to join their fast paced ecommerce team. The ecommerce team currently consists of 4 developers, 2 online marketers, 2 content creators, frontend developers and graphic designers... Making for a great environment if you want to work together in a forward thinking team.</p><p>Ideally, they would like to find someone with a number of years experience in Magento development, this includes frontend and backend work. You will be working on the optimisation of sites, including maintenance and also developing brand new builds. They are also in the process of migrating everything to Magento 2 making this a company that likes to work in the latest technologies. Alongside the Magento work you can also be involved with other in house projects, mainly in Laravel as they have some fantastic SaaS products.</p><p><strong>Skills</strong></p><ul><li>Magento (frontend and backend)</li><li>MySQL</li><li>OOP PHP</li><li>CSS</li><li>HTML</li><li>JavaScript</li><li>MVC</li><li>Git</li></ul><p><strong>Desirables</strong></p><ul><li>Laravel/Symfony</li><li>Bootstrap</li><li>Foundation</li></ul><p>My client is looking to offer a salary of <strong>£30,000 to</strong>** £50,000** and would be keen to start interviewing from Tuesday 5th June onwards. What are you up to currently? Do you think this role could be of interest?</p><p>This is only a brief description of the role and I have a full job spec I can send across should you request it.</p><p>It would be great to discuss further, if you could send me an updated CV to I can run through the position with you in more detail. They are looking to line up interviews quite quickly so if you could let me know your availability with regards to this as well that would help.</p><p>I look forward to hearing from you</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "s8LdrhcCTHKe2GPAuO3VKg",
    "url": "http://jobmote.com/jobs/11395-etl-oo-sql-remote",
    "title": "ETL/OO/SQL REMOTE",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/24",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:jersey/java/8",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=6, other=0, dotnet=6, c=2, mobile=2, go=0, nodejs=0, bigdata-ml=24, ruby=0, apple=0, java=12, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "May 26, 2018 12:20:43 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "ETL/OO/SQL REMOTE - Jobmote<div><div><h2>ETL/OO/SQL REMOTE</h2><h5>iTech Solutions</h5></div></div><div><div><div><div></div></div><div><div><div><p>ETL/OO/SQL Software Engineer REMOTE Duties Develops Extract, Transform, Load (ETL) scripts utilizing a thorough understanding of relational databases, object oriented programming, available technology, tools and existing designs. Designs, codes, tests, debugs, and documents programs leveraging Python and Java Provides comprehensive consultation to business unit and IT management and staff at the highest technical level on all phases of application programming. Overall understanding of Big Data architecture and latest trends. Works closely with client and IT management and staff to identify application development solutions, new or modified programs, reuse of existing code through the use of program development software alternatives, or integration of purchased solutions or a combination of the available alternatives. Perform project delivery functions in support of releases Responsible for delivery of medium to high complexity project work Maintain in-depth knowledge of project tools and data sources. Participate in all sprint planning, daily standups, and sprint review sessions Perform sprint demos to get stakeholder agreement that sprint deliverables meet the requirements Provide support for technical specifications Engage in operational readiness activities to ensure that project &quot;go-live&quot; is stable and successful Perform QA Automation functions to ensure project delivery is successful Maintain breadth of knowledge on all business processes. Communicate analytical findings/gaps/solutions to management and offer solutions to meet gaps. Manage the synthesis of large data-sets into meaningful information used to drive action. Determine opportunities and identify technical solutions to increase analytical processing efficiency. Communicate statuses, good and bad, to partners to keep them informed and engaged in the project, minimizing surprises Develops Data workflows and automated scripts in Hadoop Environment using Hive, Impala, Hue, Sqoop, Oozie. Demonstrate passion for anticipating and meeting the expectations and requirements of business partners. Ability to work with different groups to close bridges/gaps, problem solve, and develop solutions Strong accountability and desire to deliver a quality product on time, communicate statuses, or offer alternatives to meet customer objectives Skills * 10+ years' experience with: Object Oriented Design and Development (Python, Java, C#) Agile Engineering Practices Test Driven Development (TDD) Continuous Integration Continuous Delivery Refactoring SQL (Expert in any RDBMS, such as Teradata, Oracle, DB2, MSSQL) Scripting in * nix environments Database performance tuning 3+ years' experience with: Hadoop Environment and tools such as Hive, Impala, Hue, Sqoop, Oozie. Bachelor's degree in Computer Science or a related discipline, at least eight, typically ten or more years of solid, diverse work experience in IT with a minimum of six years' experience application program development, or the equivalent in education and work experience. Other Skills: Demonstrated experience working independently with limited direction Strong written and verbal communication and a strong listener Problem solving and critical thinking Driven to deliver elegant solutions A love of data Healthcare experience is a plus. Knowledge of: Design Patterns Business Intelligence dashboard creation (Tableau, Looker, etc.) Data automation, quality testing and validation For more information please contact Erica Johns at . Since 1995, iTech Solutions Inc., has been providing IT Consulting and Direct Hire Services to the Insurance, Financial, Communications, Manufacturing and Government sectors with local offices in Connecticut, Minnesota, Colorado, Massachusetts, Tennessee, North Carolina, and New Jersey / Pennsylvania area. Our recruiting strategy is simple, if you want to find qualified IT professionals then use IT professionals to find them. So at iTech Solutions, our personnel are all career IT professionals with a wide range of IT experience. We can honestly say our staff understands the technologies, the complexities of finding and selecting the appropriate personnel and the pressures of running successful IT projects. Employer will not sponsor applicants for any employment visas, at hiring or in the future, including but not limited to H-1B visas. Corp-to-Corp or subcontract personnel will not be considered for this position. - provided by Dice </p><p>sql, data, etl, hadoop, python, scripting, sql </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "m3SJUNaCR8ykFEpqp1CA4Q",
    "url": "https://stackoverflow.com/jobs/112752/oracle-database-pl-sql-developer-onsite-and-surge?a=BOrbvuPoJyw",
    "title": "Oracle Database PL/SQL Developer- Onsite and REMOTE, Sandy, Utah at Surge  ",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "May 24, 2018 5:31:24 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Database Administrator, System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>oracle</a><a rel='nofollow'>plsqldeveloper</a><a rel='nofollow'>sql</a><a rel='nofollow'>database-administration</a><a rel='nofollow'>sysadmin</a>                    </div>                                            <h2>Job description</h2>                <div><p>SURGE is looking for smart, self-motivated, experienced, senior automated test engineers&nbsp;who enjoy the freedom of telecommuting and flexible schedules, to work as long-term, consistent&nbsp;(40 hrs/week) independent contractors (no W2)&nbsp;on a variety of software development projects.</p><p>Experience Required:&nbsp;Remote work but willing to go onsite periodically in Sandy, UT as the client needs you to be there. We need someone already living in the area.</p><ul><li><strong>Role</strong>: Oracle PL/SQL Developer</li><li><strong>Skillset</strong>:&nbsp;Expert in PL/SQL programming. Must have experience in Stored Procedures, handling complex SQL queries / scripts, performance analysis on large data sets / batch processing, designing / maintaining physical / logical data models &amp; knowledge on UNIX scripts.</li></ul><p><strong>Only candidates located near Sandy, UT can be considered at this time as this is an onsite and remote position.&nbsp;</strong></p><p>For immediate consideration, email resume and include your cell phone number and start date: <a href='mailto:dsanderson@surgeforward.com' rel='nofollow'>dsanderson@surgeforward.com</a></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/112752?reset=False&amp;ra=BOrbvuPoJyw&amp;oqs=a%3DBOrbvuPoJyw' rel='nofollow'>Apply now</a></div>                                    </div>                        </div>        </div>            <h2>About Surge</h2>            <div><p>Surge is&nbsp;a leading provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies. Founded in 2007, and listed on the Inc. 5000 list of America's fastest growing companies for four straight years, the Surge team has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals. Simply put, Surge offers America's best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Great Pay</span>                            </li>                            <li>                                <span></span>                                <span>Choose Your Hours</span>                            </li>                            <li>                                <span></span>                                <span>Work From Home</span>                            </li>                            <li>                                <span></span>                                <span>Work With Happy People</span>                            </li>                            <li>                                <span></span>                                <span>Zero Commute</span>                            </li>                            <li>                                <span></span>                                <span>See Your Family More</span>                            </li>                            <li>                                <span></span>                                <span>Travel While You Work</span>                            </li>                            <li>                                <span></span>                                <span>Software Provided</span>                            </li>                    </ul>                "
  },
  {
    "id": "J6cQ7pi8R9qfRZaX8v7_dw",
    "url": "http://jobmote.com/jobs/10732-database-developer-remote",
    "title": "Database Developer-Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:asp.net/dotnet/8",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:sql-server/dotnet/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=20, c=4, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "May 18, 2018 11:22:54 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Database Developer-Remote - Jobmote<div><div><h2>Database Developer-Remote</h2><h5>Vector Solutions</h5></div></div><div><div><div><div></div></div><div><div><div><p>Vector Solutions is an award winning, provider of cutting edge, technology-based training solutions for a range of markets including Architecture, Engineering, Construction, Industrial, Public Safety, IT, and Project Management. Our team members are dedicated, interesting, passionate, and results-oriented, and they're committed to ensuring that all clients receive only the best online learning solutions and world class customer service. </p><p>Vector Solutions is seeking a mid-level to senior Development DBA to support our multi-application databases. The optimal candidate would have some experience with C# and ASP.Net application development as well as performance tuning skills. </p><p><strong>Responsibilities:</strong>- Develop intimate knowledge of our enterprise systems underlying data structure;- Work with stake holders to understand data processing requirements- Create and run ad hoc SQL queries; provide organized, formatted query results to business users- Assist with data structure development and refactoring- Perform code reviews to ensure efficient database code.- Help in troubleshooting issues and providing technical solutions<strong>Requirements:</strong>- 4+ years of MS SQL Server programming experiencewriting complex queries, stored procedures etc.- C# development experience a plus but not mandatory- 4+ years of experience designing queries that can be consumed by various reporting engines- Ability to think conceptually and logically about both data and process- Good writing skills for general communication and for writing process documentation- Ability to communicate and work effectively with others- Ability to function in a high-volume environment<strong>Benefits:</strong>- Medical, dental and vision coverage- 401(k) matching- Generous paid time off- 10 paid holidays- Tuition reimbursement- Company social events</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "bg37h2bKRuS91TGVCuUBuw",
    "url": "https://weworkremotely.com/remote-jobs/magic-fuel-games-mobile-server-engineer",
    "title": "Magic Fuel Games: Mobile Server Engineer",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:google-app-engine/java/8",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=5, c=10, mobile=9, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=2, java=9, gamedev=8, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/java",
      "TECH1/mobile",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "java",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "May 3, 2018 5:48:27 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Mobile Server Engineer</h2>      <h4>Posted May  3</h4>    <h3>      <span>Magic Fuel Games</span><br>      <span>Headquarters: San Leandro, CA</span><br>        <a href='https://magic-fuel-games.breezy.hr/p/d8f4db9c0e4f-mobile-server-engineer?source=weworkremotely' rel='nofollow'>https://magic-fuel-games.breezy.hr/p/d8f4db9c0e4f-mobile-server-engineer?source=weworkremotely</a>      <br>      <a rel='nofollow'>View all Magic Fuel Games jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>Who We Are:</span></div><div><br></div><div>Magic Fuel Games is a mobile games startup created by a group of games industry veterans who have created a world-class team to create globally appealing titles. We are deep into development of our debut title and we are looking for an energetic and creative contributor to join us on our journey to launch and beyond.</div><div><br></div><div><span>Who You Are:</span></div><div><br></div><div>You should have a deep understanding of game server technology, and be able to switch effortlessly between prototyping ideas and writing scalable, bug-free production code.</div><div><br></div><div>Our team is small and you will be expected to take a significant part in improving the team's technology and engineering practices as well as implementing features. Day to day you'll be involved in evaluating design proposals for technical feasibility, working on features with designers, fixing bugs and reviewing code. You should expect to be working on aspects of the game that are as diverse as, collaborating with designers to develop highly engaging gameplay to designing and writing the server-side validation to ensure that features can't be easily hacked</div><div><br></div><div>Ideal candidates will have worked on an Android and/or iOS title with a client-server architecture. Unity knowledge is a plus and like all of our hires, you need to be a good team player.</div><div><br></div><div><span>What you’ll work on:</span></div><div><br></div><ul><li>Working within a team to build scalable features for a F2P mobile title</li><li>Optimizing features to ensure that our players are never impacted by load on our game server and database</li><li>Helping to secure the service from cheaters and fraudsters</li><li>Working with client engineers to ensure that features are developed to minimize server load and cost</li><li>Communicating clearly across all disciplines to explain complex problems, potential solutions and their advantages and disadvantages using metrics and evidence to back up points</li></ul><div><span>What you’ll need:</span></div><div><br></div><ul><li>Bachelor’s degree or better in Computer Science or equivalent experience</li><li>Demonstrable experience in building and scaling an online game service</li><li>Solid understanding of networking protocols</li><li>Experience working with cloud services such as AWS, Azure or Google App Engine</li><li>Knowledge of noSQL and SQL databases</li><li>Expert knowledge of javascript, C# or C++</li><li>Understanding of data structures and algorithms and their impact on service quality and cost</li><li>Awareness of the constraints faced by a mobile game and the impact they have on architecture</li><li>Desire to work in a creative, inspired start-up environment</li><li>A passion to continue to improve yourself and those you work with</li><li>Minimum of two years experience</li></ul><div><span>What would be a bonus:</span></div><div><br></div><ul><li>Experience of server engineering especially in javascript</li><li>An expert knowledge of MongdoDB</li></ul><div><span>What we offer:</span></div><div><br></div><ul><li>100% paid medical/dental/vision</li><li>Profit Sharing Plan</li><li>Equity Grants</li><li>Really cool office close to Bart</li><li>Opportunity for remote working from North America or Canada</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://magic-fuel-games.breezy.hr/p/d8f4db9c0e4f-mobile-server-engineer?source=weworkremotely' rel='nofollow'>https://magic-fuel-games.breezy.hr/p/d8f4db9c0e4f-mobile-server-engineer?source=weworkremotely</a></p>  </div>"
  },
  {
    "id": "pmDq5jQJTvCNlyEzdBsvwQ",
    "url": "https://stackoverflow.com/jobs/148234/remote-senior-postgres-dba-surge?a=NId6oQhL7QQ",
    "title": "REMOTE Senior Postgres DBA at Surge  ",
    "tags": [
      "DBG:surround``5N(  OR( 2N(work,remot), work 2W from 2W home), 2N( OR(zero, no, avoid), commut)  )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/dbms",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2018 11:39:38 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Database Administrator, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>SURGE is looking for smart, self-motivated, experienced, senior-level software engineers who are willing to work on-site at one of our strategic client location. There is potential for permanent placement or conversion to remote work following the 6 month contract. Surge offers work as long-term, consistent (40 hrs/week) independent contractors (no W2) on a variety of software development projects.</p><p><strong>Skills &amp; Requirements</strong></p><p>Our immediate need is for a Senior Postgres DBA position.</p><p>Only candidates located in Canada and/ or the US can be considered at this time. Sorry, No Visas.</p><p>Resume must include the tech stack under each job.</p><p>For immediate consideration, email resume and include your cell phone number and start date.</p>                    </div>                            <h2>                About Surge            </h2>            <div><p>Surge is&nbsp;a leading provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies. Founded in 2007, and listed on the Inc. 5000 list of America's fastest growing companies for four straight years, the Surge team has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals. Simply put, Surge offers America's best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great Pay                            </div>                            <div>                                 Choose Your Hours                            </div>                            <div>                                 Work From Home                            </div>                            <div>                                 Work With Happy People                            </div>                            <div>                                 Zero Commute                            </div>                            <div>                                 See Your Family More                            </div>                            <div>                                 Travel While You Work                            </div>                            <div>                                 Software Provided                            </div>                    "
  },
  {
    "id": "HFSK-mKES7aX1B0x-gtatw",
    "url": "http://jobmote.com/jobs/4979-database-developer-remote",
    "title": "Database Developer-Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:asp.net/dotnet/8",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:sql-server/dotnet/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=20, c=4, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "unit": "UNSET"
    },
    "employmentType": "UNSET",
    "published": "Apr 14, 2018 10:21:46 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Database Developer-Remote - Jobmote<div><div><h2>Database Developer-Remote</h2><h5>Vector Solutions</h5></div></div><div><div><div><div></div></div><div><div><div><p>Vector Solutions is an award winning, provider of cutting edge, technology-based training solutions for a range of markets including Architecture, Engineering, Construction, Industrial, Public Safety, IT, and Project Management. Our team members are dedicated, interesting, passionate, and results-oriented, and they're committed to ensuring that all clients receive only the best online learning solutions and world class customer service. </p><p>Vector Solutions is seeking a mid-level to senior Development DBA to support our multi-application databases. The optimal candidate would have some experience with C# and ASP.Net application development as well as performance tuning skills. </p><p><strong>Responsibilities:</strong>- Develop intimate knowledge of our enterprise systems underlying data structure;- Work with stake holders to understand data processing requirements- Create and run ad hoc SQL queries; provide organized, formatted query results to business users- Assist with data structure development and refactoring- Perform code reviews to ensure efficient database code.- Help in troubleshooting issues and providing technical solutions<strong>Requirements:</strong>- 4+ years of MS SQL Server programming experiencewriting complex queries, stored procedures etc.- C# development experience a plus but not mandatory- 4+ years of experience designing queries that can be consumed by various reporting engines- Ability to think conceptually and logically about both data and process- Good writing skills for general communication and for writing process documentation- Ability to communicate and work effectively with others- Ability to function in a high-volume environment<strong>Benefits:</strong>- Medical, dental and vision coverage- 401(k) matching- Generous paid time off- 10 paid holidays- Tuition reimbursement- Company social events</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  }
]
}
