{
 "items": [
  {
    "id": "XNt3auCTQ4qiUPUemFzxGw",
    "url": "https://remote.co/job/technical-recruiter-18/",
    "title": "Technical Recruiter",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 2W work W experi",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GitLab",
      "sameAs": "https://gitlab.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 5, 2019 3:30:17 PM",
    "validThrough": "Sep 12, 2019 3:30:17 PM",
    "crawled": "Sep 5, 2019 4:07:15 PM",
    "content": "<h3>Technical Recruiter at <span>GitLab</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span> | <span> International </span></div><div>            <p>at GitLab</p><p>Anywhere</p><p><strong>This position can be located anywhere in the world and is remote based.</strong></p><p>GitLab is looking for a technical recruiter to create positive experiences for GitLab applicants and hiring teams. We’re growing quickly and need a dynamic team member to help us identify amazing candidates, improve our existing hiring practices, and deliver exceptional customer service. GitLab strives to be a preferred employer and will rely on the recruiters to act as brand ambassadors by embodying the company values and identifying those values in potential team members. We need a recruiter who is enthusiastic about working with high volume and is dedicated to helping us build a qualified, diverse, and motivated team. This role reports to the Recruiting Director.</p><p><strong>Responsibilities</strong></p><ul><li><ul><li>Collaborate with managers to understand requirements and establish effective recruiting strategies</li><li>Develop and advertise accurate job descriptions to attract a highly qualified candidate pool</li><li>Identify creative and strategic ways to source great people</li><li>Apply effective recruiting practices to passive and active candidates</li><li>Source, screen, interview and evaluate candidates</li><li>Assess candidate interest and ability to thrive in an open source culture</li><li>Foster lasting relationships with candidates</li><li>Share best practice interviewing techniques with managers</li><li>Build an effective network of internal and external resources to call on as needed</li><li>Ensure applicants receive timely, thoughtful and engaging messaging throughout the hiring process</li><li>Partner with Marketing to develop and deliver a disruptive employer brand strategy</li><li>Promote our values, culture and remote only passion</li><li>Design and monitor key metrics to evaluate the effectiveness of our employment practices</li><li>Develop recommendations for course corrections by leveraging data from our ATS, post interview and post hire surveys and other feedback loops</li><li>Continually search for opportunities to elevate our brand by identifying industry best practices, evaluating competitors and nurturing networks and partnerships</li></ul></li></ul><p><strong>Requirements</strong></p><ul><li><ul><li>Experience recruiting at all levels, preferably in a global capacity within the software industry, open source experience is a plus</li><li>Proven success in recruiting and filling technical positions</li><li>Demonstrated ability to effectively source and place candidates for all positions at all levels</li><li>Experience with competitive global job markets preferred</li><li>Focused on delivering an excellent candidate experience</li><li>Ambitious, efficient and stable under tight deadlines and competing priorities</li><li>Remote working experience in a technology startup will be an added advantage</li><li>Ability to build relationships with managers and colleagues across multiple disciplines and timezones</li><li>Working knowledge using an applicant tracking systems</li><li>Outstanding written and verbal communication skills across all levels</li><li>Willingness to learn and use software tools including Git and GitLab</li><li><strong>College / University degree in Marketing, Human Resources or related field from an accredited institution preferred</strong></li><li>Successful completion of abackground check</li></ul></li></ul><p><strong>Hiring Process</strong></p><ul><li><ul><li>Qualified applicants will be invited to schedule a 30 minutescreening call</li><li>Next, candidates will be invited to schedule a 30 minute interview with another member of the Recruiting team</li><li>Next, candidates will be invited to schedule a panel interview with other Recruiters</li><li>Next, candidates will be invited to schedule a 30 minute interview with our Recruiting Director</li><li>Next, candidates will be invited to schedule a 30 minute interview with our Chief Culture Officer</li><li>Candidate may also be invited to schedule a 45 minute interviews with our VP of Engineering or other leader</li><li>Finally, our CEO may choose to conduct a final interview</li></ul></li></ul>        </div><div>        <a href='https://boards.greenhouse.io/gitlab/jobs/4399600002' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RXxTOc31TWeuPrQdprxvpg",
    "url": "https://jobmote.com/job/69068/sr-hr-systems-developer-workday-integration-specialist-remote-an/",
    "title": "Sr. HR Systems Developer / Workday Integration Specialist (REMOTE - An",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``posit 5W 2N(from,anywher)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Magellan Health",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 4, 2019 10:07:46 PM",
    "validThrough": "Sep 7, 2019 10:07:46 PM",
    "crawled": "Sep 5, 2019 3:06:25 AM",
    "content": "<div>Job Description Responsible for Workday system management and performance optimization. Designs, develops, and maintains system integrations. Plans, schedules, and implements platform upgrades. Configures and administers system security, automated business processes, and tenant configuration. Provides escalated (third-tier) technical support to users, and manages problem resolution with vendors. This is a remote position, allowing you to telecommute from anywhere in the US. * Collaborates with i</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "T6pHjqyjQFKx3LK8n7fBMg",
    "url": "https://weworkremotely.com/remote-jobs/apple-leadership-recruiter-contract-remote",
    "title": "Apple: Leadership Recruiter (Contract - Remote)",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Apple",
      "sameAs": "https://www.apple.com/jobs/us/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 4, 2019 8:27:27 PM",
    "validThrough": "Sep 11, 2019 8:27:27 PM",
    "crawled": "Sep 4, 2019 8:30:23 PM",
    "content": "<h3> Leadership Recruiter (Contract - Remote) </h3><div><div>Do you have a passion for supporting the strategy and evolution of leadership recruiting for Apple Retail? As a Retail Recruiting Leadership Recruiter, you are responsible for hiring external Leadership candidates and building leadership pipelines in specific geographic markets. You operate in two equally critical roles; as an ambassador of Apple’s Retail culture to external candidates and as a highly-skilled recruiter with deep knowledge of market intelligence. In this role, you report directly into the Senior Manager, Leadership Recruiting.<br><br>Maintaining close and trusted partnerships are critical to the success of your role. You align your recruiting efforts to the overall talent and recruiting strategy of the market by communicating consistently and educating your clients on geographic market trends. You are immersed in the Retail culture and ensure exceptional candidate experiences.<br><br></div><h3>Key Qualifications</h3><ul><li>At least 5 years of full lifecycle recruiting in-house or agency</li><li>Experience with applicant tracking systems and other recruiting technologies (CRM, social and onboarding tools) and knowledge of competency-based interviewing</li><li>Ability to prioritize and reprioritize in a fast-paced, high volume recruiting environment</li></ul><h3>Description</h3><div>You are responsible for full lifecycle recruitment including sourcing, screening, presenting and hiring external Leadership candidates for your clients You are collaborative and a key partner to the Market Recruiting Lead. You provide market expertise to your clients on the current talent landscape. You contract on recruiting needs to include, establishing timelines, benchmarks, and deliverables.&nbsp;<br><br>You drive and maintain candidate pipeline readiness by demonstrating various attraction initiatives including university, inclusion &amp; diversity, and other outreach campaigns. You measure performance through weekly reporting and analytics of headcount changes supporting talent decisions in the market and driving continuous improvement. You are an active participant on team calls, meetings and other communications to stay informed of business priorities. You explore new and different sources of talent to present to the business delivering a diverse candidate pool. You participate in routine discussions with the Market Recruiting Lead for your stores, strategizing and planning immediate and longer-term talent needs including new store openings and remodels.<br><br>You will be the recruitment subject matter expert, who continually demonstrates creative sourcing strategies. You will work consistently to ensure an outstanding candidate experience. You will navigate and overcome any roadblocks in the hiring process through the effective use of time and resources.<br><br>This is a contract, remote position.<br><br></div><h3>Additional Requirements</h3><ul><li>Experience in developing and delivering effective recruiting strategies</li><li>Skilled at negotiation and delivering successful outcomes</li><li>Experience in and/or understanding of the Retail industry</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dFL8K-xnSKCYZDybvd31Ww",
    "url": "https://problogger.com/jobs/job/quickbooks-hiring-a-deputy-editor-who-wants-to-support-growing-businesses-2/",
    "title": "QuickBooks Hiring a Deputy Editor Who Wants to Support Growing Businesses",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "QuickBooks",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2019 2:00:00 AM",
    "validThrough": "Sep 10, 2019 2:00:00 AM",
    "crawled": "Sep 3, 2019 9:31:26 PM",
    "content": "<h3>QuickBooks Hiring a Deputy Editor Who Wants to Support Growing Businesses</h3><div>Company: QuickBooks</div>Location: Remote<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><span>The QuickBooks Resource Center serves as practical guidance for business owners, general managers, financial professionals, and IT managers at companies growing rapidly. As the team creating the resource center, our job is to support companies as they move along, sustaining or growing their businesses however they want to.</span></p><p><span>We aren’t doing content marketing or writing blog posts, we are building a media company on behalf of QuickBooks. To quote the quarry worker’s creed, “We who cut mere stones must always be envisioning cathedrals.”</span></p><p><span>We are looking for a deputy editor to help us build a publication of stories, insightful guides, and actionable advice. The deputy editor will work remotely, for 40 hours per week. We are accepting applications for this position until October 3, 2019. Interested in joining us?</span></p><p><span>You are:</span></p><ul><li><span>Available to edit 20 1,500-word articles per month (line editing, fact-checking, logic and conceptual editing, rewriting when needed)&nbsp;</span></li><li><span>Experienced with nurturing a team of freelance writers and providing them with constructive feedback, as well as receiving feedback from editors and business managers</span></li><li><span>Willing to spend time meeting with and understanding key stakeholders, and organizing editorial processes</span></li><li><span>Resourceful in solving problems (e.g., asking questions through cold emails for research, or picking up the phone to interview people, etc.)</span></li><li><span>As interested in finding readers (through SEO, syndication, guest posts, etc.) as you are in editing articles</span></li></ul><p><span>We are:</span></p><ul><li><span>Supporting rapidly growing businesses in sustaining themselves or growing to the next level</span></li><li><span>Invested in supporting you to become a better editor</span></li><li><span>Keen to learn from your skills and experience</span></li><li><span>Eager to build a team that meets regularly and supports one another</span></li><li><span>Happy to compensate you well for great work</span></li></ul><p><span>To apply:</span></p><ul><li><span>Write an email to <span>[email&nbsp;protected]</span> with the subject line, “QuickBooks Deputy Editor application”</span></li><li><span>Please include 2-3 editing samples (links are best), along with a few sentences about what you changed about the article</span></li><li><span>Read this article and provide us with feedback. What is one thing you would keep, one thing you would cut, and one thing you would change? </span><a href='https://quickbooks.intuit.com/r/uncategorized/why-its-time-to-stop-thinking-about-scaling/' rel='nofollow'><span>https://quickbooks.intuit.com/r/uncategorized/why-its-time-to-stop-thinking-about-scaling/</span></a><span>&nbsp;</span></li><li><span>Tell us about a publication you have edited for, and the results of your work (e.g., building a team, article quality, pageviews, time on page, etc.)</span></li><li><span>Let us know who you are and where you are. We want to get to know you</span></li></ul><p><span>I’ll say it again: We are accepting applications for this position until October 3, 2019. </span></p>          </div>                <h5>Application Instructions</h5>    <div>                            Write an email to <span>[email&nbsp;protected]</span> with the subject line, “QuickBooks Deputy Editor application”<br><br>Please include 2-3 editing samples (links are best), along with a few sentences about what you changed about the article<br><br>Read this article and provide us with feedback. What is one thing you would keep, one thing you would cut, and one thing you would change? https://quickbooks.intuit.com/r/uncategorized/why-its-time-to-stop-thinking-about-scaling/&nbsp;<br><br>Tell us about a publication you have edited for, and the results of your work (e.g., building a team, article quality, pageviews, time on page, etc.)<br><br>Let us know who you are and where you are. We want to get to know you                </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6Mm4AMMpRMOnDdwpLcPonA",
    "url": "https://remote.co/job/people-operations/",
    "title": "People Operations",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "ConvertKit",
      "sameAs": "http://www.convertkit.com"
    },
    "salary": {
      "currency": "USD",
      "minValue": 6500,
      "maxValue": 108000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 6.5k - 108k /Year"
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2019 3:48:21 PM",
    "validThrough": "Sep 10, 2019 3:48:21 PM",
    "crawled": "Sep 3, 2019 4:07:22 PM",
    "content": "<h3>People Operations at <span>ConvertKit</span></h3><div><span><i></i> Remote</span>         | <span> High-paying </span></div><div>            <p><strong>REMOTE</strong> · Boise, Idaho, United States · Operations</p><p><strong>DESCRIPTION</strong></p><p>ConvertKit is on a mission to help creators earn $1B using our SaaS email marketing platform. We are 100% independent,<strong> 100% remote </strong>and are growing rapidly. We are proud to have built a product that our customers love, and we’re looking for a talented People Ops person to contribute to our operations team in a full-time role. If you thrive off connecting with people, managing systems that meet state and federal requirements, care about creating an incredible culture, and have seen rapid growth this might be the role for you!</p><p><strong>WHY CONVERTKIT IS INTERESTING:</strong></p><ul><li>We are a 100% bootstrapped company with <strong>a 100% remote team with teammates in 40 cities across 9 countries.</strong></li><li>Every team member is committed to our mission, vision and values. Our mission is not your standard mailed-in variety; We exist solely to help creators earn a living from their craft, and we take that very seriously.</li><li>We put a high emphasis on work / life balance.</li><li>We were named #23 on the 2019 Inc 5000 – the fastest growing private companies in America. We were the #1 fastest growing software company on the list.</li></ul><p><strong>REQUIREMENTS</strong></p><p>As People Ops, you’ll be responsible for helping us maintain our fantastic culture and scale our people systems and processes as we continue to grow. We’ll give preference to applicants with leadership development and succession planning experience at a rapidly growing company (ideally a software startup). The role reports to the Director of Operations, which reports to the COO.</p><p><strong>Your responsibilities will include:</strong></p><ul><li>Teach and coach managers around all aspects of performance management, including career alignment, performance reviews, terminations, and career development plans</li><li>Help improve team member performance by identifying opportunities for growth and coaching managers and teammates through the process</li><li>Serve as an advocate for diversity, equity, and inclusion throughout our team culture, including our hiring practices</li><li>Manage benefits &amp; renewals annually (including 401k compliance)</li><li>Onboard new hires to set them up for success over their first 90 days and beyond</li><li>Manage and ensure compliance with our hiring and termination process</li><li>Build on and operate our team wellness program and quarterly book club</li><li>Manage and issue contracts for vendors and contractors</li><li>Ensure performance reviews are done timely and consistently</li><li>Use data, metrics, and analytics to measure success and make better decisions</li><li>Lead strategic people and culture initiatives (e.g. team culture surveys, management and leadership trainings, career development programs, and performance review practices)</li><li>Be as a trusted resource to leadership and team members by handling questions related to people policies, programs, and procedures, including benefits, leave of absence, disability, and workers’ compensation</li><li>Develop, implement, and maintain best-in-class HR policies and processes that are compliant with state and federal regulations and updating them in our company handbook</li></ul><p><strong>The right person for this position will have:</strong></p><ul><li>Enthusiasm and belief in the ConvertKit mission.</li><li>A strong belief in diversity, equity, and inclusion, including practical knowledge of best practices to improve our culture through DE&amp;I</li><li>Excellent knowledge of HR best practices and industry standards, particularly with regard to compliance, employee benefits, onboarding, employee relations</li><li>Ability to think strategically with a passion for building and growing cohesive teams. Experience developing and implementing successful initiatives for performance management, coaching, and learning and development.</li><li>Experience managing HR vendors/software</li><li>Strong social and emotional intelligence – you enjoy cultivating relationships with all types of people</li><li>An orientation towards team success over individual success and an ability to solve problems with a positive attitude</li><li>Integrity with the ability to manage confidential information and sensitive situations with the highest level of discretion and judgment</li><li>An approachable and caring manner that encourages trust and vulnerability within the team</li><li>5+ years experience in human resources or people operations at a SaaS company</li><li>High degree of attention to detail</li><li>Ability to meet tight deadlines</li><li>Strong analytical, planning, organizational and time management skills</li><li>Strong and demonstrated written and verbal communication skills</li><li>Experience with or comfort in working as part of a remote team</li></ul><p><strong>BENEFITS</strong></p><ul><li>3 weeks paid vacation, 8 paid holidays, and 1 week of paid sick leave / year, bumping up to 4 weeks vacation after 1 year of employment</li><li><strong>The team gathers twice a year in-person for fantastic team retreats</strong></li><li>12 weeks paid leave for birthing parents / 4 weeks paid leave for non-birthing parents, as well as flexible scheduling in the first year after your child is born</li><li>$2,500 equipment allowance given every 2 years</li><li>4% 401k match</li><li>Yearly conference credit</li><li>$1,000 yearly “paid paid vacation” bonus</li><li>Excellent health, vision, and dental benefits</li></ul><p>ConvertKit is an equal opportunity employer. We value diversity in all of its forms and we hire the best person for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for.</p><p>We encourage every person who is interested to apply. We’re imperfect communicators, so think of this job posting as the starting point for discussion rather than proof that you shouldn’t apply. Take the leap – you never know, you might just be the perfect person for the role, even if you don’t match 100% of the job description above.</p><p>Salary Range: $65,00-$108,000.</p>        </div><div>        <a href='https://convertkit.workable.com/j/ABDCF9D11F?viewed=true' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Bs66EdjxTXO1sh_AYbOEuw",
    "url": "https://weworkremotely.com/remote-jobs/dataquest-hr-manager",
    "title": "Dataquest: HR Manager",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/16",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=16, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Dataquest",
      "sameAs": "https://dataquest.breezy.hr/p/7d1cebbf417d-hr-manager?source=weworkremotely"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2019 3:17:57 PM",
    "validThrough": "Sep 10, 2019 3:17:57 PM",
    "crawled": "Sep 3, 2019 4:06:22 PM",
    "content": "<h3> HR Manager </h3><div><div>Dataquest is an interactive online learning platform for data science. We’re passionate about helping students go from zero to job ready. We help students deeply learn concepts, build projects, work together, and gain the confidence they need to start new careers. Read more about our philosophy <a href='https://www.dataquest.io/blog/the-perfect-data-science-learning-tool/' rel='nofollow'>here</a>, and read what students think <a href='https://www.switchup.org/bootcamps/dataquest' rel='nofollow'>here</a>.<br><br></div><div>We want to help tens of millions of students worldwide change their lives through data science education, and you’ll play a key role in helping us get there. We’re looking for an HR manager to help us continue to build out our 30-person remote team. We believe that team and culture are the most important factors in whether a company succeeds. Thus, HR Manager is a very important role at Dataquest, and you’ll have a major impact on how we grow as a company.<br><br></div><div>You’ll have the opportunity to work on our strategies around benefits, training, onboarding, and performance evaluation. You’ll also have input into our values, how we recruit, and how we continuously improve in response to input from team members.<br><br></div><div><br>Who should apply?<br><br></div><div>Ideally, you’ll have experience as an HR manager at a fast-growing startup, and will be excited by the challenge of building out the HR function. You’ll be able to coach employees and resolve concerns in collaboration with the leadership team. You’ll be able to report on progress in HR using metrics. Diversity and inclusion are very important to us, and you’ll be excited about building and working with a diverse team.<br><br></div><div><br>How you’ll contribute<br><br></div><ul><li>Work with the leadership team to create an HR strategy and a roadmap for continuous improvement</li><li>Work with leaders to identify and address employee concerns</li><li>Serve as a coach to help employees raise and resolve concerns</li><li>Ensure that team members onboard smoothly and start contributing quickly</li><li>Oversee and improve benefits offerings over time</li><li>Oversee and improve how we conduct performance management, including quarterly review cycles</li><li>Keep us in compliance with relevant labor regulations</li><li>Explore and implement new policies and tools to improve our culture</li><li>Embody and drive our culture across the team</li><li>Ensure that team members feel connected to each other through setting up social chats and organizing gifts</li><li>Oversee and improve internal training programs</li><li>Coordinate our company offsites</li><li>Report on and improve diversity and inclusion metrics</li><li>Report on key employee and HR-related metrics</li></ul><div><br>Requirements<br><br></div><ul><li>Experience building out the HR function at a fast-growing startup</li><li>Proven ability to work with leadership teams to continuously improve HR</li><li>Experience evaluating and implementing new HR tools</li><li>A desire to continuously learn and improve your HR skills</li><li>Experience creating and implementing HR strategy</li><li>Excitement around coaching team members, along with a desire to resolve underlying concerns</li><li>Experience working with and reporting HR metrics</li></ul><div><br>Why You Want to Work at Dataquest<br><br></div><ul><li>The chance to see your impact on the lives of our students every day</li><li>The opportunity to be part of an engaged and mission-driven team</li><li>The chance to contribute to team direction</li><li>Be able to work as part of a 100% remote team!</li><li>A supportive environment where you can get help</li><li>Flexible vacation and sick leave</li><li>An annual professional development allowance</li><li>Medical, dental, and vision benefits (for full-time US-based employees only)</li><li>401(k) and life insurance plans (for full-time US-based employees only)</li></ul><div><br></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "tegNGamHQuS2B5qN8DDWvQ",
    "url": "http://workinstartups.com/job-board/job/83655/finance-manager-amp-hr-coordinator-at-buyapowa/",
    "title": "Finance Manager &amp; HR Coordinator",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Buyapowa",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2019 4:33:30 PM",
    "validThrough": "Aug 28, 2019 4:33:30 PM",
    "crawled": "Sep 2, 2019 6:23:08 PM",
    "content": "<p><strong>About us:</strong></p><br /><p>Buyapowa is a technology company based in London, with offices in Paris and Vancouver. We operate the leading global refer-a-friend platform, which allows brands and retailers to identify their biggest advocates, then motivates and rewards them for introducing new customers. Plugging seamlessly into an existing website or app, the Buyapowa platform does more than merely ask customers to refer their friends - it incentivises and equips them to share again and again.</p><br /><p>Since launching in 2011, Buyapowa has worked with over 100 of the world&rsquo;s largest brands and retailers, including Sprint, Gap, Vodafone, First Direct, Expedia, Telefonica and BT. Following the acquisition of Canada&rsquo;s RewardStream in 2018, Buyapowa is well positioned for strong growth in the North American market and beyond.</p><br /><p>Globally, we&rsquo;re a team of 40 employees and we&rsquo;re growing quickly. We&rsquo;ve won awards both, for our technology and our work with clients. And we&rsquo;re passionate about what we do - so we like to get things done - but, at the same time, we have fun as a team and thrive off each other&rsquo;s energy.</p><br /><p><strong>The role:&nbsp;</strong></p><br /><p>We are searching for a talented individual with broad accounting and HR generalist experience to work alongside our CFO &amp; VP Talent.</p><br /><p>Hours are flexible with circa 20 to 30 hours per week with the ability to work from home with at least one day per week in the London office.</p><br /><p>The role may suit a finance professional wanting flexibility around hours to fit with family or other commitments.</p><br /><p><strong>What you will do:</strong></p><br /><p><strong>Financial / Accounting Support</strong></p><br /><ul><br /><li>Manage day to day bookkeeping, including all aspects of our sales &amp; purchase ledger, cash and banking, posting to QuickBooks</li><br /><li>Work closely with our CFO to ensure timely &amp; accurate month end close</li><br /><li>Produce monthly management accounts and Board papers</li><br /><li>Assist with annual budgets and quarterly re-forecasts</li><br /><li>Maintain weekly cash flow forecast</li><br /><li>Balance Sheet Reconciliations (incl. bank, credit cards, inventory)</li><br /><li>Liaise with the Canadian operation as required to provide consolidated numbers</li><br /></ul><br /><p><strong>HR / Office Management Support</strong></p><br /><ul><br /><li>Providing administrative and operational support to the VP Talent.</li><br /><li>Assisting with on-boarding; ensuring necessary documents are complete and that each new starter is legally compliant.</li><br /><li>Ownership of data on our internal systems, ensuring information is correct and regularly updated.</li><br /></ul><br /><p><strong>You are:&nbsp;</strong></p><br /><ul><br /><li>Qualified accountant (ICAEW, CIMA, ACCA)</li><br /><li>Methodical, analytical, organised</li><br /><li>Exceptional attention to detail</li><br /><li>Ability to work under pressure and in a fast paced startup environment</li><br /><li>Excellent verbal &amp; written communication skills</li><br /><li>Good working knowledge of Excel</li><br /><li>Constantly seeking ways to improve ways of working</li><br /></ul><br /><p><strong>Why you&rsquo;ll love us:</strong></p><br /><ul><br /><li>You&rsquo;ll be part of a small, competent and highly ambitious team</li><br /><li>You will own initiatives and have the autonomy to execute your plan</li><br /><li>Be part of a rapidly growing business expanding internationally</li><br /><li>A Perks@Work account for significant discounts on products, experiences and things like gym membership</li><br /><li>Excellent tax-efficient equity scheme</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2U3Qf5UXTf68cI8GQKes4Q",
    "url": "https://problogger.com/jobs/job/contemporary-romance-writers-wanted-long-term-work-hiring-now/",
    "title": "CONTEMPORARY ROMANCE WRITERS WANTED! | LONG-TERM WORK | HIRING NOW",
    "tags": [
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "HotGhostWriter Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2019 2:00:00 AM",
    "validThrough": "Sep 6, 2019 2:00:00 AM",
    "crawled": "Aug 30, 2019 9:31:32 PM",
    "content": "<h3>CONTEMPORARY ROMANCE WRITERS WANTED! | LONG-TERM WORK | HIRING NOW</h3><div>Company: HotGhostWriter Ltd.</div>Location: Anywhere<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><b>Do you have in-depth knowledge of contemporary romance? Are you eager to put that expertise to good use and earn a consistent income?</b></p><p><span>If so, then this could very well be your next paid writing gig!</span></p><p>&nbsp;</p><p><b>* Job Overview</b></p><p><span>We are currently looking to expand our fiction team with amazing and experienced contemporary romance writers. Please note, this role is looking for those with ample experience within contemporary romance, those without solid experience won’t qualify. Also, please be aware that writers must be US/Canada based. Exceptions can be made if you’re a brilliant writer from a native English speaking country.</span></p><p><span>We are a fast-paced, growing ghostwriting service that can provide you with consistent and exciting projects week after week! We offer consistent work without having to apply for jobs, with the work coming to you.</span></p><p><span>If you are someone that takes pride in their work and is looking to earn a regular income doing what you love, while also working from the comfort of your home or office, then you may be in luck!</span></p><p><span>&nbsp;</span></p><p><b>* The Company</b></p><p><span>As a company, our brand is synonymous with the highest quality of writing and great customer experience. Our online reviews are a testament to that. We are thrilled about this and continue to strive for more.</span></p><p><span>However, our focus isn't just on our clients, but also on the team that helps make this happen. We love our team and are dedicated to creating an enjoyable work environment. Our working relationship ensures we can keep their calendars full of exciting projects whilst providing them with a steady income.</span></p><p><span>In return, our writers make sure that every client receives an outstanding experience from start to finish. As a collective, we're always looking for ways to improve our process. Our commitment to quality is an aspect of our brand we're always looking to improve, and is part of the reason our company has continued to grow.</span></p><p>&nbsp;</p><p><b>* Pay Rate</b></p><p><span>Our current rate is $15 USD per 1,000 words. Our projects range from 20k up to 150k words.</span></p><p><span>Our busier writers earn $2,000+ a month writing a few hours a day around their studies and other gigs.&nbsp;</span></p><p><span>&nbsp;</span></p><p><b>* Our Requirements</b></p><p><span>We're looking for contemporary romance writers with a good skill level, who are familiar with similar paced roles. Partnered with a good understanding of contemporary romance conventions, we also need writers who understand the intricacies of contemporary romance as well.&nbsp;</span></p><p><span>&nbsp;</span></p><p><b>* Desired Bonus Subgenres/Themes</b></p><p><span>Within contemporary romance, we currently have the most demand for writers that write contemporary romance stories with any of the following additional subgenres/themes hybrids:</span></p><ul><li><span>Alpha male character</span></li><li><span>Bully romance</span></li><li><span>Billionaire romance</span></li><li><span>Paranormal</span></li></ul><p><span>&nbsp;</span></p><p><b>* Here's what's required to be part of our team</b></p><ul><li><span>You write amazing romance stories. With a lot of tension, suspense, great dialogue, and good character development and characterization.</span></li><li><span>You are US/Canada based, or exceptional writer from a different native English country.</span></li><li><span>You can work with deadlines. We typically deliver 15k words in 1 week/ week and a half.</span></li><li><span>You are knowledgeable in contemporary romance themes/tropes. You understand the readers, you understand the conventions and you can write to market.</span></li><li><span>You take pride in your writing and can consistently deliver high-quality novels. You focus on delivering what the reader and client want.</span></li><li><span>You are looking for a long-term gig and are eager &amp; available to start.</span></li><li><span>You are available throughout the day to respond to team and client messages on our platform.</span></li><li><span>You are reliable, well-spoken, open to constructive criticism and a good communicator.</span></li></ul><p><span>&nbsp;</span></p><p><b>* Few things to consider before applying</b></p><p><b>Important: </b><span>Please submit relevant samples for contemporary romance and samples for any of the bonus subgenres/themes we mentioned above. If you’re successful, we’ll hire you based on your ability to write and your understanding of contemporary romance conventions. We put a lot of emphasis on this as it's vital to understand what the reader wants.</span></p><p><span>We’ll prioritize those who can commit to at least 3-6 months of work. This is because we love to establish long-term relationships with our team, and also because our clients love to create a series of projects with the same writer.&nbsp;</span></p><p><span>Also, you must be able to sit down and write in order to meet deadlines. Good planning should make this easier. Again, availability throughout the day to respond to messages on our platform is essential.</span></p><p><span>Finally, you must fully understand what a ghostwriting position entails, and that no official credit will be given to you for the work completed.</span></p><p><span>&nbsp;</span></p><p><b>* How To Apply?</b></p><p><span>If you're still interested, we're excited to hear from you! To apply, please click the below to complete our form; this will consist of multiple-choice questions, as well as somewhere to upload your writing samples. If you're a little unsure about your level of experience, you may wish to apply for our general romance fiction writers. This is a role that requires in-depth knowledge of contemporary romance, so if you feel you’re a good fit, we'd love to consider you :)</span></p><p>&nbsp;</p><p><b>* Application Form</b></p><p><a href='https://airtable.com/shrk4Ug4RngCp1fC3' rel='nofollow'><span>https://airtable.com/shrk4Ug4RngCp1fC3</span></a></p><p><span>Please remember to provide at least 2 samples, <strong>one of which conveys intimacy/a romantic moment</strong> between the characters. Each sample must be at least 1,000 words.</span></p><p><span>We get numerous applications on a daily basis, so please bear with us and allow at least 2 weeks for us to go through your application.</span></p><p>&nbsp;</p><p><span>Best of luck!</span></p><p><span>Hotghostwriter Recruitment Department</span></p><p><span>Hotghostwriter.com</span></p><p><span>P.S. Have any questions?</span></p><p><span>Contact us: <span>[email&nbsp;protected]</span></span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cvvngvA9Q9aWABxqzk7aLg",
    "url": "https://remote.co/job/recruiter-62/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3W right",
      "DBG_TECH1:k/t/w:spring/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Hito Labs",
      "sameAs": "http://www.hitolabs.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2019 1:08:47 AM",
    "validThrough": "Sep 6, 2019 1:08:47 AM",
    "crawled": "Aug 30, 2019 2:07:21 AM",
    "content": "<h3>Recruiter at <span>Hito Labs</span></h3><div><span><i></i> Remote</span>        </div><div>                    </div><div><p>We have a highly collaborative way of working and give candid feedback frequently. We believe in autonomy and you’ll have full ownership to steer the ship. With that, you’ll also work closely with Hito Leadership to problem solve, strategize and calibrate on progress (pipeline, sourcing, etc). This open way of working isn’t for everyone but we’ve found it’s been a huge part of why we’ve been successful. Drop a line. We want to hear from you!</p><h5><strong>WHAT YOUR DAY MIGHT LOOK LIKE</strong></h5><ul><li>Project manager and point person for several clients</li><li>Build relationships with hiring managers, learn their preferences and earn their trust</li><li>Manage candidate pipeline, address bottlenecks in process and candidate flow</li><li>Iterate, change course and adapt strategies frequently</li><li>Collect and use data to calibrate across candidates</li><li>Phone screen candidates and share profiles with hiring managers</li><li>Schedule, prep and thoughtfully reject candidates</li><li>Track meeting notes and information in our systems</li><li>Build sourcing specs and review profiles</li></ul><h5><strong>WHAT WE’D LIKE TO SEE</strong></h5><ul><li>Full cycle recruiting experience (preference if you’ve worked on technical roles)</li><li>Comfort managing multiple hiring managers across several clients</li><li>Proven bias to action. Learn from past interactions and apply to the next time/client. Connect the dots and work with initiative to enact change and keep projects moving in a positive direction.</li><li>Appreciation for the candidate experience.</li><li>Nuance, finesse and emotional intelligence.</li><li>You know where to explore with candidates to discover if they are a fit. You can identify the key skills needed for a diverse set of clients.</li><li>Initiative to identify gaps and inefficiencies and create solutions.</li><li>You thrive in a remote and scrappy environment, know when to speak up, communicate frequently, and get help / support.</li></ul><h5><strong>WHAT’S IN IT FOR YOU</strong></h5><ul><li>Work with and learn from a team that values, invests and cares about you</li><li>Flexible work hours and schedules; work when you need and want to (kids are on spring break? No problem, take off that week!)</li><li>Ownership and autonomy over your work</li><li>Competitive pay</li></ul><h5><strong>ABOUT HITO LABS</strong></h5><p>We come from the in-house world of HR and leading teams. We were frustrated by the broken contingency model of recruiting. What happened to truly understanding the team needs and representing the brand to candidates? We do things differently at Hito Labs, truly partnering with hiring managers and becoming a trusted expert on their team. We focus on helping to identify their needs, finding and vetting talent, creating a candidate experience, and getting the right people hired. Our whole team is remote. We value fulfilling work that provides the flexibility to spend time with family, kids and allow us to work from anywhere. We think the future is remote work and we love being part of this movement.</p><h5><strong>HOW TO APPLY</strong></h5><p>Email matt [at] hitolabs.com and jenn [at] hitolabs.com with the subject line “Remote Recruiting – YOUR NAME” with your LinkedIn profile, resume as a PDF and a brief answer to these questions:</p><ol><li>why is a remote role is right for you</li><li>what is your process / how do you work with a client or hiring manager</li><li>how do you decide if a candidate is good enough to present</li><li>how do you manage a pipeline of candidates</li><li>how do you adjust along the way when a role isn’t getting filled</li><li>what type of technical roles you’ve worked on</li><li>salary expectations</li></ol><p>We are committed to diversity and especially encourage members of underrepresented communities to apply. We’re excited to hear from you!</p><p>Location:&nbsp;<strong>US Locations Only</strong></p></div><div>        <a href='mailto:jenn@hitolabs.com?subject=Application%20via%20Recruiter%20listing%20on%20https%3A%2F%2Fremote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dVpa4Uk1Qx6mlW-ZLZq_pQ",
    "url": "https://problogger.com/jobs/job/editor-ecommerce-hr-retail-division-remote-friendly/",
    "title": "Editor, Ecommerce/HR/Retail Division (Remote Friendly)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Fit Small Business",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2019 2:00:00 AM",
    "validThrough": "Sep 5, 2019 2:00:00 AM",
    "crawled": "Aug 29, 2019 6:24:10 PM",
    "content": "<h3>Editor, Ecommerce/HR/Retail Division (Remote Friendly)</h3><div>Company: Fit Small Business</div>Location: New York<br>Job Type: Full-time<div>  <h5>Description</h5>  <div>                    <h4><strong>Editor for Small Business Publication&nbsp;</strong></h4><h4><strong>Your role in a nutshell:</strong><span>The Content Editor will be an integral part of building one of the most comprehensive small business portals on the internet. </span></h4><ul><li><span>You will directly manage a team of 2-5 writers and work with the Division Managing Editor to manage all division-level editorial planning and execution</span></li><li><span>You will be asked to edit a variety of content in the areas of Retail, Online Business, Restaurants, and Starting a Business</span></li><li><span>You will be expected to abide by all editorial best practices while helping our writers in achieving our company mission</span></li></ul><h4><strong>Our mission:</strong><span>To deliver the best answers to people's questions.</span></h4><p><span>Recently named to the “Inc. 500” list of America’s fastest-growing private companies, Fit Small Business has more than 3 million small business owners and managers reading our content each month. We deliver well-researched, authoritative articles so these owners can make informed decisions to grow businesses that fuel the economy. Our founders have built successful businesses before, and FSB is profitable with no outside funding. Part of the team of 170+ people is in our NYC headquarters, near Grand Central. Others are distributed across the U.S., Canada, and the Philippines.</span></p><h4><strong>Does this sound like you?</strong></h4><p>As the new Content Editor you...</p><ul><li><span>will have a strong backgrounds as editors with extensive experience managing a team of writers</span></li><li><span>will have a passion for identifying and nurturing talent within your editorial team</span></li><li><span>will have a proven track record of being able to balance both individuals’ and team workflows and processes</span></li></ul><h4><strong>Qualifications for success:</strong></h4><ul><li><span>At least 2 years of experience managing teams of writers</span></li><li><span>Familiarity with managing and/or creating SEO driven, evergreen content</span></li><li><span>Familiarity and comfort with affiliate and performance marketing</span></li><li><span>You are high energy, and passionate about helping small businesses</span></li><li><span>You are comfortable working in a startup environment, where things change quickly</span></li><li><span>You have a strong work ethic.</span></li></ul><h4><strong>This position includes:</strong></h4><ul><li><span>Overseeing the publication of 2-3 high-quality articles per week for each writer, proactively resolving any holdups or delays in the pipeline</span></li><li><span>Directly manage 2-5 writers in a variety of content areas</span></li><li><span>Maintaining editorial standards and best practices among your writers</span></li><li><span>Coaching writers to improve and meet their deadlines through daily 1-on-1 video calls</span></li><li><span>Manage the execution of the content pipeline and day-to-day content management of your team</span></li><li><span>Work with the Division Managing Editor, SEO Manager, and Business Development Manager to plan out article runways for all writers</span></li><li><span>Play a central role in hiring new writers for your team</span></li></ul><h4><strong>Tools We Use:</strong></h4><p><span>WordPress, Insightly, G Suite, Slack, Trello, Guru, Zoom</span></p><p><span>*It's OK if you have not used these, just be excited to learn them.</span></p><h4><strong>What we offer you:</strong></h4><ul><li><span>Competitive salary dependent on experience</span></li><li><span>Quality health insurance subsidized by FSB</span></li><li><span>401K plan with matching (no waiting period)</span></li><li><span>Flexible Spending Accounts and Commuter Benefits</span></li><li><span>PTO</span></li><li><span>Flexibility</span></li><li><span>An open-minded, collaborative workplace, which will both challenge you and celebrate your work</span></li><li><span>The opportunity to grow</span></li><li><span>A chance to learn with and from interesting and enthusiastic colleagues</span></li></ul><p><span>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ejwDLIQ5TQOoZlwxLnd7SQ",
    "url": "http://workinstartups.com/job-board/job/83774/senior-technical-recruiter-at-wegift/",
    "title": "Senior Technical Recruiter",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:techWeightMap:{python=6, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "WeGift",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 60000,
      "maxValue": 80000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 60k - 80k /Year"
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2019 9:45:03 AM",
    "validThrough": "Sep 3, 2019 9:45:03 AM",
    "crawled": "Aug 27, 2019 11:06:30 AM",
    "content": "<section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>DESCRIPTION</h2><br /><h3>TALENT PARTNER - TECH (3 MONTH FIXED TERM CONTRACT)</h3><br /><p>At WeGift, we&rsquo;re enabling value to go further, move faster and be used more freely. We&rsquo;re completely reinventing the digital branded currency category, and creating a world where everyone has access to the global economy with no banks, borders or boundaries. To date we have built the industry&rsquo;s premier digital rewards platform and are already working with the world&rsquo;s leading brands like Amazon, Nike and Uber and corporate partners like Sky, Coinbase and Vodafone. Together we&rsquo;re helping millions of people around the world store, send and spend value like never before.</p><br /><p>We recognise that building a world class business requires a world class effort, so we make sure that each team member is appreciated for the unique value and skills they bring. We are driven by the knowledge that there are still millions of businesses and consumers (in a &pound;600 billion industry!) that we can help. If you&rsquo;re looking for an environment that will inspire you to dream bigger, work harder and make a difference every day, you&rsquo;re in the right place.</p><br /><h3><strong>THE ROLE</strong></h3><br /><p>We&rsquo;ve just closed Series A (June 2019) and we have big plans to grow our team significantly. As a result, we&rsquo;re on the hunt for a&nbsp;Senior Technical Recruiter&nbsp;with experience hiring python developers, infrastructure engineers, product managers and designers.</p><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>REQUIREMENTS</h2><br /><h3>ON A DAY-TO-DAY BASIS YOU WILL:</h3><br /><ul><br /><li>Maintain strong relationships with recruiters, hiring managers, business partners and candidates</li><br /><li>Generate a high volume and high quality pipeline of candidates under very tight timelines.</li><br /><li>Screen candidates and make a good judgement on role specific skills (such as frameworks, knowledge of Python, complex application experience etc)</li><br /><li>Create a recruitment plan with deliverables, timelines and a formal tracking process</li><br /><li>Work closely with the People team to deliver a seamless and high quality candidate experience from application through to onboarding</li><br /></ul><br /><h3>WHAT WE ARE LOOKING FOR:</h3><br /><ul><br /><li>Experience hiring in product, UX/UI, python, front and back end and infrastructure engineer</li><br /><li>Strong knowledge of sourcing methodologies and tools such as: deep-web Boolean searching, tapping through engineering/business social networks and other unique methods.</li><br /><li>Self-sufficient and able to work autonomously</li><br /><li>Experience managing and prioritizing multiple searches, projects and client relationships</li><br /><li>Creative thinker and a strong drive to implement new initiatives</li><br /><li>Great organisational, communication, negotiation and time-management skills</li><br /></ul><br /><h3>NICES TO HAVE:</h3><br /><ul><br /><li>Experience hiring in the Cambridge tech scene.</li><br /><li>Knowledge of our ATS (Workable)</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>BENEFITS</h2><br /><p><strong>Compensation</strong></p><br /><ul><br /><li>&pound;60-80k</li><br /></ul><br /><p><strong>Benefits</strong></p><br /><ul><br /><li>Participation in the Employee Options pool so you get to own a piece of WeGift.</li><br /><li>Pension scheme (3% contribution)</li><br /><li>Staff perks with WeGift brands - discounts of up to 12% on coffee, weekly groceries, holidays, the list is endless.</li><br /><li>Flexible hours and work from home when needed - yes, yes everyone says this but we do.</li><br /><li>A minimum of 25 days holiday + bank holidays (we&rsquo;re not too descriptive about holidays so if you need more time off then just ask).</li><br /><li>WeRecognise, where we shine the spotlight on exceptional employees every month who in turn get a &pound;200 award in the eGift card of their choice.</li><br /><li>Personal development budget - well actually there is no budget as we don&rsquo;t believe in putting a cap on learning new things.</li><br /><li>Generous maternity and paternity packages to make sure you get to spend time with your new bundle of joy.</li><br /><li>Cycle to work scheme - save some &pound;&pound;&pound; on buying a bike</li><br /><li>Fully licensed as a tier 2 sponsor + relocation packages to help you get settled in.</li><br /></ul><br /><p><strong>Perks</strong></p><br /><ul><br /><li>Brand new WeWork office based in Monument, London or an uber cool Central Working space in Cambridge.</li><br /><li>Catered team lunches every two weeks minimum.</li><br /><li>Monthly team socials (Escape Rooms, Karaoke - everyone gets a chance to choose what this looks like)</li><br /></ul><br /><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><br /></section>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "i4v-5q9WS9GPqmohf4ppyw",
    "url": "https://jobmote.com/job/64981/remote-edi-developer-35-hr/",
    "title": "Remote EDI Developer - $35/hr",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=5, c=2, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Vaco NAP",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 35,
      "maxValue": 35,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": "USD 35 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2019 10:07:29 PM",
    "validThrough": "Aug 28, 2019 10:07:29 PM",
    "crawled": "Aug 26, 2019 3:06:25 AM",
    "content": "<div>Our client is a supply chain software company that develops inventory tracking and CRM systems for large clients with massive warehouses such as Amazon. They are adding accounts by the week and are needing to add a new developer quickly to keep up with demand. Their main software and services are actually written in Delphi, but the manager is looking for a solid EDI programmer with some C# skills to assist in supporting their larger clients. They'd like to bring on someone who is open to learning more about Delphi and working within that langue as well. This is a 100% remote position with the exception of a training period and 1-2 meetings per year at their HQ in Minneapolis. This is a contact to hire position with an expected conversion salary aroun $70k.<ul><li>Must be knowledgeable and willing to investigate log files and SQL queries for details before passing a help desk ticket to the next level of support.</li><li>Must have some basic SQL experience in reading basic SQL select statements.</li><li>Great to have experience with distribution X12 EDI, like 850, 855, 856, 810, 846 and 867</li><li>Good work ethics are a must- Punctual, honest willing to admit when a mistake is made, and understanding how important our customers are</li><li>Must be self-motivated</li><li>Must be able to multitask</li><li>Must have basic understanding of working with a Mac.</li><li>Must have great communication skills, both written and verbal, with great attention to detail. (will be working directly with customers)</li><li>Delphi exposure/experience is a huge plus </li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "A6rLcexDTf27Ih-oSJ5A5Q",
    "url": "https://jobmote.com/job/64924/remote-sharepoint-developer-oklahoma-60-75-hr-9-month/",
    "title": "*REMOTE* SharePoint Developer- Oklahoma-$60-75/hr-9 Month",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Nigel Frank International US",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 60,
      "maxValue": 75,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": "USD 60 - 75 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2019 10:07:31 PM",
    "validThrough": "Aug 27, 2019 10:07:31 PM",
    "crawled": "Aug 25, 2019 3:06:24 AM",
    "content": "<div><b>Job Description</b><br> A HealthCare consultancy, in Oklahoma City, is looking to add a highly analytical SharePoint developer to join their team. Being that this is a remote opportunity you must be independent, have wonderful time management skills, and communicate effectively remotely.<br> The professional will have a strong IT background. You will have used all of the following, Yammer / SharePoint Online / MS FLOWS and 5+ years in .Net Technology experience. Experience with prior remote work is a plus yet not required.<br><br><b>Role &amp; Responsibilities</b><ul><li>Playing a key role in developing and maintaining new and existing products</li><li>Working extensively on SharePoint front-end user interface and user experience</li><li>Writing and maintaining code for solutions for SharePoint 2013, 2016, 2019 and SharePoint Online</li><li>Excellent troubleshooting skills.</li></ul>If this opportunity applies to you or anyone you know, please call or direct message my LinkedIn profile, or e-mail Maya at [Click Here to Email Your Resum?] .<br><br>Nigel Frank International is the global leader for Microsoft Technologies recruitment, advertising more SharePoint jobs than any other agency. We deal with both Microsoft Partners &amp; End Users throughout North America. By specializing solely in placing candidates in the Microsoft SharePoint market I have built relationships with most of the key employers in North America and have an unrivaled understanding of where the best opportunities and SharePoint jobs are. I understand the need for discretion and would welcome the opportunity to speak to any Microsoft SharePoint candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. For information on the Microsoft SharePoint market and some of the opportunities and SharePoint jobs that are available I can be contacted on . Please see for more fantastic Microsoft SharePoint opportunities!<br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lH-CGfAOQHKQ23h-4sxXzQ",
    "url": "https://weworkremotely.com/remote-jobs/surprise-hr-cold-calling-wizard-for-sales-development-representative-role",
    "title": "Surprise HR: Cold Calling wizard for Sales Development Representative Role!",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Surprise HR",
      "sameAs": "https://surprisehr.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2019 8:23:19 PM",
    "validThrough": "Aug 28, 2019 8:23:19 PM",
    "crawled": "Aug 21, 2019 8:30:23 PM",
    "content": "<h3> Cold Calling wizard for Sales Development Representative Role! </h3><div><div><strong>Overview</strong><br><br>At Surprise HR, we’re committed to hiring driven people who light up with competitive glee from our team’s guiding principle: to derive a tremendous sense of purpose from the inner quest for excellence itself, being driven from within to make anything we touch be the best it can be.<br><br>We need high level cold calling SDRs to help book meetings for our world class account executives. This mainly includes a high volume of daily outbound cold calling to engage prospects. <br><br>Your primary purpose is to effectively engage with director-, vp-, and c-level executives and decision makers in order to get them interested enough to agree to a follow up call and meeting with our account executives. <br><br>You are the &quot;first line&quot; of the Surprise HR sales offensive, directly engaging with executives and setting our sales professionals up for success. You are responsible for filling their pipeline and ensuring they are constantly taking follow up calls and meetings. We have set up an intuitive and effective outbound sales engagement infrastructure and we need you to help drive it's success, fuel it's growth, and impact the company beyond measure. If this is a challenge that you would be very excited to undertake — read on.<br><br><strong>Your Impact<br></strong><br></div><div>As our Cold Calling SDR, and a member of the Surprise HR sales team, you will be responsible for achieving weekly targets in terms of the number of scheduled discovery calls with high-quality prospects for our sales team. This will require you to:</div><ul><li>Make a required amount of daily prospect cold calls. Expect this to be in 400-500 range. We will provide an auto dialer and the majority of people won't pick up, hence the need for a high volume + cast a wide daily net.&nbsp;</li><li>Handle a substantial amount of follow up emails / communications to prospects you've spoken to on the phone.</li><li>Utilize organizational, process, and technological strategies to improve meeting conversion.</li><li>Collaborate intensively with sales team executives and be accountable for a high quality pipeline.</li></ul><div><br>You need to deliver <em>&quot;Sales Qualified Leads&quot;</em> only to our sales executives. To be clear, these prospects must exhibit the following in order to be &quot;qualified&quot;: &nbsp;<br><br><br>1) The prospect is a part of the decision making team.<br><br>2) The prospect has expressed a clear need for our platform.<br><br>3) The prospect has confirmed that the organization would be able to evaluate the program w/in the next 6 months.<br><br>4) The prospect has confirmed that the organization can afford to invest in the program.<br><br>... We will not accept any leads from you to the sales executives that do NOT fit this criteria, as it will be a waste of time for all stakeholders involved.</div><div><br><br><strong>Requirements</strong></div><ol><li>Bachelor’s Degree in Business, Communication, Marketing, or similar&nbsp;<ol><li>Demonstrated academic achievement would be ideal (e.g. honors, Dean’s list, etc.)&nbsp;</li><li>Competitive athletics/sports or other extracurriculars would be ideal&nbsp;</li></ol></li><li>1-2 years experience in a high-volume, sales development role&nbsp;<ol><li>At a high-growth technology company would be ideal (startups included)&nbsp;</li><li>Demonstrated experience handling high volume of cold calling. If you have NEVER successfully cold called, please do not apply.&nbsp;</li></ol></li><li>Is comfortable and has hands-on software experience with:&nbsp;<ol><li>Gmail/GSUITE&nbsp;</li><li>Salesforce, Ring Central and automatic dialing software&nbsp;</li></ol></li><li>Excellent communicator + quick learner&nbsp;<ol><li>Demonstrated ability to effectively articulate sales propositions over the phone and be a gifted question asker.</li><li>Ability to absorb best practices and create winning emails that convert to confirmed meetings</li><li>Amazing listener. Be able to listen to the prospects reactions/objections, address them effectively and get them interested in further sales conversations + meetings.&nbsp;</li></ol></li><li>Career-focused and wanting to work hard in an impact-heavy role</li><li>Incredible attention to detail and high level of reliability</li><li>Ability to overcome problems and create spontaneous, working solutions.</li><li>Incredibly reliable and always on time. This is critical; there's zero room or tolerance for unreliable people or people that have a tendency to go &quot;MIA&quot; during business hours. You must always be by your phone/computer and locked in + ready to make calls.</li><li>Will be expected to be making calls from 9am-5pm EST, Monday-Friday.</li><li>Must be highly effective autonomous worker. Although we have a robust communication and support system, this is a purely remote role, so you need to be able to work well on your own.&nbsp;</li><li>You must have a working computer (can be PC or Macbook) and high speed internet.&nbsp;</li><li>You must be able to start right away! Looking to hire, train and activate this role immediately.&nbsp;</li></ol><div><br></div><div><strong>What We Provide</strong></div><ol><li>Call script (flexibility within the script from your end is allowed to come across as human on the phone).</li><li>Guide / document of commonly asked questions and answers, plus other important training materials. You will be expected to study/memorize this guide, along with all essential information on our website, in sales/marketing collateral and other materials so you are ready to dispense this information to prospects on the calls at critical times.</li><li>Means to send follow up emails to prospects you've spoken with and push them along the sales funnel</li><li>Constant support and communications for any questions and problems that arise</li><li>Necessary cold calling software + a microphone</li></ol><div><br><strong>Compensation</strong></div><ol><li>Weekly base compensation paid every Friday</li><li>Opportunity to ramp up, take on more SDR tasks and start earning generous commission and bonuses. To be clear, you need to prove yourself first as a competent and effective cold caller before commission opportunities become available.&nbsp;</li></ol><div><br>If you've made it this far, please go back and read the post again. Please make sure everything written above fits within who you are, what you're looking for in the next step of your career and is a role you confidently think you can perform very well in. We are interested in serious candidates only, and not people trying to make a quick buck.&nbsp;<br><br>If you do in fact fit all the criteria and requirements, and believe you can make a huge &amp; immediate impact at Surprise HR, please apply right away and we look forward to speaking with you.</div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yLpgIOurS4Os99CGCh2vUQ",
    "url": "https://remote.co/job/people-operations-manager-3/",
    "title": "People Operations Manager",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "App Academy",
      "sameAs": "https://www.appacademy.io/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2019 5:40:51 PM",
    "validThrough": "Aug 28, 2019 5:40:51 PM",
    "crawled": "Aug 21, 2019 6:23:53 PM",
    "content": "<h3>People Operations Manager at <span>App Academy</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>REMOTE</strong></p><p><strong>FINANCE &amp; OPERATIONS – OPERATIONS</strong></p><p><strong>FULL-TIME</strong></p><p>App Academy is building world-class training programs that help students from all backgrounds transition into careers in tech. Our core offering is a 12-week immersive coding and job search program that cultivates full-stack web developers and was named one of the top coding bootcamps in the world in 2018. We have been profiled in The Wall Street Journal, Washington Post, and Bloomberg as a driving force behind the changing face of tech education in America. Our unique model — we defer tuition until our students graduate and secure jobs afterwards — aligns us with the success of our students. Join us on our mission to empower people to transform their lives.</p><p><strong>About the Role</strong></p><p>The<strong>&nbsp;People Operations Manager&nbsp;</strong>will work closely with the company’s leadership team to support App Academy’s vision, mission and values by building employment brand, delivering an outstanding employee experience, and most of all, creating and cultivating exceptional company culture.</p><p>This is a role for an experienced HR professional. You will focus on building and developing the People Operations function including employee engagement and recognition, leadership and employee development, organizational effectiveness, talent acquisition and development, safety and health, and compensation and benefits. You will develop many processes from scratch, gain buy-in, and execute in a rapidly changing environment. Success in this position requires the ability to operate in a fast-paced startup, outstanding communication skills, self-motivation, sound judgment and the ability to partner with employees across all functions and levels of the company. Your focus on engagement and your passion for employee development are critical to App Academy’s success and growth</p><p><strong>Responsibilities</strong></p><ul><li>Establish and execute company-wide performance management programs, feedback, promotion, and compensation cycles, as well as other critical people programs in partnership with people managers</li><li>Collaborate with high-performing and relatively autonomous HR &amp; Operations team currently composed of two Operations Associates, an Operations Manager and Finance Associate</li><li>Serve as a thought partner and advisor to a Leadership Team that is developing People Operations-related policies, programs and initiatives in a rapidly changing environment</li><li>Manage and constantly improve the employee experience throughout the employee lifecycle (onboarding, benefits, culture &amp; team-building, performance cycles, learning &amp; development, diversity &amp; inclusion, and offboarding) with the goal of increasing employee satisfaction and average tenure across the company</li><li>Own talent acquisition and recruiting for a growing company: hiring, onboarding, and supporting team members, playing an active role in developing expertise. Find and manage resources to hire better people faster</li><li>Own HR compliance in close partnership with legal and finance on everything from EEO-1 filings, 5550s, OSHA, Wage and Hour laws, and other federal, state and local compliance</li><li>Act as the first point of contact for HR-related concerns for employees</li><li>Own payroll administration and other operations functions and tasks as needs ebb and flow</li><li>Ultimately, the People Operations Manager ensures that the company builds a successful employment brand, outstanding employee experience, exceptional company culture, and streamlined HR processes.</li></ul><p><strong>Competencies</strong></p><ul><li>5+ years experience in HR as an HR Generalist, People Ops Manager, Business Partner, Recruiter, or equivalent</li><li>Ability to move HR programs and processes forward in a rapidly changing environment that requires gaining buy-in, optimizing systems, and moving quickly</li><li>Understanding of the needs of startups, high growth companies, and building out HR processes from scratch</li></ul><p><strong>Our Values</strong></p><ul><li>Take responsibility for student success — Everyone works together to enable student success.</li><li>Follow the numbers — Decisions should be backed by data.</li><li>Embrace a growth mindset — View challenges and failures as opportunities to improve.</li><li>Start with why — See the big picture and question the status quo. If there’s a better way of doing things we should investigate it.</li><li>Create an inclusive environment — We work together to promote empathy and respect amongst all students and staff.</li><li>Build with urgency — Our products positively change lives.</li></ul><p><strong>Benefits</strong></p><ul><li>Competitive salary</li><li>Employer-sponsored health insurance, dental, and vision plans</li><li>Unlimited paid time off</li><li><strong>Flexibility with work location. Can work from our SF or NY offices or a remote location.</strong></li><li>Generous paid family leave program</li><li>The opportunity to work with driven and talented colleagues committed to lifelong learning</li></ul><p>App Academy is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status. We believe strongly that technology companies benefit from diversity and encourage applicants from underrepresented backgrounds to apply.</p><p>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</p>        </div><div>        <a href='https://jobs.lever.co/appacademy/a1b142e0-6709-46a9-a5c3-e6ca7cb6276c' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fVkgTq7oSE-FzTrLc3-AxA",
    "url": "https://weworkremotely.com/remote-jobs/x-team-junior-technical-recruiter-north-america",
    "title": "X-Team: Junior Technical Recruiter (North America)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "X-Team",
      "sameAs": "http://x-team.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2019 4:48:40 AM",
    "validThrough": "Aug 28, 2019 4:48:40 AM",
    "crawled": "Aug 21, 2019 5:06:25 AM",
    "content": "<h3> Junior Technical Recruiter (North America) </h3><div><div><strong>About X-Team</strong></div><div><br></div><div>X-Team is an international company founded in Melbourne, Australia, that helps companies scale their development teams by providing them with extraordinary teams of developers from around the world.</div><div><br></div><div>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live.</div><div><br></div><div>We are also a community of people dedicated to unleashing our potential. We’ve fostered a unique, active lifestyle and culture around this idea that continues to attract thousands of developers to apply every day.</div><div><br></div><div>We proactively support our developers, fund their learning and growth, connect them in roaming hacker houses around the world, and give them a remote environment that motivates and inspires them on a daily basis. While other companies merely place and drop their talent, we provide unified teams of developers centered around the same beliefs, values, and lifestyle.</div><div><br></div><div>We're uniquely situated to help shape how companies grow their businesses in the digital age and aid them in being able to do so properly with the right people. We work with big brands like Riot Games, Fox Broadcasting, Kaplan Inc., Coinbase, Google, Twitter and more…</div><div><br></div><div><strong>Responsibilities as Junior Technical Recruiter (North America):</strong></div><ul><li>Perform interviews Hangouts/Zoom to evaluate developers’ communication skills and better understand if they are a fit for X-Team's open roles.</li><li>Build and actively maintain candidate shortlists for open roles and present to the team.</li><li>Collaborate with our outreach recruiters to help fill your open roles.</li><li>Scour our ATS for potential fits for your assigned roles.</li><li>Execute contracts for each new hire and ensure they are onboarded successfully by our community team.</li></ul><div><strong>About You:</strong></div><ul><li>Based in North America and native and fluent in English (both written and spoken)</li><li>At least 6 months experience as a technical recruiter or related role in the software development industry.</li><li>Ability to be a brand ambassador and represent the X-Team brand in front of potential new hires</li><li>Independent, self-motivated</li><li>Proven track record of always learning and growing</li><li>Proactive attitude and communication style</li><li>Possess a spirit of generosity</li><li>Effective negotiating skills</li><li>Familiarity with LinkedIn, StackOverflow, Github, etc.</li><li>Experience with working remotely (nice to have)</li></ul><div><strong>Perks:</strong></div><ul><li>Work from anywhere on a flexible schedule as part of a company of digital nomads.</li><li>Live and work in one of our roaming hacker houses (X-Outposts) around the world. http://x-outpost.com</li><li>Be part of the most energizing community for developers in the world by participating in our Seasons, a 3-month experience filled with challenges, rewards, games, competitions, and more, all centered around a theme that will inspire and energize you. https://youtu.be/Th80vOGFvUE</li><li>Get $2,500 per year (Unleash+) to spend on doing more of what you love and staying energized. Use it on conferences, courses, video games, photography equipment, a gym membership, adventure sports, baby/pet sitting, productivity apps, restaurants, coworking, headphones, etc. #NeverStopExploring (https://x-team.com/unleash)</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "HfA-DFGbSAq4p3ZhFUzuMw",
    "url": "http://workinstartups.com/job-board/job/83610/internal-recruiter-remote-at-fyxer/",
    "title": "Internal Recruiter (remote)",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FYXER",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 20, 2019 4:31:49 PM",
    "validThrough": "Aug 27, 2019 4:31:49 PM",
    "crawled": "Aug 20, 2019 6:23:06 PM",
    "content": "<section class=&quot;section section--header&quot;><br /><h1>Recruiter</h1><br /><p class=&quot;meta&quot;><strong class=&quot;telecommute&quot;>REMOTE</strong>&nbsp;</p><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>DESCRIPTION</h2><br /><p>FYXER is the market-leading Virtual Executive Assistant Service in the UK. We are changing how executives are supported by offering them a holistic service rather than a single employee, and we are changing how Executive Assistants work, by providing flexible, remote working which redefines their work-life balance.</p><br /><p><br />We&rsquo;ve grown from a team of 3 to 60 over the last 3 years, and plan to triple in size over the next 2 years. Recruitment is key to the success of this growth by ensuring we are able to provide exceptional Fyxers to our clients and fill some other roles too.&nbsp;<br /><br />The Recruiter will be part of the People team and directly reports to the Talent Manager.&nbsp;<br />The recruiter leads and is responsible for managing the end to end recruitment life cycle and for ensuring hiring consistently meets capacity.</p><br /><p>&nbsp;</p><br /><p><strong>Responsibilities</strong></p><br /><ul><br /><li>Deliver FYXER hires against ambitious targets (approx. 2 hires per week), to the agreed cost</li><br /><li>Lead, manage and deliver the end to end recruitment life cycle</li><br /><li>Identify, source and attract high-potential candidates</li><br /><li>Manage the talent pipeline ensuring we have a pool of candidates who are ready to fill a position.</li><br /><li>Ensure job descriptions are correct, informative and attractive</li><br /><li>Deliver and enhance the candidate application process</li><br /><li>Conduct data led interviews</li><br /><li>Manage, deliver and develop the in house trial process</li><br /><li>Identify and implement ways in which we can deliver the end recruitment life cycle effectively, continuously improving, using tech, so it remains cost effective as we scale</li><br /><li>Maintain up to date knowledge of recruitment issues and trends in the legal industry</li><br /></ul><br /><ul><br /><li>Ensure Fyxer candidates have a great experience, whether successful or not in the role</li><br /><li>Manage the careers inbox and workable</li><br /></ul><br /><ul><br /><li>Assist with FYXER&rsquo;s internal hires</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Additional Projects</strong></p><br /><ul><br /><li>Participates in the implementation of specific projects to progress the strategic goals of the organisation</li><br /><li>Supports change management processes</li><br /><li>Other ad hoc projects as decided by the CEO</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>REQUIREMENTS</h2><br /><ul><br /><li>Min 2 years experience in a recruitment role</li><br /><li>Proactive and thrives in a fast paced environment</li><br /><li>Demonstrates ownership of targets and can focus to achieve them</li><br /><li>Outstanding interpersonal skills, a highly personable, engaging approach and a strong alignment to the FYXER core values</li><br /><li>A clear thinker and confident decision-maker who is able to demonstrate sound judgement</li><br /><li>A collaborative operator, wanting to be part of a wider People Team and drive success across the whole of the company</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>BENEFITS</h2><br /><ul><br /><li>&pound;25,000 Salary + 10% performance-based bonus</li><br /><li>Working hours 8.30am-5.30pm</li><br /><li>25 days Holiday +Bank Holidays</li><br /><li>Remote working, plus approx once a month meet up</li><br /><li>Monthly 1:1&rsquo;s with your manager</li><br /><li>Regular company updates and social events, regular virtual wellbeing sessions</li><br /><li>Life Insurance and Employee Assistance Programme, including life coaching!</li><br /><li>Regular company meetings with founders, where we ask for your opinion and often act on it</li><br /></ul><br /></section>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "a_F_H9xWS-qEI0US-icVpw",
    "url": "http://workinstartups.com/job-board/job/83609/talent-manager-remote-at-fyxer/",
    "title": "Talent Manager (remote)",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FYXER",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 20, 2019 4:30:32 PM",
    "validThrough": "Aug 27, 2019 4:30:32 PM",
    "crawled": "Aug 20, 2019 6:23:06 PM",
    "content": "<section class=&quot;section section--header&quot;><br /><h1>Talent Manager</h1><br /><p class=&quot;meta&quot;><strong class=&quot;telecommute&quot;>REMOTE</strong>&nbsp;</p><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>DESCRIPTION</h2><br /><p>FYXER is the market-leading Virtual Executive Assistant Service in the UK. We are changing how executives are supported by offering them a holistic service rather than a single employee, and we are changing how Executive Assistants work, by providing flexible, remote working which redefines their work-life balance.</p><br /><p><br />We&rsquo;ve grown exponentially over the last 3 years, from a team of 3 to 60. We plan to triple in size over the next 2 years.</p><br /><p>The Talent Manager role is an exciting and challenging role that focuses on recruiting, keeping and developing an outstanding team of qualified employees. You will be part of the People team, reporting into the Head of People.</p><br /><p>Responsibilities</p><br /><p>&nbsp;</p><br /><p><strong>Recruitment</strong></p><br /><ul><br /><li>Accountable for managing the recruiter role to deliver against hiring targets (approx 2 hires a week) and the retention of new hires.</li><br /><li>Understand candidate demand and ensure the recruitment function is efficient and adaptable, able to scale up and down alongside the changing needs of the business</li><br /><li>Ensure FYXER candidates have a positive experience with us</li><br /></ul><br /><ul><br /><li>Develop a hiring strategy to ensure a pipeline of candidates and that the FYXER workforce resembles the community we operate in</li><br /><li>Management of the talent budget</li><br /></ul><br /><p><strong>Marketing</strong></p><br /><ul><br /><li>Build and maintain the FYXER community online and offline</li><br /><li>Manage FYXER&rsquo;s social media and online presence, to attract talent</li><br /><li>Ensure the marketing materials, candidate packs and website are up to date and encouraging the desired action</li><br /><li>Enhance our employer brand to help FYXER attract and retain great people.</li><br /></ul><br /><p><strong>Learning and Development</strong></p><br /><ul><br /><li>Provide data analysis to inform talent management and people development</li><br /><li>Build a high-performance culture and lead initiatives to develop talent across FYXER</li><br /></ul><br /><ul><br /><li>Design and develop career pathways for FYXER roles</li><br /><li>Curate and create training for all employees at FYXER</li><br /><li>Ensure information gathered at recruitment stage is used for the Fyxer&rsquo;s development during their career at FYXER</li><br /><li>Own the orientation content, ensuring it sets people up for success</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Additional Projects</strong></p><br /><ul><br /><li>Participates in projects to progress the strategic goals of the organisation</li><br /><li>Supports change management</li><br /><li>Other ad hoc projects as decided by the CEO</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>REQUIREMENTS</h2><br /><ul><br /><li>Previous recruitment and talent management experience</li><br /><li>Previous learning and development experience</li><br /><li>Proactive and thrives in a fast paced environment</li><br /><li>Drives projects forward with minimal supervision</li><br /><li>Enjoys working through challenges and capable of solving problems quickly</li><br /><li>A clear thinker and confident decision-maker who is able to demonstrate sound judgement</li><br /><li>Ideally, experienced in a scale up organisation</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>BENEFITS</h2><br /><ul><br /><li>&pound;40,000 Salary + 10% performance-based bonus</li><br /><li>Working hours 8.30am-5.30pm</li><br /><li>25 days Holiday + Bank Holidays</li><br /><li>Remote working plus approx once a month meet up</li><br /><li>Monthly 1:1&rsquo;s with your manager</li><br /><li>Regular company updates and social events, regular virtual wellbeing sessions</li><br /><li>Life Insurance and Employee Assistance Programme, including life coaching!</li><br /><li>Regular company meetings with founders, where we ask for your opinion and often act on it</li><br /></ul><br /></section>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "gqskScCpRTCKws9mZaFM8w",
    "url": "https://remote.co/job/open-source-engineer/",
    "title": "Open Source Engineer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:webpack/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=22}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Netlify",
      "sameAs": "https://www.netlify.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2019 6:28:30 PM",
    "validThrough": "Aug 23, 2019 6:28:30 PM",
    "crawled": "Aug 16, 2019 7:32:19 PM",
    "content": "<h3>Open Source Engineer at <span>Netlify</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p><strong>San Francisco, California, United States, Remote (Worldwide)</strong></p><p>At Netlify, we’re building a platform to empower digital designers and developers to build better, more elaborate web projects than ever before. We’re aiming to change the landscape of modern web development. As a part of that mission, we created Netlify CMS, an open source React app for managing static content via Git APIs.</p><p><strong>About the role</strong></p><p>We’re looking for an experienced Software Engineer to work across the Netlify CMS ecosystem, but especially on the core project and first-party extensions. Since Netlify CMS runs in the browser, the project is mostly frontend, but it integrates with static site generators written in many languages/frameworks, like Node, Ruby, and Go, so backend experience helps. Netlify CMS has a enthusiastic and growing community, so this role involves plenty of interaction and support, as well as some developer relations.</p><p>You like to work on the user experience side of development – you’re not necessarily a designer (although it’s awesome if you are!), but you know how to make highly usable interfaces that look and feel great. You love innovating in a new space, as we’re often problem-solving around how to do traditionally server-side operations from the browser. You should love building tools for other developers, and enjoy the balance between writing great code and shipping at startup speed. Finally, you’re okay wearing a few hats, and can maintain focus going between writing code, supporting the community, and doing a bit of developer relations.</p><p>Our core tools at Netlify are React and Redux with a dash of Webpack and a whiff of Babel, but it’s more important that you have a solid foundation as a web developer and a good sense of architecture and clean code. Frameworks and tools come and go, but the fundamentals stay the same.</p><p><strong>Our ideal candidate</strong></p><ul><li>Enjoys creating polished user experiences</li><li>Has experience working on products from top to bottom</li><li>Is comfortable designing interfaces (again, doesn’t have to be a designer per se)</li><li>Is a strong self-starter</li><li>Enjoys helping others solve problems</li><li>Has 4 or more years experience in a software engineer / developer role</li><li>Has expert knowledge of modern JavaScript</li><li>Has experience with modern build tooling</li><li>Loves a Git-centric workflow with continuous deployment and solid tooling</li><li>Is unafraid of digging into new tools, frameworks, and platforms</li><li>Thrives in an environment where experimentation and failure are celebrated</li><li>Gives and receives feedback with regard for both emotional and technical concerns</li></ul>        </div><div>        <a href='https://boards.greenhouse.io/netlify/jobs/4390459002' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "wgCkQGZGQmizMAWlM7NAlQ",
    "url": "https://jobmote.com/job/62034/career-change-we-are-hiring/",
    "title": "Career Change? We are Hiring!",
    "tags": [
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "DocCafe",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 12:21:16 PM",
    "validThrough": "Aug 18, 2019 12:21:16 PM",
    "crawled": "Aug 15, 2019 5:06:26 PM",
    "content": "<div>Internal Medicine opening in Houston, Texas. This and other physician jobs brought to you by DocCafe.com<p>As the nation's leading Accountable Care Organization (ACO) for home-based primary care, Visiting Physicians Association (VPA) provides a strong continuum of care to patients in the comfort and privacy of their homes. Our seamless array of services includes diagnostics, lab, primary care, hospice, pharmacy, care management, and community support.<br> <br> Here's what you can expect from us:<br> -Competitive base salary and aggressive quarterly incentive pay<br> -<strong>NEW Annual ACO Shared Saving BONUS</strong><br> -Sign-on Bonus<br> -Comprehensive benefit package including 401K with match<br> -Annual stipend for CME and license/association dues<br> -UpToDate for your tablet and company phone<br> -A+ rated malpractice coverage with tail coverage<br> -H1b Visa sponsorship available<br> <br> Additional benefits:<br> -<strong>No holidays, no hospital rounds</strong><br> -Minimal call responsibilities<br> -<strong>Average of 8-10 patients per day</strong><br> -More quality, face-to-face interaction with patients and families<br> -Teamed with a medical assistant and patient care coordinator<br> -Mobile diagnostic services and state of the art laboratory.<br> <br> Learn more about changes we are making in patients lives here. <br> Contact me for more information on this unique practice opportunity!<br></p>Keyphrases: internal medicine jobs, internal emergency medicine jobs, internal medicine specialist jobs, internal medicine critical care jobs, internal medicine geriatrics jobs, internal medicine pediatrics jobs, pediatric internal medicine jobs</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MaSd5vGkRVWE93hRCb64og",
    "url": "https://jobmote.com/job/61986/recruiter-healthcare-2k-5k-per-sale-f-t-p-t-remote/",
    "title": "Recruiter Healthcare $2K - $5K Per Sale F/T. P/T Remote",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Private Practice",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 12:21:15 PM",
    "validThrough": "Aug 18, 2019 12:21:15 PM",
    "crawled": "Aug 15, 2019 5:06:26 PM",
    "content": "<div>Recruiter Healthcare $2K - $5K Per Sale F/T, P/T Remote We are looking for a Recruiter with Healthcare Experience to work remotely. We are looking for an independent recruiter to work on a freelance permanent basis you can make your own hours days nights or weekends we are very flexible, we need you to source nurse practitioners physician assistants, dentists and physicians for our many openings you will be paid $2,000 to $5,000 per placement we will coordinate all the interviews, follow-up and closing with our clients in this position you will source on your own permanent full-time and permanent part-time nurse practitioners physician assistants dentists and physicians for permanent positions for our many openings we have . Now we have over 109 open positions nationwide. This is a Straight Commission Recruiter Remote/Virtual Position paying $2,000 - $5,000 Per Placement. You will Have the potential to Earn over $100,000 Per Year. You must have  at least 6 months exp. as a healthcare recruiter, but we are open to cross train other industry recruiters! Please Apply By CV/Resume or Brief Letter.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8wKt0tW0S-GSd3b8MziTqw",
    "url": "https://weworkremotely.com/remote-jobs/shogun-technical-recruiter",
    "title": "Shogun: Technical Recruiter",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Shogun",
      "sameAs": "https://getshogun.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2019 2:29:06 AM",
    "validThrough": "Aug 20, 2019 2:29:06 AM",
    "crawled": "Aug 13, 2019 3:06:23 AM",
    "content": "<h3> Technical Recruiter </h3><div><div><span>We are: Shogun, a powerful page builder platform for eCommerce stores, and we're on a mission to empower anyone to easily create high converting eCommerce pages, through a delightful product experience.</span></div><div><span><br></span></div><div><span>We were in the Winter 2018 batch of Y-Combinator, we’re backed by Initialized Capital, and we have over 10,000 active paying clients.</span></div><div><span><br></span></div><div><span>We are looking for: A Technical Recruiter to join our HR department and help us grow our engineering teams. Technical Recruiter responsibilities include sourcing, screening and providing a shortlist of qualified candidates for various technical roles. You will also network online and offline with potential candidates to promote our employer brand, reduce our time-to-hire and ensure we attract the best professionals.</span></div><div><span><br></span></div><div><span>Ultimately, you will build a strong tech talent pipeline and help hire and retain skilled employees for our engineering positions. And you'll get to talk to people all around the world!</span></div><div><span><br></span></div><div><span>Responsibilities:</span></div><div><span><br></span></div><div><span>- Write and post technical job descriptions&nbsp;</span></div><div><span>- Source potential candidates on niche platforms, like Stack Overflow and Github&nbsp;</span></div><div><span>- Parse specialized skills and qualifications to screen engineer resumes&nbsp;</span></div><div><span>- Perform pre-screening calls to analyze applicants’ abilities&nbsp;</span></div><div><span>- Interview candidates combining various methods (e.g. structured interviews, technical assessments and behavioral questions)&nbsp;</span></div><div><span>- Coordinate with CEO and CTO to forecast department goals and hiring needs&nbsp;</span></div><div><span>- Craft and send personalized recruiting emails with current job openings to passive candidates&nbsp;</span></div><div><span>- Participate in tech conferences and meetups to network with software engineers&nbsp;</span></div><div><span>- Compose job offer letters&nbsp;</span></div><div><span>- Onboard new hires&nbsp;</span></div><div><span>- Promote company’s reputation as a great place to work&nbsp;</span></div><div><span>- Conduct job and task analyses to document job duties and requirements&nbsp;</span></div><div><span>- Keep up-to-date with new technological trends and products</span></div><div><span><br></span></div><div><span>Requirements:</span></div><div><span><br></span></div><div><span>- Proven work experience as a Technical Recruiter or Recruiter&nbsp;</span></div><div><span>- Basic knowledge of frontend or backend programming languages&nbsp;</span></div><div><span>- Previous engineering experience is a major plus, but not required&nbsp;</span></div><div><span>- Hands-on experience with various interview formats (e.g. phone, Zoom and structured)</span></div><div><span>- Technical expertise with an ability to understand and explain job requirements for SWE roles&nbsp;</span></div><div><span>- Familiarity with Applicant Tracking Systems and resume databases (Greenhouse.io, Angel.co)&nbsp;</span></div><div><span>- Solid knowledge of sourcing techniques (e.g. social media recruiting and search)&nbsp;</span></div><div><span>- Excellent verbal and written communication skills&nbsp;</span></div><div><span>- Solid understanding of HR practices and labor regulations&nbsp;</span></div><div><span>- Undergraduate degree</span></div><div><span><br></span></div><div><span>We offer:</span></div><div><span><br></span></div><div><span>- Competitive salary&nbsp;</span></div><div><span>- Competitive equity&nbsp;</span></div><div><span>- Benefits (Health and PTO)&nbsp;</span></div><div><span>- A highly skilled and dedicated team that is fun to work with.&nbsp;</span></div><div><span>- Remote work – We are a fully distributed team that works from anywhere with good internet.</span></div><div><span><br></span></div><div><span>Please Note:</span></div><div><span><br></span></div><div><span>- Our team is fully distributed and global (check out our team page). We have no office. You should be comfortable with remote work.&nbsp;</span></div><div><span>- Sometimes we hire on a full time contractor basis to begin with. Team members enjoy the same opportunities for great compensation, full time positions, equity, and consideration, regardless of location.</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1rFZZjU9QqyIxi-n5KeubA",
    "url": "https://remote.co/job/talent-partner-sales/",
    "title": "Talent Partner – Sales",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "GitHub",
      "sameAs": "https://github.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 12, 2019 4:55:17 PM",
    "validThrough": "Aug 19, 2019 4:55:17 PM",
    "crawled": "Aug 12, 2019 5:07:22 PM",
    "content": "<h3>Talent Partner – Sales at <span>GitHub</span></h3><div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p><strong>Location: Remote – US</strong></p><p>GitHub is growing, and we’re looking to bring on a Contract Sales Recruiter to help find, attract, and close future Hubbers. This person serves as the Talent Partner to work closely with our hiring leaders and managers in Enterprise Sales to bring in the right type of talent at the right time to GitHub as we move into our next stage of growth.</p><p>The ideal candidate will need to be detail oriented, be able to manage multiple priorities at once, have an amazing response time/customer service mentality, and is flexible and collaborative in working with others. Those who possess strong influence, execution skills, communication skills, and a proven track record in sourcing and closing the right candidates will fit best in this role.</p><p><strong>Responsibilities:</strong></p><ul><li>Work directly with our hiring managers to establish hiring strategies for individual roles, including crafting a consistent process and plan for hiring (ie sourcing approaches, external postings, interview process, etc.)</li><li>Proactively managing internal relationships with hiring managers and leaders to meet needs and give continuous feedback on what is/is not working and makes changes as needed</li><li>Partnering closely with the coordinator and sourcer in executing hiring strategies and making adjustments as needed</li><li>Ensuring consistency in candidate process, in compliance with any EEO/OFCCP guidelines</li><li>Advocates for and delivers a fantastic candidate experience</li><li>Sourcing of quality candidates for niche or hard-to-fill roles</li></ul><p><strong>Minimum Qualifications:</strong></p><ul><li>At least three years of solid experience recruiting full-time, sales employees within an organization</li><li>Must have a minimum of two years of corporate recruiting experience</li><li>Experience working within an ATS (Applicant Tracking System)</li><li>Experience partnering with hiring managers, leaders, or other employees outside of the hiring space</li><li>Experience influencing and driving good types of change in a high growth and fast paced environment</li><li>Knowledge or understanding of employment law, AAP, EEO, diversity initiatives and immigration</li><li>Excellent written and verbal communication skills</li><li>The ability to partner and work really well with others</li><li>A high level of confidentiality and professionalism</li><li>Willingness to collaborate when approaching challenges or debate</li><li>Understanding of employment marketplace and trends to apply to recruiting strategies</li><li>The ability to be responsive within a very fast paced environment</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Versatility in doing special assignments &amp; projects as needed</li><li>The initiative to drive innovation within hiring practices</li></ul><p><strong>Who We Are:</strong></p><p>GitHub is the developer company. Over 31 million people use GitHub to build amazing things together across 100 million repositories. We make it easier for developers to be developers: to work together, to solve challenging problems, to create the world’s most important technologies. We foster a collaborative community that can come together as individuals and in teams to create the future of software and make a difference in the world.</p><p><strong>Why You Should Join:</strong></p><p>At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We’ve designed one of the coolest workspaces in San Francisco (HQ), where over half of our Hubbers work, snack, and create daily. The other half of our Hubbers work remotely in 18 countries across the globe. Here is a complete list of where we can hire!</p><p>We are also committed to keeping Hubbers healthy, motivated, focused and creative. We’ve designed our top-notch benefits program with these goals in mind. In a nutshell, we’ve built a place where we truly love working, we think you will too.</p><p>GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don’t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there’s any way we can make the interview process better for you; we’re happy to accommodate!</p><p><strong>Where We Can Hire</strong></p><p><em>Please note that benefits vary by country, if you have any questions, please don’t hesitate to ask your Talent Partner. </em></p><p>#LI-POST</p>        </div><div>        <a href='https://boards.greenhouse.io/github/jobs/1429594' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2WoSgxZtSOSmaQih8_tcdA",
    "url": "https://jobmote.com/job/59507/140k-fully-remote-sr-open-source-engineer/",
    "title": "$140k Fully Remote - Sr. Open Source Engineer -",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Vaco Technology",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 11, 2019 10:07:21 PM",
    "validThrough": "Aug 14, 2019 10:07:21 PM",
    "crawled": "Aug 12, 2019 3:06:24 AM",
    "content": "<div>* Develop high-quality software solutions by studying information needs, interfacing across the organization, investigating problem areas, studying system flow, and following the SDLC.<br> * Makes other engineers better through code reviews, thorough documentation, technical guidance, pair programming, and mentoring or serving as a Technical Lead on a project.<br> * Ability to pick up new technology quickly and adapt in a growth environment.<br> * Deliver software on-time, in scope, and make accurate estimates.<br><br>* Demonstrable, progressive experience as an SE for five or more years.<br> * Developing enterprise software. Specifically, extensive experience creating readable and testable code.<br> * Experience working in a team environment using agile sprint methodologies and tools including Jira, Git, and Slack.<br> * Proven understanding of architectural design patterns and the proper use cases associated with each.<br> * Experience integrating/consuming RESTful APIs.<br><br>* Demonstrable, progressive experience as an SE for five or more years.<br><br>? Developing enterprise software. Specifically, extensive experience creating readable and testable code.<br><br>? Experience working in a team environment using agile sprint methodologies and tools including Jira, Git, and Slack.<br><br>? Proven understanding of architectural design patterns and the proper use cases associated with each.<br><br>? Experience integrating/consuming RESTful APIs.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Lsrcj3gxTU-eMwgtO5lBRw",
    "url": "https://berlinstartupjobs.com/hr-recruiting/hr-generalist-f-m-x-finiata-gmbh/",
    "title": "HR Generalist (f/m/x) // Finiata GmbH",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Finiata",
      "sameAs": "https://www.finiata.de/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2019 11:52:17 AM",
    "validThrough": "Aug 16, 2019 11:52:17 AM",
    "crawled": "Aug 9, 2019 12:08:43 PM",
    "content": "<h3>HR Generalist (f/m/x) // Finiata</h3><div> Company:  Finiata <br> <br></div><div> Tags:</div><li>Hr management</li><li>People Management</li><li>Talent Management</li><div>  <p>Finiata is focused on helping small businesses and freelancers focus on what matters. We currently offer an automated financing solution to small businesses in Poland and Germany called Flexkapital. Our plans are to build a data-driven neobank for small companies. Our technology is one-of-a-kind so that our customers can get what they deserve. We believe in focusing on long term customer needs and providing the best solutions based on real customer feedback and data.</p>  <p>Finiata was founded in 2016 and is funded by top European investors. Our team is from all across the world with offices in Germany, Poland, and Ukraine. The team is filled with curious people who want to learn and improve while having fun.</p>  <p>We appreciate the power of diversity and are looking forward to working with you to find real solutions to real customer problems. Join a fast-growing company to help over 1 million small businesses in the next 5 years!</p>  <p><strong>Your mission:</strong></p>  <ul>   <li>Handle HR administrative tasks such as payroll and employment contracts</li>   <li>Guide the entire process around the employee lifecycle</li>   <li>Be responsible for supporting various work-related topics like health insurance or tax-related issues requested by employees</li>   <li>Implement and manage HR-focused policies and procedures that influence the company</li>   <li>Ensure On- and Offboarding of employees efficiently</li>   <li>Cooperate with Talent Acquisition to ensure top quality candidate experience</li>   <li>Guide best practices in HR Management and be responsible for driving organizational change by supporting various projects on company culture</li>  </ul>  <p><strong>Your profile:</strong></p>  <ul>   <li>2+ years of work experience in the field of HR and a bachelor’s degree or equivalent</li>   <li>Proven experience delivering a range of HR policies &amp; procedures within a fast-paced environment</li>   <li>Excellent English language skills – both verbal and written</li>   <li>Knowledge of German employment law</li>   <li>Ability to organize, prioritize and handle multiple projects</li>   <li>Enthusiasm and passion to work in an international team</li>   <li>Process-driven mindset, without losing the “human touch”</li>   <li>German or Polish language skills are a strong plus</li>  </ul>  <p><strong>Why us?</strong></p>  <ul>   <li>Get to make an impact on thousands of businesses every day</li>   <li>Be paid a competitive salary with stock options</li>   <li>Participate in a self-organized, continuously improving team</li>   <li>Work with great minds and brilliant people</li>   <li>Get insights and learnings about the financial business and technology</li>   <li>Benefit from remote work opportunities and flexible working hours</li>   <li>Benefit from an office in the center of Berlin with great perks (Free drinks and fresh fruit, Urban Sports Club membership, Pizza Thursday)</li>   <li>Have the option to take German language courses</li>   <li>Have the option to bring your best buddy to work. We love dogs!</li>   <li>Get relocation and visa support</li>  </ul> </div><a href='https://finiata-jobs.personio.de/job/132176?_pc=86541#apply' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GjwXittsQAGKofHlWpsqCw",
    "url": "https://problogger.com/jobs/job/romance-writers-wanted-now-long-term-work-hiring-now/",
    "title": "ROMANCE WRITERS WANTED NOW! | LONG-TERM WORK | HIRING NOW",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "HotGhostWriter Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 8, 2019 2:00:00 AM",
    "validThrough": "Aug 15, 2019 2:00:00 AM",
    "crawled": "Aug 8, 2019 5:07:22 AM",
    "content": "<h3>ROMANCE WRITERS WANTED NOW! | LONG-TERM WORK | HIRING NOW</h3><div>Company: HotGhostWriter Ltd.</div>Location: Work Remotely<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><strong>Are you looking to earn a consistent income writing high-quality novels in your favorite Romance subgenres and themes?</strong></p><p>Then this could well be your next paid writing gig!</p><p>&nbsp;</p><p><strong>Job Overview</strong></p><p>We are currently looking to expand our fiction team with amazing and experienced romance writers (<strong>based in the US or Canada</strong>) in all romance subgenres. We are a fast-paced, growing ghostwriting service that can provide you with <strong>consistent and exciting projects week after week!</strong> Regardless of your romance subgenre preferences, we may have a job for you.</p><p>If you are someone that takes pride in their work and is looking to <strong>earn a consistent income doing something you enjoy</strong>, working from the comfort of your home or office, and doing so alongside an excited and brilliant team, then you may just fit our criteria and land yourself an exciting new gig with us.</p><p>&nbsp;</p><p><strong>The Company</strong></p><p>As a company, our brand is synonymous with the highest quality writing and great customer experience. Our online reviews are a testament to that. We are thrilled about this and continue to strive for more.</p><p>However, our focus is not just on our clients, but also on the team that makes it happen. <strong>We love our team and focus on creating an enjoyable working process</strong> and keeping their pipelines full with great projects, bringing them a steady income.</p><p>In return, our writers ensure that every client that walks through our virtual doors receives an outstanding experience and walks away happy with their product. <strong>As a collective, we are always looking to improve</strong> and this as allowed our company to grow.</p><p>We also focus on helping our writers grow- we do this via a number of development programs we run such as our book club, mastermind groups, editor feedback, writing discussions, and more. This ensures that every writer that passes through HotGhostWriter grows and takes their craft to a higher level. Keep reading if this resonates with you.</p><p>&nbsp;</p><p><strong>Pay Rate</strong></p><p>Our current rate is $15 USD per 1,000 words. Our projects range from 20k up to 150k words.</p><p>Some of our busier writers are earning<strong> $2,000+ a month</strong> writing a few hours a day around their studies or other gigs. We offer consistent work without having to apply for jobs, work comes to you. Plus, you'll love the team and process!</p><p>&nbsp;</p><p><strong>Our Requirements</strong></p><p>We are looking for romance writers with at least a good basic skill level and a good understanding of the conventions of the romance subgenre as a whole, and of your preferred romance themes. Here's what's required to be part of our team:</p><p>- You write amazing romance stories. With a lot of tension, suspense, great dialogue, and good character development and characterization.<br>- You are US/CAN based, or US/CAN citizen living outside the country.<br>- You can work with deadlines. We typically deliver 15k words in 1 week/ week and a half.<br>- You are knowledgeable in your preferred romance subgenres, themes/tropes. You understand the readers, you understand basic conventions that make a subgenre/theme/etc and you can write to market.<br>- You take pride in your writing and can consistently deliver high-quality novels. You focus on delivering what the reader and client want.<br>- You are looking for a long-term gig and are eager &amp; available to start.<br>- You are available throughout the day to respond to team and client messages on our platform.<br>- You are reliable, well-spoken, open to constructive criticism and a good communicator.</p><p>&nbsp;</p><p><strong>Few things to consider before applying</strong></p><p><strong>Important</strong>: When applying you will be asked to select up to 3 of your best subgenres. Choose the subgenres you most enjoy and know most about (conventions, typical characters, etc). <span>Please submit a sample for each subgenre you select</span>. If you are successful, we will hire you for 1, 2 or all 3 of your chosen subgenres based on your ability to write and your understanding of each subgenre's conventions. We put a lot of emphasis on this as it's vital to understand what the reader wants.</p><p>We will also prioritize you that can commit for at least 3-6 months. This is because we love to establish long-term relationships with our team and also because our clients love to create a series of projects with the same writer. Once expectations are clear with a client, you can expect awesome projects to keep flowing your way. This requires a basic commitment of 3 months or so.</p><p>Also, you must be able to sit down and write in order to meet deadlines. Good planning should make this easier. Again, availability throughout the day to respond to messages on our platform is essential.</p><p>Finally, you must be okay with not getting official credit for your writing as this is a ghostwriting position.</p><p>&nbsp;</p><p><strong>How To Apply?</strong></p><p>So if read what the position entails and you're excited to test your luck and apply? That's amazing and we look forward to getting your application. <strong>To apply, click the link below</strong> to complete our form where you will have to answer a number of questions and also provide your writing samples. If you're a little reluctant based on your professional experience, don't let that stop you. As long as you have some samples and you understand romance, we'd love to consider you.</p><p>&nbsp;</p><p><strong>Application Form</strong></p><p><a href='https://airtable.com/shrk4Ug4RngCp1fC3' rel='nofollow'>https://airtable.com/shrk4Ug4RngCp1fC3</a></p><p>Please remember to provide at least 1 sample per subgenre you select (Choose no more than 3 subgenres). Each sample must be at least 1,000 words.</p><p>We do get numerous applications on a daily basis, so do bear with us and allow us at least 2 weeks to get to your application.</p><p>&nbsp;</p><p><strong>Best of luck!</strong></p><p>Hotghostwriter Recruitment Department</p><p>Hotghostwriter.com</p><p>P.S. Have any questions?</p><p>Contact us: <span>[email&nbsp;protected]</span></p><p>(Please do not attempt to apply via email, you will be referred to the application form above)</p><div><div></div><div><div><ul><li><ul>&lt;!-- it is important not to have any white space between     <li> as it is styles as inline block --&gt;</li></ul></li></ul><ul><li><span>Style</span></li><li><span>Grammar</span></li><li><span>Overused</span></li><li><span>Clichés</span></li><li><span>Sticky</span></li><li><span>Diction</span></li><li><span>Repeats</span></li><li><span>Combo</span></li><li><span>Length</span></li><li><span>Pronoun</span></li><li><span>Alliteration</span></li><li><span>Homonym</span></li><li><span>Transition</span></li><li><span>Thesaurus</span></li><li><span>House</span></li><li><span>Plagiarism</span></li></ul><ul><p></p><li><span>More<i></i></span></li><li><span>Settings</span></li></ul></div><div><ul><li><span>Writing Style Check</span></li><li><span>Grammar Check</span></li><li><span>Overused Words Check</span></li><li><span>Cliches and Redundancies</span></li><li><span>Sticky Sentences Check</span></li><li><span>Diction and Vague Words</span></li><li><span>Repeats Check</span></li><li><span>Combo Check</span></li><li><span>Sentence Length Check</span></li><li><span>Pronoun Report</span></li><li><span>Alliteration Report</span></li><li><span>Homonym Report</span></li><li><span>Transition Report</span></li><li><span>Thesaurus Report</span></li><li><span>House Style Check</span></li><li><span>Plagiarism Report</span></li></ul></div></div><div><div><span>open options</span></div></div><div>The last attempt to connect to our servers failed. Please check your internet connection.</div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dyMKPpl0SKO96BRpnBIUhQ",
    "url": "http://workinstartups.com/job-board/job/83157/hr-intern-at-eatfirst/",
    "title": "HR Intern",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "EatFirst",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2019 2:17:19 PM",
    "validThrough": "Aug 14, 2019 2:17:19 PM",
    "crawled": "Aug 7, 2019 4:06:31 PM",
    "content": "<div id=&quot;job-description&quot; class=&quot;border-bottom&quot;><strong>Who are we?<br /></strong>We are EatFirst, an online food brand designed for delivery. Our team of Michelin-star trained chefs produces small batch, handcrafted meals using unique ingredients to make you feel good. We do not use any colourings, flavourings, additives or preservatives and we use only eco-friendly plastic-free packaging. We are based in London and deliver food to individual and corporate customers all across the UK. <br /><br /><strong>What do we offer?</strong><br />You will become part of a star team of international, experienced foodies, with the opportunity to learn from the best talent in hospitality. EatFirst has a fast paced, dynamic work environment where creativity and talent is encouraged and nurtured. <br />Free lunch every day and free coffee and tea in our office.<br /><br /><strong>What does the role involve?</strong><br />You will be actively involved in the company&rsquo;s recruitment process and all things HR-related. This is the perfect opportunity to get in-depth, hands-on experience in start-up HR. The role offers wide exposure to all departments within EatFirst as well as dealing with recruiters and service providers. <br />Tasks include recruiting talent for different positions within EatFirst (above all for our production kitchen), defining and improving processes from profile scanning to onboarding to performance reviews, maintaining employment contracts, assisting with the payroll process. <br /><br /><strong>Requirements<br /></strong>We are looking for a motivated individual to join the team who is looking to pursue a career in HR with some pre-existing experience or knowledge required. In terms of personal attributes, the role requires someone who is intelligent, capable of acquiring new skills and passionate about their work. In addition, should have excellent interpersonal skills and a very good level of English. <br />At the end of the Internship this role could evolve into a full-time position. <br />Applications from both graduates and undergraduates will be considered.<br /><br />Interested? Contact us!</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CfGNs3EhRIGSA1FzMs0wSg",
    "url": "https://weworkremotely.com/remote-jobs/tutuka-people-pro",
    "title": "Tutuka: People Pro",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Tutuka",
      "sameAs": "https://tutuka.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2019 1:32:45 PM",
    "validThrough": "Aug 14, 2019 1:32:45 PM",
    "crawled": "Aug 7, 2019 2:06:24 PM",
    "content": "<h3> People Pro </h3><div><div><i>Are you looking for the freedom to define an amazing remote people career?</i></div><div><br></div><div>The People team at Tutuka is actively shaping the future of the company and communities we work with. The team is looking for two dynamic, creative, and thoughtful individuals to contribute to our global success. Both roles report into the Head of People.</div><div><br></div><div><b>1)&nbsp; &nbsp; &nbsp;Development &amp; Success (remote)</b></div><div><br></div><div><i>How you will make an impact:</i> You will help lead the operational engine, helping the Head of People anticipate people needs, innovate processes and scale across the organisation.</div><div><br></div><div>This role will be intimately involved with the learning and development of the people, requiring you to drive projects and dialogue around development, goals, and meaningful feedback solutions. You will also be required to successfully develop and implement people projects.</div><div><br></div><div><b>2)&nbsp; &nbsp; &nbsp;Talent &amp; Culture (remote)</b></div><div><br></div><div><i>How you will make an impact:</i> You will have the responsibility to help create and deliver a seamless and positive employee experience across all dimensions. As you help grow the team, you will lead and promote a high performing, innovative, and supportive culture that aligns with our history as well as its progressive vision of an agile, remote future.</div><div><br></div><div>You thrive in an international team and have great experience with the various aspects of compensation &amp; bench-marking, recruiting, contracting etc. across various markets – the more the merrier.&nbsp;</div><div><br></div><div>Both roles provide the opportunity to travel and spend time with our teams in Johannesburg, Dubai and Bangkok <i>(up to 15% of your time)</i>.</div><div><br></div><div><b>What we look for:</b></div><ul><li><i>Action-oriented: </i>You know how to get things done. You operate with urgency and efficiency. You know how to identify problems and love to develop plans to deliver and solve them.</li><li><i>People champion:</i> You love working with people from around the world and know how to excite them. You understand that people are the core of who we are and place a premium on customer service.</li><li><i>Team player:</i> You love collaborating and sharing ideas. You like learning from your peers. You’re ready to roll up your sleeves and support as needed.</li><li><i>Detail-oriented: </i>You have an eye for detail and sweat the small stuff.</li><li><i>Clear communicator: </i>You communicate clearly and concisely. You’re great at getting and giving respectful and productive feedback.</li><li><i>Professional: </i>You are mature and reliable. You strive to learn and grow your skills.</li><li><i>Highly organised:</i> You know how to manage multiple projects and prioritise appropriately. You create clear and logical systems and processes to support your work.</li><li><i>Passionate:</i> You care about financial inclusion. You want to work remotely and feel inspired every day. You want to change the world.</li><li><i>Enjoy:</i> The work we do is serious but that doesn’t mean we don’t know how to have fun. We know how to have a good time and you should too.</li></ul><div><br></div><div><b>Your Education &amp; Experience:</b></div><ul><li>Bachelor’s degree or higher</li><li>Fluency in English and one other language is required</li><li>5 years of experience in (fin)tech start-up, operational management and/or people operations environment.</li></ul><div><br></div><div><b>Additional Information</b><br></div><div>If you have already made a move into a non-traditional people role and you are ready for the challenge of one of these remote roles, then please get in touch and apply.</div><div><br></div><div><i>We focus on building strong, diverse teams built from different backgrounds, experiences and identities.</i></div><div><br></div><div><b>(Please note that we will start the selection process for these roles after the summer holidays in the beginning of September)&nbsp;</b></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "E3Ct2WS4TzOOV8woHkm69w",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-hr-assistant",
    "title": "OnTheGoSystems: HR Assistant",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "OnTheGoSystems",
      "sameAs": "https://www.onthegosystems.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2019 11:55:28 PM",
    "validThrough": "Aug 13, 2019 11:55:28 PM",
    "crawled": "Aug 7, 2019 12:06:23 AM",
    "content": "<h3> HR Assistant </h3><div><div><span></span></div><div><span>Are you into HR, want a stable job and be part of an amazing multicultural remote-work experience?</span></div><div><br></div><div><span>OnTheGoSystems is looking for an HR assistant that’s a good team player, passionate about their work and has excellent organization skills</span></div><div><br></div><div><span>We need help with all our HR activities, related to posting job ads, help with interviews and recruiting-related admin tasks, maintaining our employee database, stats, helping with processes and documentation, among other tasks.&nbsp;</span></div><div><br></div><div><span>Here you will also have the chance to be creative. We are open to new ideas that will allow us to keep improving our daily work with our most valuable asset, our people.&nbsp;</span></div><div><br></div><div><span>You can be an important part of our company’s success. Ultimately, you’ll help our HR Manager ensure our HR department is organized and operates smoothly to attract, hire and retain our employees.</span></div><div><br></div><div><span>The HR assistant will help with the following:</span></div><div><br></div><ul><li><span>Assist with day to day operations of the HR functions and duties</span><br><br></li><li><span>Provide administrative support where needed</span><br><br></li><li><span>Compile and update employee records, and help track and keep records of performance, among others</span><br><br></li><li><span>Process documentation and prepare reports relating to personnel activities (staffing, recruitment, training, performance evaluations etc)</span><br><br></li><li><span>Coordinate HR projects (meetings, training, surveys etc)&nbsp;</span><br><br></li><li><span>Assist with recruitment and onboarding process&nbsp; (Posting job openings, gathering information on new applicants, assisting in screening and rating of applicants, testing the skills and abilities of potential candidates, running background checks on potential candidates as well as verifying their references, etc)</span><br><br></li><li><span>Help with travelling arrangements</span><br></li></ul><div><br></div><div><h6><span>Benefits</span></h6><br></div><div><span>Working with OnTheGoSystems comes with a number of benefits:</span></div><div><br></div><ul><li><span>Work in a global team, fully remote</span><br><br></li><li><span>Work from any place you like, as long as you have a good Internet connection&nbsp;</span><br><br></li><li><span>Face challenges together and collaborate with international team members</span><br><br></li><li><span>Be part of a flat organization, where your voice is always heard</span><br><br></li><li><span>Get a steady income and other benefits such as paid vacations, scholarships, and more</span><br></li></ul><div><br></div><div><span>If you meet these requirements below, we’d like to meet you:</span></div><div><br></div><ul><li><span>Proven experience as an HR assistant, staff assistant or relevant human resources/administrative position.</span><br><br></li><li><span>BSc degree in Human Resources or relevant field&nbsp;</span><br><br></li><li><span>Familiarity with HR software&nbsp;</span><br><br></li><li><span>Excellent organizational skills</span><br><br></li><li><span>Experience organizing company retreats</span><br><br></li><li><span>Strong verbal and written English communication skills (If you’re also a good writer, let us know)</span><br><br></li><li><span>Demonstrated ability to work independently, to follow through on instructions, and meet deadlines.</span><br><br></li><li><span>Be an independent, reliable and resourceful person&nbsp;</span><br><br></li></ul><div>&nbsp;<br></div><div><span>Our preferred time zone is European, or similar. Also, </span><span>experience working with distributed teams is an advantage.</span><br></div><div>&nbsp;</div><div><br></div><div><span>If you think you’re the right fit for us, please apply.</span></div><div></div><div></div><div><br></div><div>&nbsp;</div><div><br></div><div>&nbsp;</div><div></div><div><br></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3zHJ7miaQv2Ql8IO5xeIng",
    "url": "https://remote.co/job/talent-manager/",
    "title": "Talent Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot W OR(career,first)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Grafana Labs",
      "sameAs": "https://grafana.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 4, 2019 6:15:07 PM",
    "validThrough": "Aug 11, 2019 6:15:07 PM",
    "crawled": "Aug 4, 2019 6:23:52 PM",
    "content": "<h3>Talent Manager at <span>Grafana Labs</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>REMOTE</strong>&nbsp;· United States · G&amp;A</p><p><strong>DESCRIPTION</strong></p><p><strong>Location</strong>:&nbsp;<strong>East coast USA preferred/other locations considered</strong></p><p>We are looking for a Talent Manager to join our People Ops team to take responsibility for delivering our ambitious global headcount plans. The People Ops mission is to ensure we deliver a highly skilled, committed, successful and happy team and this role will play an integral part in the delivery of that work as we grow. One of our core values is ‘built better together’ and you will apply this to the growth of our team helping to ensure we maintain our strong culture and values as we grow.</p><p>This is a fantastic opportunity to help an ambitious tech startup meet our growth plans whilst also getting to work on some really interesting projects. You will take responsibility for the full lifecycle of both technical and non-technical international recruitment. In addition you will have the opportunity to partner with the VP People Ops to contribute to the delivery of projects focussed on recruitment processes, candidate experience, diversity and internal stakeholder recruitment training programs.</p><p>If you are an experienced recruiter, ready for a new challenge and enjoy making an impact, we’d love to hear from you!</p><p><strong>REQUIREMENTS</strong></p><ul><li>You will work alongside our Leadership team to deeply understand hiring requirements, hiring challenges, organisational structure and individual team dynamics</li><li>You will be responsible for the end to end recruitment process covering the entire candidate experience from sourcing and headhunting through to offer stage</li><li>You will be confident engaging passive candidates and utilising the team’s networks and technical experience to engage with candidates appropriately. You will be tasked with direct sourcing and keeping agency spend to a minimum.</li><li>You will be required to work with a mix of both technical and commercial international teams</li><li>You will have experience putting together role specific hiring and sourcing strategies using a broad range of channels including LinkedIn, Stack Overflow, Github, job boards, networking etc</li><li>You will quickly be able to understand our key requirements and good cultural fit and help to screen candidates based on your strong understanding of what we value and our company culture</li><li>You will help to champion diversity through our recruitment and work with the VP People Ops to build out a diversity hiring strategy for 2019 and beyond</li><li>You will work closely with the VP People Ops to review and enhance our recruitment process and to develop and deliver a recruitment best practice training program to the internal team</li></ul><p><strong>What would make you a good fit for this role?</strong></p><p>We’re a startup so your job duties will be varied and complex and will require strong judgement, collaboration and leadership. Initially this will be a standalone role and you will need to have the experience, drive and energy to hit the ground running working proactively and independently to deliver a first class recruitment service to the business and to candidates.</p><p>To be successful in this role you will have experience working in a dynamic, fast-paced global start-up. You will need excellent sourcing/research skills and have an ability to discover candidates for hard to fill requisitions through creative sourcing. It is essential that you have experience recruiting internationally in both Europe and the US.</p><p>You will have strong people and communication skills and will be adept at interacting with a variety of people at different levels and from different cultures and backgrounds.</p><p><strong>BENEFITS</strong></p><p>At our core Grafana Labs is an open company. We believe that open source is the superior way to build and deliver software. We also believe in being open and transparent with our employees. We believe that transparency breeds trust and that trust is the foundation of great teamwork. We actively seek to break down silos, empower employees with information and allow people to “see the whole picture”. This transparency extends to our strategy, our financials, our successes and failures. We empower our team to make their own decisions and trust that they will try to do the right thing.</p><p>We are a remote first team. Our three founders are on three different continents and our team of 70+ global employees are based in 15+ different countries. Hiring remotely unlocks the broadest, most diverse, most talented pool of potential employees. It also means that we have built our culture around a flexible and autonomous work environment based on trust.</p><p><strong>Equal Opportunity Employer</strong></p><p>At Grafana Labs we’re building a company where a diverse mix of talented people want to come, to stay, and to do their best work. We know that our company runs on the hard work and the dedication of our passionate and creative employees. We will recruit, train, compensate and promote regardless of race, religion, colour, national origin, gender, disability, age, veteran status and all the other fascinating characteristics that make us different and unique. We believe that equality and diversity builds a strong organisation and we’re working hard to make sure that’s the foundation of our organisation as we grow.</p>        </div><div>        <a href='https://grafana-labs.workable.com/j/54130CA504?viewed=true' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FXIk7maxRDS6M6Kpj0zJhg",
    "url": "https://news.ycombinator.com/item?id=20587634",
    "title": "Muck Rack is looking for talented people to join our fast-growing New York (but remote-friendly ...",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "DBG_TECH1:k/t/w:django/python/16",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:webpack/frontend/5",
      "DBG_TECH1:techWeightMap:{python=18, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 9:53:20 PM",
    "validThrough": "Aug 8, 2019 9:53:20 PM",
    "crawled": "Aug 1, 2019 10:32:05 PM",
    "content": "Muck Rack is looking for talented people to join our fast-growing New York (but remote-friendly) SaaS startup. Our mission is to make journalists, PR pros and marketers more successful. Muck Rack offers tools that help media professionals find and contact the most relevant journalists for their stories, and monitor how their stories perform.<p>Muck Rack offers a very flexible remote working policy. We strongly believe if you let responsible people handle their own work on their own priorities and timeline, not only will you produce better work, but you will be a happier employee!</p><p>We are devoted to our wonderful customers, transparent with one another, take ownership over our work, and remain resilient when presented with challenges.</p><p>We offer eligible employees access to quality health insurance and 401(k) plans, your choice of equipment, a generous vacation policy, personal development, and more.</p><p>Our tech stack includes Python, Django, Celery, Redis, Elasticsearch, Nginx, Gunicorn, ES6 and Webpack on the front-end, Varnish, and Ansible. If you enjoy Django, scraping, textual analysis, information extraction, and _data_, this is your place. Our engineers are not siloed to any particular part of the application - everyone contributes everywhere. Bonus points if you are familiar with browser performance profiling, search relevancy tuning, security, DevOps interest and experience, or have a demonstrated empathy for design.</p><p>We would love to talk to you! Here's what we're hiring for now:</p><p>- Senior Software Engineer <a href='https://boards.greenhouse.io/muckrack/jobs/4250275002' rel='nofollow'>https://boards.greenhouse.io/muckrack/jobs/4250275002</a>- Front End Developer <a href='https://boards.greenhouse.io/muckrack/jobs/4376802002' rel='nofollow'>https://boards.greenhouse.io/muckrack/jobs/4376802002</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "IQvpwSYkQtGHJuh_Lzio3A",
    "url": "https://remote.co/job/recruiter-60/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``remot W OR(contractor,assist,ok)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Side Real Estate",
      "sameAs": "https://www.sideinc.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 31, 2019 5:50:26 PM",
    "validThrough": "Aug 7, 2019 5:50:26 PM",
    "crawled": "Jul 31, 2019 6:26:48 PM",
    "content": "<h3>Recruiter at <span>Side Real Estate</span></h3><div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p><strong>GENERAL AREA</strong></p><p><strong>PEOPLE OPERATIONS – TALENT</strong></p><p><strong>1099 (CONTRACT)</strong></p><p><strong>ABOUT SIDE</strong></p><p>At Side, we believe everyone should own their path.</p><p>As the first company to design an end to end modern brokerage solution, Side is re-imagining the real estate industry from the ground up by combining innovative technology, creative branding expertise, and an experienced leadership team with a mission to empower the world’s leading real estate professionals to own their brand and better serve home buyers and sellers.</p><p>In the past two years, with an exceptional team of inSiders, we’ve processed $1B in transactions and raised over $30M in funding from top tier investors like Matrix Partners, Trinity Ventures, and 8VC.</p><p>At Side, you’ll have the opportunity to collaborate and innovate your way to success. Becoming an inSider means that you’ll be empowering business leaders to become business owners, all while forging your own path with like-minded entrepreneurs. Join us at Side and own your career, your impact, and your life.</p><p><strong>ABOUT THE ROLE</strong></p><p>We’re looking for a full-cycle (<strong>remote contractor</strong>) Recruiter to own a mixture of business and technical hiring. As a full-cycle recruiter, you’ll be responsible for developing and implementing a candidate recruitment strategy. This includes advertising and passive candidate sourcing, acting as the gatekeeper to our culture and screening candidates thoroughly before passing them onto the next round, and creating a superb candidate experience that promotes our employer brand. You’ll own the recruitment of 8-10 roles at a time and manage the relationships with each candidate.</p><p><strong>WHAT YOU’LL BE DOING</strong></p><ul><li>Lead intake discussions with hiring managers, gathering the role requirements and supporting hiring managers in defining the interview process</li><li>Develop and implement advertising strategies to attract candidates to each role that you own</li><li>Source potential candidates on major and niche platforms by crafting personalized recruiting emails</li><li>Phone screen candidates and assess for cultural and role fit, make recommendations to hiring managers on which candidates to move forward with</li><li>Own candidate relationships and maintain a high close rate per requisition</li></ul><p><strong>WHAT WOULD MAKE YOU A STRONG FIT FOR THE ROLE?</strong></p><ul><li>5+ years of experience in the recruiting industry with at least 3 years as a full-cycle recruiter</li><li>Hands-on experience recruiting for Engineering talent (e.g. Tech Leads and Software Engineers)</li><li>Strong writing skills and can succinctly develop a pitch</li><li>Critical eye for identifying top talent for specific roles</li><li>Strong prioritization skills</li><li>Successful track record of achieving targets</li><li>Candidate-first mentality</li><li>Familiarity with Applicant Tracking Systems (specifically Lever)</li><li>Self-starter with an incredible work ethic</li></ul><p><strong>COMPENSATION/PERKS</strong></p><ul><li>Competitive salary</li><li>Stock options</li><li>Best-in-class benefits, including 100% healthcare coverage (medical, vision and dental)</li><li>Flexible PTO</li><li>Learning and development credit</li><li>Pet friendly environment</li></ul><p><em>Side is committed to creating a diverse environment and is an equal opportunity employer. Side does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, parental status, veteran status, or disability status.</em></p><p><em>Side uses the E-Verify employment verification program.</em></p><p><em>Our stewardship of the data of many of our customers means that a background and DRE license check is required to join Side. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance. </em></p>        </div><div>        <a href='https://jobs.lever.co/sideinc/f3c8ef88-0ea2-440e-b0ad-9a90ba62ea7f' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "gz8EnsI5QI2wgQcu2d29QQ",
    "url": "https://remote.co/job/recruiting-coordinator-8/",
    "title": "Recruiting Coordinator",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Gatsby",
      "sameAs": "https://www.gatsbyjs.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 29, 2019 6:58:59 PM",
    "validThrough": "Aug 5, 2019 6:58:59 PM",
    "crawled": "Jul 29, 2019 7:31:13 PM",
    "content": "<h3>Recruiting Coordinator at <span>Gatsby</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span> | <span> Freelance </span> | <span> Part-time </span></div><div>            <ul><li><strong>Remote</strong></li><li><strong>Contracted</strong></li><li><strong>Human Resources</strong></li><li><strong>Entry Level</strong></li></ul><p>Join us on our mission to help our customers create blazing fast, compelling websites and apps. We are looking for an organized, personable, and quick-learner to help keep the recruiting process moving.</p><p><strong>Details of the Role</strong></p><ul><li><strong>Type of Work: Part-time contract (10-15 hours/week). Potential for contract-to-hire.</strong></li><li><strong>Location: Remote (US preferred)</strong></li></ul><p><strong>What You Will Do</strong></p><ul><li>Act as a point of contact for candidates</li><li>Conduct resumé and phone screens</li><li>Schedule interviews</li><li>Collect candidate feedback</li><li>Ensure that all applicants are moving through the process in a timely manner</li><li>Communicate and plan with hiring managers</li></ul><p><strong>Traits We Are Seeking</strong></p><ul><li>Personable and kind to others</li><li>High attention to detail</li><li>Takes initiative – does things before asked</li><li>Can write well-crafted emails</li><li>Able to learn new systems quickly</li><li>Works well as part of a team</li><li>Understands that diversity is an asset</li></ul><p><strong>About Us</strong></p><p>GatsbyJS was born in May 2015 as a simple way to build a website with React. Over the last three years, tens of thousands of developers have used Gatsby to build websites from blogs and portfolio pages to company homepages and e-commerce applications.</p><p>In early 2018, GatsbyJS core contributors, including creator &amp; lead maintainer Kyle Mathews, formed Gatsby Inc to help website development teams build CMS-powered websites with modern tooling.</p><p>Our core values include transparency (we work in public most of the time); creating a safe, high-trust team; building incredible developer experiences; fostering diverse perspectives; maintaining a healthy working environment; and helping deliver web experiences that feel amazing to use on every device and connection type.</p>        </div><div>        <a href='https://gatsbyjs.applytojob.com/apply/EXG4EqnZ27/Recruiting-Coordinator' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "NnFaEsbsQSOkrtIE8h-qog",
    "url": "https://remote.co/job/technical-sourcing-specialist-2/",
    "title": "Technical Sourcing Specialist",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:facet/nodejs/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=8, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Randstad Sourceright",
      "sameAs": "https://www.randstadsourceright.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 25, 2019 5:40:03 PM",
    "validThrough": "Aug 1, 2019 5:40:03 PM",
    "crawled": "Jul 25, 2019 6:25:43 PM",
    "content": "<h3>Technical Sourcing Specialist at <span>Randstad Sourceright</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> Freelance </span>\n</div>\n<div> \n <p><strong>Location: United States, US</strong></p>\n <p><strong>Job Number </strong>30059</p>\n <p><strong>United States, US</strong></p>\n <p><strong>Contract</strong></p>\n <p><strong>About Randstad Sourceright</strong></p>\n <p>Randstad Sourceright is a global talent leader, providing solutions and expertise that help companies position for growth, execute on strategy, and improve business agility. Sourceright’s experience encompasses all facets of the talent acquisition of permanent employees and the contingent and contractor workforce. Key offerings include Managed Services Provider (MSP) programs, Recruitment Process Outsourcing (RPO) and Blended Workforce Solutions.</p>\n <p>The<strong>&nbsp;Technical Sourcing Specialist&nbsp;</strong>will promote sourcing and recruitment excellence for Randstad Sourceright (RSR) client recruitment initiatives. Successful candidates will be resourceful, consultative, process driven, and a relationship builder. They will have industry knowledge as well as expert level compliance knowledge in order to reach the best possible outcome for the candidate and our client partner.</p>\n <p><strong>Responsibilities include:</strong></p>\n <ul>\n  <li>Sourcing efforts for multiple disciplines</li>\n  <li>Consultative approach to candidate engagement and retention</li>\n  <li>Candidate, client &amp; Recruiter relationship building</li>\n  <li>Participates in Intake calls/requisition reviews</li>\n  <li>Ability to understand a variety of job descriptions as well as strong industry knowledge</li>\n  <li>Creation and marketing of compelling job postings</li>\n  <li>Candidate assessment and selection techniques</li>\n  <li>Collaborate on sourcing framework</li>\n  <li>Executes various sourcing strategies</li>\n </ul>\n <p><strong>Essential Competencies</strong></p>\n <p>We are looking for a creative thinkers and innovators with a drive to promote the discovery and development of highly effective sourcing processes and business practices.</p>\n <p><strong>Basic Qualifications</strong></p>\n <ul>\n  <li>5-7 years of experience in a talent acquisition (Information Technology – specifically in Data Science and SWE)</li>\n  <li>3 years of experience in a Sourcing capacity</li>\n  <li><strong>High School Diploma or GED</strong></li>\n </ul>\n <p><strong>Additional Qualifications</strong></p>\n <ul>\n  <li><strong>College degree strongly preferred</strong></li>\n  <li>Strong grasp of candidate source and channel analytics.</li>\n  <li>Strong grasp of diversity recruitment concepts. Understanding of SEO, keywords, and social listening tools.</li>\n  <li>Ability to connect and communicate with individuals at all levels of the organization, from entry-level to executives.</li>\n </ul>\n <p>Randstad Sourceright is an Equal Opportunity Employer and makes all employment decisions based solely on the basis of qualifications and without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, disability, protected veteran status or any other legally protected group status.</p> \n</div>\n<div> \n <a href='https://randstadus.gr8people.com/index.gp?method=cappportal.showJob&amp;syslayoutid=122&amp;opportunityid=30059' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "QCLWnAVORTWseIzedRnmnQ",
    "url": "https://remote.co/job/senior-talent-sourcer-recruiter/",
    "title": "Senior Talent Sourcer – Recruiter",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GeoLogics",
      "sameAs": "https://www.geologics.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 23, 2019 5:05:52 PM",
    "validThrough": "Jul 30, 2019 5:05:52 PM",
    "crawled": "Jul 23, 2019 5:09:19 PM",
    "content": "<h3>Senior Talent Sourcer – Recruiter at <span>GeoLogics</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p>We have an opening with a major aerospace company in McLean, VA for a Sr. Talent Sourcer – Recruiter. NOTE: <strong>This is a REMOTE job and is a long term stable role (No end date anticipated). </strong>US Citizenship is required.</p>\n <p><strong>Contractor’s Work Location: Remote</strong></p>\n <p><strong>Manager’s Location</strong><strong>:</strong> McLean, VA</p>\n <p>As a member of our team, a Sourcer works closely with our recruiters and hiring managers to develop strategies to find candidates for our IT, Engineering, and Intelligence Analysis organizations. We conceive practical and creative ways to surface leading talent, and we invest a lot of time activating passive candidates through a highly engaged approach. We’re passionate about delivering an awesome candidate experience, and that starts with the first conversation a candidate has with us, which is more often than not with a member of our Sourcing team. We’re seeking a dynamic Sourcer who brings a level of motivation, curiosity and technical capability to our team</p>\n <ul>\n  <li>Work closely with Recruiters and hiring managers to deeply understand requirements of the role, the function and how it fits into the organization</li>\n  <li>Team with Recruiters and hiring managers to manage an efficient model of operation</li>\n  <li>Strategize different ways to build talent pipelines and execute on tactical research, referral generation, events and sourcing campaigns</li>\n  <li>Find, engage and activate passive candidates through the use of Boolean, LinkedIn and alternative search techniques</li>\n  <li>Screen resumes and interview candidates to determine fit</li>\n  <li>Regularly track pipeline activity to share with internal stakeholders</li>\n  <li>Recommend and drive improvements that impact local pipeline areas</li>\n </ul>\n <p><strong>Skills Required:</strong></p>\n <ul>\n  <li>5+ years of technical sourcing experience with a search firm or in-house recruiting team</li>\n  <li>Excellent research/sourcing skills with the ability to dive deep into searches for hard-to-fill reqs</li>\n  <li>Sound candidate engagement approach with ability to activate passive candidates</li>\n  <li>Sharp interview skills with the ability to screen for both technical and cultural qualities</li>\n  <li>Strong interpersonal skills with the ability to communicate well</li>\n </ul>\n <p><strong>Skills Preferred</strong></p>\n <p>Prior staffing agency experience. Sourcing certification (AIRS, ERE/Sourcecon, Boolean Blackbelt, etc.) Involved in networking groups, social media, and has genuine interest in new and emerging sourcing methods and technologies.</p>\n <p><strong>Experience Required</strong></p>\n <ul>\n  <li>5+ years technical sourcing experience with a search firm or in-house recruiting team</li>\n  <li><strong>Education Required- High School Diploma</strong></li>\n  <li><strong>Education Preferred- BS or MS Degree plus professional certifications</strong></li>\n </ul>\n <p>Career consultants and candidates with lots of short assignments will not be considered. Work ethic, competitiveness, type-a personality trumps having prior experience with the Defense/Intelligence Community. No end date anticipated. This is a long-term stable role for which we are seeking a career-long match ideally.</p> \n</div>\n<div> \n <a href='https://www.jobs.net/jobs/corporateweb-geologics/en-us/job/United-States/Sr-Talent-Sourcer-Recruiter/J3P54W6DH0HY93VLW5L/' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8Y5VgfjuT2ulZmNmmfMsbw",
    "url": "http://workinstartups.com/job-board/job/82602/people-office-manager-at-tech-nation/",
    "title": "People + Office Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Tech Nation",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 22, 2019 3:08:44 PM",
    "validThrough": "Jul 29, 2019 3:08:44 PM",
    "crawled": "Jul 22, 2019 5:06:34 PM",
    "content": "People + Office Manager\n<br>\n<br>Who we are\n<br>\n<br>We are Tech Nation, the UK Network for ambitious tech entrepreneurs. Our mission is to empower ambitious tech entrepreneurs to grow faster through knowledge and connections. We want to make the UK the best place to imagine, start and grow a digital business to build an economy fit for the next generation. As a high growth startup ourselves, we are a neutral player sitting right at the heart of the ecosystem of high growth digital businesses, policy-makers and corporations.\n<br>\n<br>We empower tech founders to grow faster through our various growth programmes such as Founders’ Network, Upscale, Future Fifty, and Fintech. But not only that, we also offer end-to-end data, insights, stories &amp; resources, a UK wide community that shares the same entrepreneurial culture, and we are the only approved organisation for the Tech Nation Visa scheme rolled out for exceptional talent.\n<br>\n<br>Our Culture:\n<br>\n<br>We are a small but fast growing, high-performance team with high standards and big ambitions. We strive for excellence in everything we do. Our aim is to be transformative and collaborative in our work. We focus on speed, scale, smart resourcefulness and unbounded optimism. We never start with ‘no.’ We’re solution oriented and focus on the outcome and the impact of any project or priority. We’re a curious bunch, creative and a little quirky. We debate things passionately in team meetings and stand-ups. We agree and disagree on how the world should work, but we all agree on making a big difference through our work at Tech Nation. Which is why we love it here and never take it for granted.\n<br>\n<br>Our values are: originality, meaningful collaboration and real impact.\n<br>\n<br>The Role \n<br>\n<br>We are looking for an amazing People and Office Manager to organise and coordinate admin duties and office procedures. This dual role will report into the People Lead and lend support to the various people activities at Tech Nation. Your role is to create and maintain a pleasant work environment, ensuring high levels of organisational effectiveness, communication and safety.\n<br>\n<br>A Day in the Life of a Tech Nation People + Office Manager might look something like this:\n<br>\n<br>The office management side of the role\n<br>\n<br>Serve as the point person for office manager duties including:\n<br>Maintenance\n<br>Mailing\n<br>Supplies\n<br>Equipment\n<br>Bills\n<br>Errands\n<br>Shopping\n<br>Schedule meetings and appointments\n<br>Organise the office layout and order stationery and equipment\n<br>Maintain the office condition and arrange necessary repairs\n<br>Organise office operations and procedures\n<br>Manage contract and price negotiations with office vendors, service providers and office lease\n<br>Manage office G&amp;A budget, ensure accurate and timely reporting\n<br>Provide general support to visitors\n<br>Address employees queries regarding office management issues (e.g. stationery, Hardware and travel arrangements)\n<br>Liaise with facility management vendors, including cleaning, catering and security services\n<br>Work closely with the Manchester team as well remote workers to ensure they have all they need. \n<br>\n<br>The People side of the role\n<br>\n<br>Support the People Lead to plan in-house or off-site activities, like parties, celebrations and conferences\n<br>Own the on-boarding process for new hires\n<br>Organise and maintain personnel records\n<br>Update our HR system where needed \n<br>Participate and support with HR projects \n<br>As well as sharing our ambitions and values, you will\n<br>Proven work experience as an office manager\n<br>Knowledge of office administrator responsibilities, systems and procedures\n<br>Proficiency in MS Office (MS Excel and MS Outlook, in particular)\n<br>Excellent time management skills and ability to multi-task and prioritize work\n<br>Attention to detail and problem-solving skills\n<br>Excellent written and verbal communication skills\n<br>Strong organisational and planning skills in a fast-paced environment\n<br>A creative mind with an ability to suggest improvements\n<br>Experience of working closely with the HR team \n<br>\n<br>What’s in it for you?\n<br>\n<br>Untangl, which include access to a cash plan that covers health, protection and well being.\n<br>Perkbox\n<br>A shiny new macbook\n<br>A 4% employer pension\n<br>A flexible work environment\n<br>Cycle to work scheme (up to £1,000)\n<br>Season ticket loan (up to £5,000)\n<br>Quarterly team away days\n<br>\n<br>WHERE TO FROM HERE?\n<br>\n<br>We welcome those with alternative identities, backgrounds, and experiences. Our team includes women, men, mothers, fathers, the self-taught, the university-educated, and people of a wide variety of nationalities, ages, and socio-economic backgrounds.\n<br>\n<br>Obviously, we’re looking to ensure it’s a solid fit from both sides: we want you to step into a role you love, and we want to offer you a place you’re proud to come to every day. \n<br>\n<br>Now that you’re done reading, apply!\n<br>\n<br>* We know that diverse teams are strong teams, and welcome those with alternative identities, backgrounds, and experiences to apply to life at Tech Nation. We are committed to a fair and accessible recruitment process for all candidates. We would be happy to meet any accommodation requests during the application or interview process, please just let us know*.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "22gAaJQcRj64UXNnuc6lDQ",
    "url": "https://remote.co/job/senior-hr-generalist/",
    "title": "Senior HR Generalist",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "TeamSnap",
      "sameAs": "https://www.teamsnap.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 14, 2019 5:53:24 PM",
    "validThrough": "Jul 21, 2019 5:53:24 PM",
    "crawled": "Jul 14, 2019 6:23:49 PM",
    "content": "<h3>Senior HR Generalist at <span>TeamSnap</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <ul>\n  <li><strong>United States</strong></li>\n  <li><strong>Full Time</strong></li>\n  <li><strong>Experienced</strong></li>\n </ul>\n <p>Here at TeamSnap we believe that who you work with is just as important as the work you do. We know that culture matters and to build and sustain a strong culture means we need a strong and dedicated team to support these efforts. To continue building our strong culture, we are expanding our people team as we seek to add an experienced and driven Senior HR Generalist (we call it a Sr. People Experience Generalist) to help identify, develop and retain top talent here at TeamSnap. The Senior HR Generalist will be tasked with being the internal champion of TeamSnap recruiting efforts, building and nurturing relationships with team members and managers alike, and identifying where human resources practices can be leveraged to support the business strategies and challenges.</p>\n <p><strong>About us</strong><br>TeamSnap is an award-winning communication and management service for recreational and competitive sports teams, tournaments and organizations. With over 20 million enthusiastic customers in 195 countries, TeamSnap is indispensable for teams, clubs and leagues worldwide.</p>\n <p>We value trust, communication and fun more than big company policies and rules, and we thrive on empowering our people instead of controlling them. TeamSnap has been named to Outside Magazine’s list of Best Places to Work three consecutive years.</p>\n <p><strong>What you’ll be doing</strong><br>Here at TeamSnap we’re building a PX team that meets the needs of all employees from top to bottom and across every function. Our goal is to not only recruit the best talent possible, but to nurture and develop them throughout the entire employee life cycle. This role will:</p>\n <ul>\n  <li>Function as our recruiting champion recruiting process from sourcing, screening, interviewing, negotiating offers, and coordinating with contractors and/or consultants who support our recruiting efforts.</li>\n  <li>Ensure the appropriate HR processes are in place to meet compliance requirements and continually strive to improve processes to better streamline operational efficiencies.</li>\n  <li>Partner and advise people leaders and team members on HR related policies, programs, and procedures.</li>\n  <li>Recommends HR approaches and strategies to continually improve departmental efficiency.</li>\n  <li>Support HR programs such as benefits, performance reviews, compensation, and learning &amp; development.</li>\n  <li>Investigate, resolve and coach managers on employee relations issues.</li>\n  <li>Assist with offboarding and other responsibilities related to terminations.</li>\n  <li>Conduct exit interviews and assist in creating effective retention strategies.</li>\n  <li>Maintain employee files and compile reports concerning data such as hires, transfers, performance, etc.</li>\n  <li>Perform presentations on HR compliance topics to ensure the company is in adherence to HR policies, procedures, and programs.</li>\n  <li>Assist with identifying and arranging training needs for employee development.</li>\n  <li>Understands and ensures compliance with federal, state and local HR requirements; communicating potential changes, and advising leadership on needed actions.</li>\n </ul>\n <p><strong>Some things that are important:</strong></p>\n <ul>\n  <li>5+ years of progressive experience in human resources</li>\n  <li>Effective team player and multi-tasker with the ability to prioritize multiple streams of work from multiple sources without sacrificing quality</li>\n  <li>Progressive recruiting experience is a must</li>\n  <li>Has the balance of owning the work, but also playing as a team</li>\n  <li>Well versed in federal, state, and local laws and guidelines relating to employment practices</li>\n  <li>Developed knowledge of HR policies and processes</li>\n  <li>Sense of humor is essential, we work hard so we make sure we have fun doing it</li>\n  <li>Appreciates and facilitates the link between HR and business strategy</li>\n  <li>Ability to identify needs within the business that require HR support</li>\n  <li>Experience building and scaling a rapidly growing team</li>\n  <li>Comfortable providing coaching and feedback to all levels</li>\n  <li>Strong customer service, communication and interpersonal communication skills</li>\n </ul>\n <p><strong>Other things that would be nice to have:</strong></p>\n <ul>\n  <li><strong>Bachelor’s degree in Human Resources or related field</strong></li>\n  <li>Professional certification in HR (SHRM or HCI)</li>\n  <li>Experience working for a fully remote organization</li>\n  <li>Past work with rapidly scaling SaaS startups</li>\n  <li>Experience working with remote and distributed teams</li>\n  <li>Be a TeamSnap user (sign up for a free trial to see what we’re about)</li>\n  <li>Ability to talk to animals, Doctor Doolittle-style</li>\n </ul>\n <p><strong>Location</strong><br><strong>REMOTE POSITION: We are headquartered in Boulder, Colorado, but this job is remote (unless you happen to live near Boulder, in which case you’re welcome to come to the office).&nbsp;</strong>TeamSnap is a mostly-distributed company, so you must be very comfortable working with people who aren’t in the same physical location as you or each other. While we love all parts of the world,&nbsp;<strong>we can only hire US-based citizens at this time.</strong></p>\n <p><strong>Why TeamSnap?</strong></p>\n <ul>\n  <li>Work on a product that people use and love</li>\n  <li>While we’re still relatively small, we’re not a fly-by-night startup; we’re the leader in a massive market</li>\n  <li>We have a proven revenue model, an experienced executive team, solid funding, and a strong strategic plan</li>\n  <li>We have fantastic benefits, and you’ll have a stake in the company</li>\n </ul>\n <p>If you’re looking for an opportunity to show off the very best of your skills, in an environment of trust, respect and flexibility, this might very well be the best job you’ll ever have. We’re passionate about helping our customers spend less time organizing and more time playing.</p>\n <p><strong>Benefits and Perks</strong><br>We offer competitive salary and benefits, lots of opportunity to develop professionally, and the ability to demonstrate what you can achieve. TeamSnap is still small enough that your actions will help drive our success.</p>\n <p><strong>Benefits include:</strong></p>\n <ul>\n  <li>Competitive salary</li>\n  <li>Stock options</li>\n  <li>Medical/dental/vision for you and your family</li>\n  <li>Education reimbursement up to $1,500/yr</li>\n  <li>Wellness stipend of $50/mo</li>\n  <li>401K</li>\n  <li>Free TeamSnap service for your family and friends</li>\n  <li>Free TeamSnap swag.</li>\n  <li>Flexible PTO and vacation policy</li>\n </ul> \n</div>\n<div> \n <a href='https://teamsnap.applytojob.com/apply/8LGf80jzyd/Senior-HR-Generalist' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5n20BU1uRSSqhUHN1cLWbw",
    "url": "https://remote.co/job/therapy-recruiter/",
    "title": "Therapy Recruiter",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Reliant Rehabilitation",
      "sameAs": "https://www.reliant-rehab.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 5:34:10 PM",
    "validThrough": "Jul 19, 2019 5:34:10 PM",
    "crawled": "Jul 12, 2019 6:23:52 PM",
    "content": "<h3>Therapy Recruiter at <span>Reliant Rehabilitation</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Corporate TALEN05189</strong></p>\n <p><strong>Full-Time</strong></p>\n <p><strong>Plano, TX, USA</strong></p>\n <p><strong>Job Details</strong></p>\n <p><strong>Description</strong></p>\n <p>The Recruiter (Therapy) will be based out of our<strong>&nbsp;Plano, Texas office or remote</strong>&nbsp;and will be responsible for reviewing, screening, and referring applicants for therapy-based positions (physical, occupational, and speech) throughout the company’s facilities. The recruiter will also work with hiring managers in the field to develop recruiting plans to support business need. Considerable skills in interviewing techniques, a good knowledge of healthcare, a basic understanding of the company’s organizational structure as well as an extensive knowledge of personnel policy and procedure and federal and state laws regarding employment practices are essential.</p>\n <p><strong>RESPONSIBILITIES:</strong></p>\n <ul>\n  <li>Responsible for full life cycle recruiting, including sourcing, interviewing, and on-boarding</li>\n  <li>Development of recruiting plans, in conjunction with hiring managers.</li>\n  <li>Develops relationships with allied health education providers, and professional associations.</li>\n  <li>Provide consultative support to hiring managers.</li>\n  <li>Responsible for identifying, interviewing, evaluating, and assisting in selection of talent to ensure organizational goals are achieved.</li>\n  <li>Ensure all applicant / new employee documents are received, complete and accurately entered into HRIS system.</li>\n  <li>Act as liaison with area employment agencies, prepare and liaison with advertising agencies, and temporary agencies.</li>\n  <li>Develop and maintain job postings on various recruitment sites (Indeed, LinkedIn, etc).</li>\n  <li>Coordinate attendance at career fairs, job fairs, professional conferences, educational conferences.</li>\n  <li>Complete weekly, monthly and annual reports on recruitment / employment activity.</li>\n  <li>Notify all departments of employee’s hire and start date.</li>\n  <li>Provide all new hire documents to payroll and benefits.</li>\n  <li>Ensure all job postings are posted internally and track internal applicants.</li>\n  <li>Data Entry of HR documents.</li>\n  <li>And other duties as requested.</li>\n </ul>\n <p><strong>REQUIREMENTS AND QUALIFICATIONS:</strong></p>\n <ul>\n  <li><strong>Bachelor’s Degree</strong>&nbsp;or equivalent experience.</li>\n  <li>At least 3 years of experience as an agency/staffing recruiter or corporate recruiter, preferably in healthcare.</li>\n </ul>\n <p><strong>The following are personal qualities that will characterize the successful applicant:</strong></p>\n <ul>\n  <li>Excellent presentation skills</li>\n  <li>Superb communication proficiency – both verbal and written.</li>\n  <li>Customer/Client focused.</li>\n  <li>Negotiation and problem-solving skills.</li>\n  <li>Time management and prioritization skills.</li>\n  <li>Thoroughness.</li>\n  <li>Detail orientated.</li>\n  <li>Ability to file, sort, and maintain company/employee data.</li>\n  <li>Ability to create and provide reports and departmental communications.</li>\n </ul> \n</div>\n<div> \n <a href='https://ars2.equest.com/?response_id=34009d02770edbd5f5f3deda5aa5a8cd' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CvbLBV-1QnCYlyIoztOqDg",
    "url": "https://weworkremotely.com/remote-jobs/teamsnap-sr-hr-generalist",
    "title": "TeamSnap: Sr. HR Generalist",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "TeamSnap",
      "sameAs": "http://www.teamsnap.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 4:02:34 PM",
    "validThrough": "Jul 19, 2019 4:02:34 PM",
    "crawled": "Jul 12, 2019 4:06:23 PM",
    "content": "<h3> Sr. HR Generalist </h3>\n<div>\n <div>\n  Here at TeamSnap we believe that who you work with is just as important as the work you do.&nbsp; We know that culture matters and to build and sustain a strong culture means we need a strong and dedicated team to support these efforts.&nbsp; To continue building our strong culture, we are expanding our people team as we seek to add an experienced and driven Senior HR Generalist (we call it a Sr. People Experience Generalist) to help identify, develop and retain top talent here at TeamSnap.&nbsp; The Senior HR Generalist will be tasked with being the internal champion of TeamSnap recruiting efforts, building and nurturing relationships with team members and managers alike, and identifying where human resources practices can be leveraged to support the business strategies and challenges.&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>About us</b></span>\n </div>\n <div>\n  <span>TeamSnap is an award-winning communication and management service for recreational and competitive sports teams, tournaments and organizations. With over 20 million enthusiastic customers in 195 countries, TeamSnap is indispensable for teams, clubs and leagues worldwide.</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  We value trust, communication and fun more than big company policies and rules, and we thrive on empowering our people instead of controlling them. TeamSnap has been named to Outside Magazine’s list of Best Places to Work three consecutive years.\n  <span><br></span>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <b>What you’ll be doing</b>\n  <br>\n </div>\n <div></div>\n <div>\n  Here at TeamSnap we’re building a PX team that meets the needs of all employees from top to bottom and across every function.&nbsp; Our goal is to not only recruit the best talent possible, but to nurture and develop them throughout the entire employee life cycle.&nbsp; This role will:&nbsp;\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Function as our recruiting champion recruiting process from sourcing, screening, interviewing, negotiating offers, and coordinating with contractors and/or consultants who support our recruiting efforts.</li>\n  <li>Ensure the appropriate HR processes are in place to meet compliance requirements and continually strive to improve processes to better streamline operational efficiencies.</li>\n  <li>Partner and advise people leaders and team members on HR related policies, programs, and procedures.</li>\n  <li>Recommends HR approaches and strategies to continually improve departmental efficiency.</li>\n  <li>Support HR programs such as benefits, performance reviews, compensation, and learning &amp; development.</li>\n  <li>Investigate, resolve and coach managers on employee relations issues.</li>\n  <li>Assist with offboarding and other responsibilities related to terminations.</li>\n  <li>Conduct exit interviews and assist in creating effective retention strategies.</li>\n  <li>Maintain employee files and compile reports concerning data such as hires, transfers, performance, etc.</li>\n  <li>Perform presentations on HR compliance topics to ensure the company is in adherence to HR policies, procedures, and programs.</li>\n  <li>Assist with identifying and arranging training needs for employee development.</li>\n  <li>Understands and ensures compliance with federal, state and local HR requirements; communicating potential changes, and advising leadership on needed actions.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <b><strong>Some things that are important:</strong>&nbsp;</b>\n </div>\n <ul>\n  <li>5+ years of progressive experience in human resources</li>\n  <li>Effective team player and multi-tasker with the ability to prioritize multiple streams of work from multiple sources without sacrificing quality</li>\n  <li>Progressive recruiting experience is a must</li>\n  <li>Has the balance of owning the work, but also playing as a team</li>\n  <li>Well versed in federal, state, and local laws and guidelines&nbsp; relating to employment practices</li>\n  <li>Developed knowledge of HR policies and processes</li>\n  <li>Sense of humor is essential, we work hard so we make sure we have fun doing it</li>\n  <li>Appreciates and facilitates the link between HR and business strategy</li>\n  <li>Ability to identify needs&nbsp; within the business that require HR support</li>\n  <li>Experience building and scaling a rapidly growing team</li>\n  <li>Comfortable providing coaching and feedback to all levels</li>\n  <li>Strong customer service, communication and interpersonal communication skills</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Other things that would be nice to have:&nbsp;</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Bachelor’s degree in Human Resources or related field</li>\n  <li>Professional certification in HR (SHRM or HCI)</li>\n  <li>Experience working for a fully remote organization</li>\n  <li>Past work with rapidly scaling SaaS startups</li>\n  <li>Experience working with remote and distributed teams</li>\n  <li>Be a TeamSnap user (sign up for a free trial to see what we’re about)</li>\n  <li>Ability to talk to animals, Doctor Doolittle-style</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Location</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  REMOTE POSITION: We are headquartered in Boulder, Colorado, but this job is remote (unless you happen to live near Boulder, in which case you’re welcome to come to the office). TeamSnap is a mostly-distributed company, so you must be very comfortable working with people who aren’t in the same physical location as you or each other. While we love all parts of the world, we can only hire US-based citizens at this time.\n  <br>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Why TeamSnap?</b></span>\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Work on a product that people use and love</li>\n  <li>While we’re still relatively small, we’re not a fly-by-night startup; we’re the leader in a massive market</li>\n  <li>We have a proven revenue model, an experienced executive team, solid funding, and a strong strategic plan</li>\n  <li>We have fantastic benefits, and you’ll have a stake in the company</li>\n  <li><br></li>\n </ul>\n <div>\n  If you’re looking for an opportunity to show off the very best of your skills, in an environment of trust, respect and flexibility, this might very well be the best job you’ll ever have. We’re passionate about helping our customers spend less time organizing and more time playing.&nbsp;\n  <br>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Benefits and Perks</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  We offer competitive salary and benefits, lots of opportunity to develop professionally, and the ability to demonstrate what you can achieve. TeamSnap is still small enough that your actions will help drive our success.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <b>Benefits include:</b>\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Competitive salary</li>\n  <li>Stock options</li>\n  <li>Medical/dental/vision for you and your family</li>\n  <li>Education reimbursement up to $1,500/yr</li>\n  <li>Wellness stipend of $50/mo</li>\n  <li>401K</li>\n  <li>Free TeamSnap service for your family and friends</li>\n  <li>Free TeamSnap swag.</li>\n  <li>Flexible PTO and vacation policy</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Diversity and Inclusion</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  TeamSnap is a company built around trust, kindness and collaboration, where diverse backgrounds, experiences and viewpoints are celebrated and valued. This is a place where everybody belongs.\n  <br>\n </div>\n <div></div>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RCAjBZYwQ1W4oaOUvRONwg",
    "url": "http://workinstartups.com/job-board/job/82131/hr-and-operations-manager-based-in-the-philippines-remote-at-hopla-online/",
    "title": "HR and Operations Manager based in the Philippines (remote)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Hopla Online",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2019 12:37:03 PM",
    "validThrough": "Jul 15, 2019 12:37:03 PM",
    "crawled": "Jul 10, 2019 11:01:10 PM",
    "content": "We are looking for an Operations Manager with strong HR skills to lead our HR team, staff and clients. You will take ownership of all HR matters and related operational processes across the company i.e. from recruitment to performance reviews, contracting &amp; onboarding, wage reviews, disciplinary action, and learning &amp; development. To perform well in this role you should have experience as an HR Manager, or other senior roles in the HR &amp; Ops team, and knowledge around all legal requirements in this role.\n<br>\n<br>Responsibilities:\n<br>- Consistently recruiting for excellent staff, anticipate future hiring needs and maintain a consistent pipeline of profiles in demand.\n<br>- Attracting suitable candidates through job boards, remote professionals platforms, social media, etc.\n<br>- Conducting interviews and sorting through applicants to fill open positions.\n<br>- Assessing applicants' knowledge, skills, and experience to best suit open positions.\n<br>- Research, create and update skills test task for every position for a smoother recruitment process. \n<br>- Promoting the company's reputation and attractiveness as a great company to work for.\n<br>- Maintaining a smooth onboarding process, training, counseling and coaching of our staff.\n<br>- Resolving conflicts through positive and professional mediation.\n<br>- Carrying out necessary administrative duties, conducting performance and wage reviews including the creation of the necessary documentation\n<br>- Developing clear policies and ensuring policy awareness.\n<br>- Creating clear and concise staff, process and client reports.\n<br>- Giving helpful and engaging presentations and explanations of internal processes and best practices.\n<br>- Handling disciplinary investigations and contract termination procedures.\n<br>- Design user-friendly processes, workflows, guidelines, and documentation\n<br>- Team payroll and weekly/monthly hours check\n<br>- Supervision of the HR budget and advising the management team on possible optimization\n<br>- Work alongside the IT department to perform regular assessments and improvements to the HRIS.\n<br>- Leading a team of human resource associates, managers and recruiters.\n<br>- Participation in the meetings &amp; discussions with the Clients to identify the best talents fitting the requirements\n<br>- Clients onboarding and support throughout the first month of working with HOPLA\n<br>- Regular feedback sessions with Clients &amp; their staff to provision and facilitate possible challenges in their remote journey.\n<br>- Clients invoicing and other operational support of the positive client experience.\n<br>- Thorough understanding of company services, identifying client needs and recommending/upselling adequate solutions.\n<br>\n<br>Requirements:\n<br>- Bachelor’s degree in Human Resources Management or equivalent.\n<br>- Experience in Human Resources or related fields.\n<br>- Ability to build and maintain positive relationships with colleagues.\n<br>- Experience in training and coaching staff.\n<br>- Experience in conflict resolution, disciplinary processes and workplace investigations.\n<br>- Experience in following and maintaining privacy policy and procedures in handling confidential documents, and understanding data protection.\n<br>- Understanding of the general labor law rules &amp; processes\n<br>- Experience in creating HR documentation, i.e. contracts, additional agreements, policies, etc\n<br>- Ability to give presentations, webinars and live video calls with clients and staff.\n<br>- Experienced &amp; competent with modern web-based systems, such as Wordpress, Google Suite, ATS systems, Slack, Trello, Hubstaff, etc.\n<br>- Great communication skills. We’re a distributed team, so frequent, proactive and clear communication is a must.\n<br>- Self-driven work ethics. You need to be a starter who loves taking initiative and seeing things through to completion. Hardworking and highly transparent in your work.\n<br>- Ability to analyze situations from different angles and come up with effective solutions\n<br>- Exceptional verbal and written communication skills in English\n<br>\n<br>About our Company\n<br>We are pioneers in remote hiring. All our staff works from home, and we continuously develop and invest in optimizing the online hiring process with proprietary in-house tools and automation. If you like to be ahead of the curve, be part of a young, dynamic and fast-growing company, then we are looking for you.\n<br>\n<br>Among the perks of working remotely, you will enjoy working with a global team, directly work with owners and executives, deal with various global clients, interact with a variety of different cultures, and you get plenty of space to show your worth &amp; ideas and help the organization grow. So, if you are up for an entrepreneur challenge &amp; and new journey then this might just be that next role for you.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
