{
 "items": [
  {
    "id": "d9QHshr-TBWgHzF1OnG97Q",
    "url": "https://jobmote.com/job/4669191/software-integration-engineer-remote/",
    "title": "Software Integration Engineer (Remote)",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:dotnet/dotnet/16",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jdbc/java/8",
      "DBG_TECH1:k/t/w:jms/java/8",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=2, other=2, dotnet=24, c=0, mobile=2, go=0, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=20, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet",
      "java"
    ],
    "hiringOrganization": {
      "name": "Change Healthcare",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 27, 2020 2:24:08 AM",
    "validThrough": "Apr 30, 2020 2:24:08 AM",
    "crawled": "Apr 27, 2020 3:05:13 AM",
    "content": "<div><p> </p><p> <b> Transforming the future of healthcare isn’t something we take lightly. It takes teams of the best and the brightest, working together to make an impact.</b> </p>  <p> </p><p> <b> As one of the largest healthcare technology companies in the U.S., we are a catalyst to accelerate the journey toward improved lives and healthier communities.</b> </p>  <p> </p><p> <b> Here at Change Healthcare, we’re using our influence to drive positive changes across the industry, and we want motivated and passionate people like you to help us continue to bring new and innovative ideas to life.<br> &nbsp;<br> If you’re ready to embrace your passion and do what you love with a company that’s committed to supporting your future, then you belong at Change Healthcare.</b> </p>  <p> </p><p> <b> Pursue purpose. Champion innovation. Earn trust. Be agile. Include all.&nbsp;</b> </p>  <p> Change Healthcare is seeking an Integration Engineer to work either at our Pensacola Florida office or remotely anywhere throughout the US. The position involves analysis, design, documentation, development, testing, and implementation activities related to integrating claims adjudication systems. Designs, builds and maintains software integration points for the HealthEdge HealthRules Payor platform and related healthcare applications.</p> <p> <b> What will I be responsible for in this job? (brief summary of the role)</b> </p>  Participate in the full software development life cycle from requirements analysis through test, release and maintenance.&nbsp;  Participate in code and design reviews.&nbsp;  Use version control system to ensure a reliable code base.&nbsp;  Be involved with hands-on development of proof-of-concepts and prototypes during the design phase and actual development of the product during the construction phase.  Interface with Quality Assurance to ensure accurate delivery of project requirements and compliance with standards, code quality and accepted conventions.&nbsp;  Convey complex ideas through interactive discussions, diagrams and presentations.  Creatively and independently provide resolution to technical problems in a cost-effective manner.  Conduct research to remain up-to-date and knowledgeable on industry trends and emerging technologies in anticipation of new business processes and system alternations.  Create and maintain ETL (Extract Translate Load) programs for bulk loading database with eligibility and claim status data from numerous health plans.  Support and enhance a robust healthcare transaction processing platform by developing edits, logic, and business rules.  Create and maintain alerts to trigger exception handling and processing events.  Develop and maintain web based applications and dashboards to reflect system, application, and event statuses.  Design, implement, and support EDI transaction translation applications to convert data to and from X12 EDI, XML, Flat Files, and proprietary file formats.  Create automation and scheduling of processes and jobs related to healthcare transaction processing.  Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.  Improve operations by conducting systems analysis; recommending changes in policies and procedures. <p> <br><b> What are the requirements?</b> <br><b> • Years of experience: </b>  5+ years of experience in Java or .NET<br><b> • Education: </b>  Bachelor’s degree in Computer Science or other advanced technical degree. Experience in healthcare and software development may substitute for required education.<br><b> • Physical requirements:</b>  General office demands.<br><br><b> What critical skills are needed for you to consider someone for this position?</b> </p>  A minimum of 5 years of software development experience, including experience as a hands-on software developer building object-oriented solutions working in Java or a .Net environment.&nbsp;  Two years with SQL, XML, JavaScript, CSS3, and HTML 5  Two years with Web service API’s, JMS, JDBC/ODBC, Oracle <p> <br><b> What other skills/experience would be helpful to have?</b> </p>  Experience with data translation and mapping using Symphonia or equivalent  Must be self motivated, have the ability to work independently with minimal supervision  Must be an analytical and creative problem solver  Strong written and verbal communication skills  Work with the team to develop an application that meets the client’s requirements  Ability to maintain confidentiality with sensitive customer and internal information  Strong technical aptitude and ability to research &amp; solve complex issues independently  Experience with Windows and Linux operating systems  Experience with command line and shell scripting  Experience with Source Control systems like CVS and/or Subversion  Familiar with TIBCO (BW, BE, HAWK, EMS, Foresight)  Familiar with dynamic programming languages like Python, Groovy or Ruby  Familiar with HealthCare Transaction processing, Clearinghouse Operations, X12 EDI <p> <br><b> How much should I expect to travel? Less than 10% </b> <br><br> Employees in roles that require travel will need to be able to qualify for a company credit card or be able to use their own personal credit card for travel expenses and submit for reimbursement.</p> <p> Join our team today where we are creating a better coordinated, increasingly collaborative, and more efficient healthcare system!</p> <p> <b> Equal </b> </p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UaT1ygYJRjGCxsssXx__nw",
    "url": "https://news.ycombinator.com/item?id=22754270",
    "title": "SEEKING FREELANCER | Remote | Singapore I'm looking for someone to build and run tests for gRPC ...",
    "tags": [
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 12:43:54 AM",
    "validThrough": "Apr 9, 2020 12:43:54 AM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "SEEKING FREELANCER | Remote | Singapore<p>I'm looking for someone to build and run tests for gRPC and REST APIs.  You should be keen to make things break!  Python3 (strongly type hinted).</p><p>Contact me on jobs.test at global-frequency.net</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
