{
 "items": [
  {
    "id": "eloI0COIRk2bNCxPlowZpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153534/technical-writer-vividcortex?a=PupDQlctMiI",
    "title": "Technical Writer at VividCortex (Chicago, IL) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Information Services, Information Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the role</strong></p><p>The Technical Content Writer and Journalist develops the voice of VividCortex to create thought leadership content around business, strategy, technology, and future trends. You assist in the execution and distribution of content through various content vehicles, such as company blogs, whitepapers, ebooks, and product videos to help prospects fully understand the value of VividCortex in an engaging, brand-centric manner. You form strong partnerships with leaders inside and outside the organization, and help them turn their ideas into compelling content.&nbsp;You will report to the CMO and are a key member of our Marketing team.</p><p><strong>Key Responsibilities:</strong></p><ul><ul><li>Brainstorm, research, write, and distribute articles, blog posts, case studies, eBooks, whitepapers, and more, that are authoritative, clear, and informative and meets the needs of both key stakeholders and unique personas and user buyer journey stages.</li><li>Continually work with the extended marketing team to measure reader engagement, and iterate to improve content definition, distribution, and performance.</li><li>Engage with development team routinely to gain a full understanding of recent product releases and newest features to better understand ways to position VividCortex in the market.</li><li>Assist with the creation and development of print collateral such as brochures for tradeshows or events.</li><li>Work with customers for case studies/testimonials.</li><li>Balance content distribution efforts, producing a regular cadence of blog content, repositioning high-performing pieces, and managing the development long-tail content assets.</li></ul></ul><p><strong>Requirements:</strong></p><ul><ul><li>History of working with B2B organizations developing technology and business content in a regular cadence, or tech journalism experience.</li><li>Skilled and polished writer who can transform ideas and interviews into content quickly and efficiently.</li><li>Passion to combine strong writing skills with a love of technology.</li><li>Interested in the world of business and technology and love to read and write about it.</li><li>Ability to build a pipeline of successful content based on interviews with thought leaders.</li><li>Experience writing regular blog content that sparks a conversation.</li><li>Academic or professional experience in technical writing and or journalism.</li><li>Located in the Washington, DC or Chicago area, and available for occasional travel.</li></ul></ul><p>At VividCortex, we want to build a diverse team because it's the right thing to do, and because we believe diversity is strength. We encourage applicants from all walks of life and all backgrounds.</p><p><strong>Note to Agencies and Recruiters:</strong>&nbsp;VividCortex has a strict company policy against engaging with unsolicited contact from agencies or recruiters. &nbsp;Unsolicited resumes and leads are property of VividCortex and VividCortex explicitly denies that any information sent to VividCortex can be construed as consideration.</p>                    </div>                            <h2>                About VividCortex            </h2>            <div><p>VividCortex is a modern&nbsp;database monitoring platform that gives developers and DBAs deep visibility into the database. Our solution is delivered as software-as-a-service and helps our customers see and analyze the work their databases are doing in great&nbsp;detail. It addresses critical pain points in measuring and managing today's large, distributed, diverse storage tiers composed of multiple different clustered products, all working together.<br><br>Founded in 2012 by noted database experts, and backed by major venture capital and high-wealth individuals, VividCortex is headquartered in Charlottesville, Virginia with a remote team in Montevideo, Uruguay. With more than 750% year-over-year growth, VividCortex is a company on fire!<br><br> We have a fast-growing customer base of well-known companies, and a tremendous reputation in our market for delivering a high-quality, innovative solution for database performance problems that are common in tens of thousands of small and large organizations.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Unlimited paid leave for any purpose (incl. maternity and paternity)                            </div>                            <div>                                 Excellent medical insurance and dental benefits                            </div>                            <div>                                 Equity                            </div>                            <div>                                 New MacBook or other Mac computer, as best suited to the position                            </div>                            <div>                                 Gym membership. We have quite a few CrossFitters at the office                            </div>                            <div>                                 A nerdy sense of humor, tax-free                            </div>                            <div>                                 Premium coffee, frequent team meals, snacks, and more                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_blogs",
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "TECH2_technical-writer",
      "TECH2_writer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "blogs",
      "technical-writer",
      "writer"
    ]
  },
  {
    "id": "SKwbhdhzREGFYnMV12tPQw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/150457/technical-writer-auth0?a=OsqTWuTxzfG",
    "title": "Technical Writer at Auth0 (Buenos Aires, Argentina) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you a developer who is always trying to learn new things? Every time a new technology or framework is released, do you try it out and build an open-source repository on GitHub with the code sample? If this sounds like you, we’d love for you to work with us!</p><p>We are looking for writers to join our renowned team and continue taking our blog to EPIC places! We want people who will help us write amazing blog articles and other types of technical content. You'll be able to write about exciting, popular, and emerging technologies (e.g., Angular, React, Passwordless, etc.).<br><br></p><p><strong>YOUR RESPONSIBILITIES WILL BE:</strong></p><ul><li>Research the latest technologies and stay on top of everything that's new.</li><li>Write blog posts that will be helpful to thousands of people.</li><li>Write user documentation, tutorials, landing pages, ebooks, and more to help people use Auth0.</li><li>Edit, clarify, and proofread documents written by others, and mentor non-writers on ways to improve their writing skills.</li></ul><p><strong>WHAT WE NEED FROM YOU:</strong></p><ul><li>Experience as a software developer.</li><li>Demonstrable experience writing blog posts or documentation. If you publish articles in your own blog, this is a great example.</li><li>Excellent skills in writing or translating complex technical and business subjects to a variety of audiences.</li><li>Ability to be self-directed and effective working independently, yet equally comfortable contributing and communicating in a global team environment.</li><li>Ability to estimate and scope documentation assignments.</li><li>Fluency in written US English.</li></ul><p><strong>BONUS POINTS</strong></p><ul><li>You have open-source work such as GitHub projects you can share.</li><li>You write your own technical blog.</li><li>Extra consideration if you can demonstrate your skills by rewriting one of our docs. Send us a <a href='https://github.com/auth0/docs' rel='nofollow'>pull request</a>!</li></ul><p>We are an equal opportunity employer and value diversity at our company.</p>                    </div>                            <h2>                About Auth0            </h2>            <div><p>Ultimately, we strive for an internet with fewer&nbsp;passwords. Our goal is to make authentication and authorization easy, powering the login boxes of every application in the world. We're looking for people to join us on this journey.</p><p>We're looking for people who care deeply about quality, team work and want to build software that people love.</p><p>Benefits vary by location. In Buenos Aires, Argentina, we offer:</p><ul><li>Flexible work hours</li><li>Healthcare coverage</li><li>MacBook Pro Retina 16GB</li><li>Embrace Distributed Work</li></ul><p>Visit us at <a href='http://auth0.com' rel='nofollow'>http://auth0.com</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_php",
      "TECH2_c#",
      "TECH2_javascript",
      "REMOTE1_100",
      "TITLE1_writer",
      "TECH2_java",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c#",
      "java",
      "javascript",
      "php",
      "reactjs"
    ]
  },
  {
    "id": "UgGymRjjTBe8dkQF7gxG8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157697/java-spring-technical-editor-remote-part-time-baeldung?a=QSYpm85hmbS",
    "title": "Java/Spring Technical Editor (remote, part-time) at Baeldung () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Java, Software Development, Web Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>We're looking for a part-time </span><strong>Java/Spring Technical Editor</strong><span> to work with new authors.</span></p><p><span>You'll be guiding authors by reviewing their articles and giving them technical feedback (in video form - usually a short, 5 minute screencasts is enough).</span></p><p><strong>Budget and Time Commitment</strong></p><p><span>Overall, you’ll spend around </span><strong>12-14 hours/month </strong><span>and the budget is </span><strong>600$ / month.</strong></p><p><span>This corresponds to a target of 12 - 16 articles/month (12 x 1250 words or 16 x 1000 words articles).</span></p><p><span>The typical article will take about 2 rounds of review until it’s ready to go. All of this usually takes about 30 to 45 minutes of work for a small to a medium article and can take 60 to 90 minutes for larger pieces.</span></p><p><strong>Who is the right candidate?</strong></p><p><span>First – you need to be a developer yourself, working or actively involved </span><strong>in the Java and Spring ecosystem</strong><span>. All of these articles are code-centric, so being in the trenches and able to code is instrumental.</span></p><p></p><p><span>Second – </span><strong>you need to be able to provide feedback via screencasts. </strong><span>These videos are informal - generally, just a quick review explaining what author needs to improve on their article.</span></p><p></p><p><span>Finally – and it almost goes without saying – you should have a good command of the English language.</span></p><p><strong>Additional Details</strong></p><p><span>The goal is to make sure that the article hits a high level of quality before it gets published.</span></p><p><span>That means that the code examples should be runnable and correct and that the formatting and style match the guidelines of the site.</span></p>                    </div>                            <h2>                About Baeldung            </h2>            <div><p>Baeldung publishes in-depth articles and tutorials in the Java ecosystem and general Web Development, with a strong focus on Spring, Spring Security and RESTful APIs.</p><p>We also publish extensive guides on various Java libraries such as Jackson, the Apache HttpClient, Mockito, etc.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 All our authors work remotely and have a high degree of flexibility                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_spring-mvc",
      "TECH2_spring-boot",
      "TECH2_spring-security",
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "TECH2_spring",
      "TECH2_kotlin"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "kotlin",
      "spring",
      "spring-boot",
      "spring-mvc",
      "spring-security"
    ]
  },
  {
    "id": "DrlmTP2PR3-8vOpG2qUKTQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/63061/brand-and-communications-editor-intern-at-auctionshelter/",
    "title": "Brand and Communications Editor intern",
    "content": "Are you obsessed with finding and sharing stories online? Do your friends look to you on Facebook and Twitter for the latest trends, ideas, and memes?<br /><br />AuctionShelter is a London based tech start-up set on offering global buyers with a new way to bid on real estate deals. Backed by a successful Angel investor with a winning formula, we have been able to identify an area of the property market that has enormous potential.<br /><br />AuctionShelter has a fast paced work environment and we seek talented people who crave learning new skills and aren't afraid to tackle big projects. As an intern you will get to work with a variety of our executive staff and will work on real projects that will help us grow.  <br /><br />Our ideal candidate is someone who walks into a room of people and can’t leave without making a few friends. Someone who is obsessed with branding, marketing, social media, blogging and is creative and thoughtful when interacting with online communities and building relationships.<br /><br />What you’ll do:<br /><br />For the duration of the internship, candidates will be assisting with ideation of creative assets, in support of client campaigns and internal marketing efforts. Interns will come away from the experience with first-hand knowledge of agency best practices.<br />Candidates will be working closely with the creative content team on real world client deliverables by:<br /><br />•    Define our editorial agenda on all content that goes out to clients across blogs, emails, podcasts, video, social, our website and one off campaigns.<br />•    Blog content for AuctionShelter’s news blog and social media<br />•    Helping to develop content templates for the AuctionShelter team<br />•    Helping to write content for client presentation decks for the creative team (intro pages, next step pages, project descriptions, etc)<br />•    Researching on topics and data for senior writers to create content for clients<br />•    Lead generation through online research <br />•    Promotion and outreach<br />•    Streamlining the process of finding, communicating with, processing, and evaluating potential clients<br /><br />Who we are looking for:<br /><br />•    Junior, Senior, or recent graduate pursuing a B.A. in Advertising, Creative Writing, English, Journalism, or Communications or equivalent course in your country, business, marketing, computer science and technical roles.<br />•    A love of brands creative content and copy.<br />•    Buckets of ambition, a passion for your craft and plenty of hustle.<br />•    Research on market, able to understand the trends<br />•    Proactive and able to take ownership of the assigned tasks<br />•    A passion for Audio Editing, Audio clean up, editing Podcasts, Podcast set up, video editing and blogging<br /><br />Benefits & Perks:<br /><br />AuctionShelter is a young and international team, where you will have the opportunity to develop in a dynamic environment. Our colleagues are highly motivated, open-minded people, self-driven and with a great team spirit. You get access to the newest and most innovative technologies.<br /><br />• Fun, fast-paced, team oriented environment<br />• Remote and flexible working<br />",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 4:39:27 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "N9TaBqbUTgenMcxGCtKWIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/0c605a10-ae00-11e7-8e18-412ee95089cd",
    "title": "Full Time: Product Help Content Writer at GitHub in Remote-North America",
    "content": "<p>We're looking for a writer to help create user assistance content for GitHub Help.</p><p>This writer will report to the Product Documentation Team Manager and work cooperatively with the Documentation team to produce task-based, user-facing help content about the power of GitHub products and tools, tailored to a range of audiences.</p><p>If you're a patient, compassionate writer who loves crafting excellent prose to help people use software, we really want to hear from you!</p><h2>Responsibilities:</h2><ul><li>Collaborate with the Documentation team on planning and developing user assistance content for GitHub products and tools, including (but not limited to) GitHub.com, GitHub Pages, and GitHub Enterprise.</li><li>Cooperatively review and edit drafts of user assistance content with other writers on the team.</li><li>Communicate with Support, Product, and Engineering teams about the user feedback, product changes, and technical product information that inform our documentation.</li></ul><h2>Minimum Qualifications:</h2><ul><li>Ability to create high-quality, long-form user assistance content for software products.</li><li>Strong user advocate, especially for those new to a product or website.</li><li>Ability to compassionately give and receive editorial critique.</li><li>Excellent communication skills, especially when working with a distributed team. (The Documentation team is currently entirely distributed.)</li><li>Strong ability to plan, prioritize, and carry out complex writing projects with high attention to detail along the way.</li></ul><p>Who We Are:</p><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over 15 million people use GitHub to build amazing things together. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><p>What We Value:</p><p>Collaboration: We believe the best work is done together. Empathy: We believe in putting people first. Quality: We believe in setting the standard for excellence. Positive Impact: We believe in making the world a better place through our work. Shipping: We believe in creating things for the people using them.</p><p>Why You Should Join:</p><p>At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where over half of our Hubbers work, snack, and create daily. The other half of our Hubbers work remotely in 18 countries across the globe.</p><p>We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, and we think you will, too.</p><p>GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you. We're happy to accommodate!</p><p>*Please note that benefits vary by country. If you have any questions, please don't hesitate to ask your recruiter!</p>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 12:14:48 AM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "_gtwnLfdRc6FIZNHT0e42g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3909-lead-technical-writer-linux-foundation",
    "title": "Lead Technical Writer @ Linux Foundation",
    "content": "<h2>              Lead Technical Writer<small> @ Linux Foundation</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-04 20:15</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Linux Foundation Overview</strong></p><p>The Linux Foundation is creating the greatest shared technology investment in history by enabling open source collaboration across companies, developers and users. We are the organization of choice to build ecosystems that accelerate open technology development and commercial adoption.</p><p><strong>Cloud Native Computing Foundation Overview</strong></p><p>Cloud Native Computing Foundation is creating and driving the adoption of a new computing paradigm that is optimized for modern distributed systems environments capable of scaling to tens of thousands of healing multi-tenant nodes. Cloud native systems will be containerized, dynamically orchestrated and microservices-oriented. CNCF currently hosts Kubernetes, Prometheus, OpenTracing, fluentd, linkerd, gRPC, CoreDNS, containerd, rkt and CNI. For more information: <a href='https://www.cncf.io/' rel='nofollow'>https://www.cncf.io/</a>.</p><p><strong>Position Overview</strong></p><p>Technical writers take complex information and communicate it clearly, concisely, and accurately without relying on technical or corporate jargon. Technical writers at the Cloud Native Computing Foundation (CNCF) are a key link between engineers, marketing associates, community managers, and external developers, tying together many vital but disparate parts of the developer ecosystem. As a Lead Technical Writer, you will lead an external team of technical writers from different organizations aligned around CNCF community. Also, you will juggle a variety of projects, from reading and writing example code, to updating API reference docs and creating new developer guides that teach developers how to use our APIs.</p><p><strong>Minimum Qualifications</strong></p><p>BA/BS degree (In lieu of degree, 4 years relevant work experience). At least 2 years of relevant experience, such as technical writing, product documentation, or online publishing including experience with writing technical customer-facing materials, including online content. Ability to read and understand source code written in Java, Go, Python and/or JavaScript.</p><p><strong>Preferred Qualifications</strong></p><ul><li>4 years relevant work experience, including experience researching and writing documentation for developers (APIs, SDKs, web technologies).</li><li>Ability to write simple to complex code samples in Java, Python, JavaScript, or similar languages.</li><li>Familiarity with developer tools for cloud, containers, and/or open source.</li><li>Proven ability to author in HTML and work with version-control tools such as Git.</li><li>Ability to manage multiple competing priorities in a fast-paced, constantly changing environment.</li><li>Previous experience in an open source community is definitely a plus!</li><li>An open source pragmatist with a community friendly attitude!</li></ul><p><strong>Responsibilities</strong></p><ul><li>Lead a team and diverse community of technical writers aimed to build the best technical documentation for CNCF related projects.</li><li>Write technical documentation for a developer audience, including API references and developer guides.</li><li>Design and organize documentation sets for new Kubernetes features.</li><li>Edit, clarify, and proofread documents written by others, and coach non-writers on ways to improve their writing skills.</li><li>Work closely with community developers and writers to create quality documentation.</li><li>Travel to meet communities at events and host doc sprints (1-2 trips a quarter).</li></ul><p><em>The Linux Foundation is dedicated to hiring top-notch talent. We are as passionate of providing a flexible and supportive work culture as we are in open source software. Collaboration is in our DNA, and we pride ourselves on being able to work closely together while not being tied to an office. We offer outstanding benefits, including fantastic health care, unlimited PTO, 100% 401k match (up to $18,000), profit-sharing and exceptional healthcare plans.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>North America</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 11:15:02 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
