{
 "items": [
  {
    "id": "TFgEYNCgRJCEz_2SCrec3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62495",
    "title": "Copywriter - eCommerce/Dropship",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>SaleHoo is a New Zealand-based company creating online tools and training for people looking to start their own online businesses. We’re based in Christchurch, but the majority of our team work remotely from various places around the world.<br>We're looking for a talented individual to join us in writing content for our popular wholesale directory, SaleHoo.com<br>Our directory contains an educational section covering topics including eBay selling, Amazon selling, what products sell well online, how to market physical products online, importing and shipping and so on.<br>We're looking for someone with experience with these topics and industry to help us write lessons, scripts and blog posts (and whatever else turns up!).<br></p><ul><li>You should be experienced in at least several aspects of this industry: For instance, online selling, wholesale sourcing, marketing physical products.<br></li><li>You must be able to break a task down and get right to the heart of it: No lessons full of fluff, no beating around the bush. Our users want clear-as-day, step-by-step, hype-free lessons.<br></li><li>You should be a clear thinker: Able to objectively analyse a piece and ask yourself whether it is truly succeeding in what it's trying to do, and not afraid to overhaul something that isn't working.<br></li><li>You must be good at paying attention to detail and checking facts (things change rapidly in this industry!)<br></li><li>And obviously, your technical grasp of English must be good and things you write must be readable and make sense. The &quot;making sense&quot; part is the most important. We can handle the odd erroneously-placed apostrophe, so long as the heart and structure of the writing is A-OK!<br>This is a great opportunity to flex your writing muscles. While a lot of the content can be reasonably technical, the way we write the content has to be friendly, entertaining, personable and accessible to a wide audience.<br>While qualifications or experience in writing or journalism would be valuable, we're more interested in industry knowledge and your ability to write with clarity. If you think you've got the spark we're after... then we want to hear from you.<br>Please note: You <em>must</em> be able to provide at least 3-4 published pieces of industry-related content on authority sites that you have created, under your name.<br>Neat things about working with us:<br></li><li>Flexible hours (we are happy to discuss full-time, part-time, contracting for the role).<br></li><li>Work from home (or from our Christchurch office)<br></li><li>Relaxed, ego-free, family-friendly work culture<br>If you'd like to come work in our Christchurch office in Ferrymead, you also get:<br></li><li>Weekly Friday BBQ (or sushiBQ, or ThaiBQ)<br></li><li>Novelty coffee mugs<br></li><li>An extremely comfortable chair<br></li><li>Tap dancing seagulls</li></ul></span></td><td></td><td><a rel='nofollow'>10d</a></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 12:19:21 AM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "eloI0COIRk2bNCxPlowZpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153534/technical-writer-vividcortex?a=PupDQlctMiI",
    "title": "Technical Writer at VividCortex (Chicago, IL) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Information Services, Information Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the role</strong></p><p>The Technical Content Writer and Journalist develops the voice of VividCortex to create thought leadership content around business, strategy, technology, and future trends. You assist in the execution and distribution of content through various content vehicles, such as company blogs, whitepapers, ebooks, and product videos to help prospects fully understand the value of VividCortex in an engaging, brand-centric manner. You form strong partnerships with leaders inside and outside the organization, and help them turn their ideas into compelling content.&nbsp;You will report to the CMO and are a key member of our Marketing team.</p><p><strong>Key Responsibilities:</strong></p><ul><ul><li>Brainstorm, research, write, and distribute articles, blog posts, case studies, eBooks, whitepapers, and more, that are authoritative, clear, and informative and meets the needs of both key stakeholders and unique personas and user buyer journey stages.</li><li>Continually work with the extended marketing team to measure reader engagement, and iterate to improve content definition, distribution, and performance.</li><li>Engage with development team routinely to gain a full understanding of recent product releases and newest features to better understand ways to position VividCortex in the market.</li><li>Assist with the creation and development of print collateral such as brochures for tradeshows or events.</li><li>Work with customers for case studies/testimonials.</li><li>Balance content distribution efforts, producing a regular cadence of blog content, repositioning high-performing pieces, and managing the development long-tail content assets.</li></ul></ul><p><strong>Requirements:</strong></p><ul><ul><li>History of working with B2B organizations developing technology and business content in a regular cadence, or tech journalism experience.</li><li>Skilled and polished writer who can transform ideas and interviews into content quickly and efficiently.</li><li>Passion to combine strong writing skills with a love of technology.</li><li>Interested in the world of business and technology and love to read and write about it.</li><li>Ability to build a pipeline of successful content based on interviews with thought leaders.</li><li>Experience writing regular blog content that sparks a conversation.</li><li>Academic or professional experience in technical writing and or journalism.</li><li>Located in the Washington, DC or Chicago area, and available for occasional travel.</li></ul></ul><p>At VividCortex, we want to build a diverse team because it's the right thing to do, and because we believe diversity is strength. We encourage applicants from all walks of life and all backgrounds.</p><p><strong>Note to Agencies and Recruiters:</strong>&nbsp;VividCortex has a strict company policy against engaging with unsolicited contact from agencies or recruiters. &nbsp;Unsolicited resumes and leads are property of VividCortex and VividCortex explicitly denies that any information sent to VividCortex can be construed as consideration.</p>                    </div>                            <h2>                About VividCortex            </h2>            <div><p>VividCortex is a modern&nbsp;database monitoring platform that gives developers and DBAs deep visibility into the database. Our solution is delivered as software-as-a-service and helps our customers see and analyze the work their databases are doing in great&nbsp;detail. It addresses critical pain points in measuring and managing today's large, distributed, diverse storage tiers composed of multiple different clustered products, all working together.<br><br>Founded in 2012 by noted database experts, and backed by major venture capital and high-wealth individuals, VividCortex is headquartered in Charlottesville, Virginia with a remote team in Montevideo, Uruguay. With more than 750% year-over-year growth, VividCortex is a company on fire!<br><br> We have a fast-growing customer base of well-known companies, and a tremendous reputation in our market for delivering a high-quality, innovative solution for database performance problems that are common in tens of thousands of small and large organizations.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Unlimited paid leave for any purpose (incl. maternity and paternity)                            </div>                            <div>                                 Excellent medical insurance and dental benefits                            </div>                            <div>                                 Equity                            </div>                            <div>                                 New MacBook or other Mac computer, as best suited to the position                            </div>                            <div>                                 Gym membership. We have quite a few CrossFitters at the office                            </div>                            <div>                                 A nerdy sense of humor, tax-free                            </div>                            <div>                                 Premium coffee, frequent team meals, snacks, and more                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_blogs",
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "TECH2_technical-writer",
      "TECH2_writer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "blogs",
      "technical-writer",
      "writer"
    ]
  },
  {
    "id": "Uen-sRhLTYOOcde8zdiOzQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/63061/brand-and-communications-editor-intern-at-auctionshelter/",
    "title": "Brand and Communications Editor intern",
    "content": "Are you obsessed with finding and sharing stories online? Do your friends look to you on Facebook and Twitter for the latest trends, ideas, and memes?<br /><br />AuctionShelter is a London based tech start-up set on offering global buyers with a new way to bid on real estate deals. Backed by a successful Angel investor with a winning formula, we have been able to identify an area of the property market that has enormous potential.<br /><br />AuctionShelter has a fast paced work environment and we seek talented people who crave learning new skills and aren't afraid to tackle big projects. As an intern you will get to work with a variety of our executive staff and will work on real projects that will help us grow.  <br /><br />Our ideal candidate is someone who walks into a room of people and can’t leave without making a few friends. Someone who is obsessed with branding, marketing, social media, blogging and is creative and thoughtful when interacting with online communities and building relationships.<br /><br />What you’ll do:<br /><br />For the duration of the internship, candidates will be assisting with ideation of creative assets, in support of client campaigns and internal marketing efforts. Interns will come away from the experience with first-hand knowledge of agency best practices.<br />Candidates will be working closely with the creative content team on real world client deliverables by:<br /><br />•    Define our editorial agenda on all content that goes out to clients across blogs, emails, podcasts, video, social, our website and one off campaigns.<br />•    Blog content for AuctionShelter’s news blog and social media<br />•    Helping to develop content templates for the AuctionShelter team<br />•    Helping to write content for client presentation decks for the creative team (intro pages, next step pages, project descriptions, etc)<br />•    Researching on topics and data for senior writers to create content for clients<br />•    Lead generation through online research <br />•    Promotion and outreach<br />•    Streamlining the process of finding, communicating with, processing, and evaluating potential clients<br /><br />Who we are looking for:<br /><br />•    Junior, Senior, or recent graduate pursuing a B.A. in Advertising, Creative Writing, English, Journalism, or Communications or equivalent course in your country, business, marketing, computer science and technical roles.<br />•    A love of brands creative content and copy.<br />•    Buckets of ambition, a passion for your craft and plenty of hustle.<br />•    Research on market, able to understand the trends<br />•    Proactive and able to take ownership of the assigned tasks<br />•    A passion for Audio Editing, Audio clean up, editing Podcasts, Podcast set up, video editing and blogging<br /><br />Benefits & Perks:<br /><br />AuctionShelter is a young and international team, where you will have the opportunity to develop in a dynamic environment. Our colleagues are highly motivated, open-minded people, self-driven and with a great team spirit. You get access to the newest and most innovative technologies.<br /><br />• Fun, fast-paced, team oriented environment<br />• Remote and flexible working<br />",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 4:39:27 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
