{
 "items": [
  {
    "id": "dcqHwkRcR0Oz15Tr4_rOJg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/jobs/5709-content-marketing-specialist",
    "title": "SUCCESS agency: Content Marketing Specialist",
    "content": "<div>  <div>    <h2>Content Marketing Specialist</h2>      <h4>Posted Nov  8</h4>    <h3>      <span>SUCCESS agency</span><br>      <span>Headquarters: West Palm Beach</span><br>        <a href='http://www.successagency.com/di/career/content-marketing-specialist/' rel='nofollow'>http://www.successagency.com/di/career/content-marketing-specialist/</a>    </h3>  </div>    </div>  <div>    <div><span>Join our team of remote marketing professionals where we put a top priority on growth... not just growth of the agency and our clients, but most importantly the growth of each team member.</span></div><div><span><br></span></div><div><span>Content is essential to an effective digital marketing strategy. The Content Marketing Specialist leads the creation of marketing-oriented content for use throughout all primary digital marketing strategies.&nbsp;</span></div><div><br></div><div><strong>Responsibilities</strong></div><div><br></div><ul><li>Create educational content for client marketing programs such as blog posts, ebooks, and presentations</li><li>Create email marketing campaigns such as newsletters, special offers, and autoresponders</li><li>Create direct-response content with the intent of inspiring a user to take a specific action</li><li>Plan website content and organize into an appropriate sitemap (architecture)</li><li>Coordinate internally for the publishing of content and at times taking the lead on publishing content yourself</li><li>Evaluate effectiveness of content using tools such as Google Analytics and Email Reports</li><li>Identify opportunities to optimize content for higher performance, optimize, and measure impact</li><li>Brainstorm content assets to be created for the purposes of building links into a website</li><li>Plan content calendars</li><li>Create and manage content blueprint tools such as Buyer Personas, Voice &amp; Tone, and other tools that align all content in the most effective and accurate direction for clients</li><li>Research topics by interviewing clients, interviewing outside experts, and referencing other sources and documenting this research for future use</li><li>Be the primary team resource for understanding a client’s company, products, services, and industry.</li><li>Creation of messaging such as taglines and service descriptions</li></ul><div><strong><br></strong></div><div><strong>Objectives</strong></div><div><br></div><ul><li>Create content that our clients’ prospects, leads, and clients find highly valuable</li><li>Create content that inspires users to take a desired action</li><li>Continually evaluate, optimize, and measure content performance</li><li>Take care of details ensuring content is accurate, on-point, and requires limited internal back-and-forth and correction</li></ul><div><strong><br></strong></div><div><strong>Requirements</strong></div><div><br></div><ul><li>2-3+ years of experience in full-time content creation</li><li>Proven experience in writing content on a wide variety of topics</li><li>High and intuitive people skills</li><li>Well-organized with a customer-oriented approach</li><li>High detail orientation</li><li>Ability to create content that is accurate, valuable, engaging and goal-oriented</li><li>High quality assurance standards for finalized content (24 out of 25 finalized content pieces should include zero grammatical errors or typos).</li><li>A process-oriented approach to content creation through phases including goal setting, research, planning, writing, quality assurance, publishing, evaluation, and optimization.</li><li>Strong business writing &amp; communication skills</li><li>Friendly can-do personality</li><li>Strong content formatting skills</li></ul><div><strong><br></strong></div><div><strong>What It’s Like Working Remotely</strong></div><div><br></div><ul><li><strong>Work from anywhere</strong>: work from your house in Kansas, flat in Edinburgh, or hostel in Bangkok (members of our team have done all three). Some of our team members enjoy the convenience of working at home. Others enjoy living the “Digital Nomad” life traveling the USA and the world. The only requirement? Great Wifi. And for the Account Manager position, you'll be on client calls often, so wifi and connectivity is a must.</li><li><strong>Equipment</strong>: SUCCESS agency provides you with a laptop, secondary monitor, headset, and reimburses you for internet.</li><li><strong>Structure</strong>: while our team works from anywhere, we are a high performance team that collaborates intensively internally and externally. This requires structure such as regular morning kick-off video calls and communication via Slack. This is not a freelance gig. It’s a full-time position in a growing team.</li></ul><div><strong><br></strong></div><div><strong>Location</strong></div><div><br></div><ul><li>Location:&nbsp;Remote</li><li>USA / Canada Residents: Candidates for this position will be USA or Canadian residents</li></ul><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply at <a href='http://www.successagency.com/di/career/content-marketing-specialist/' rel='nofollow'>http://www.successagency.com/di/career/content-marketing-specialist/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 1:12:17 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_100",
      "TITLE1_writer"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "-uUAPHlgSO2dv36s62Uvnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62495",
    "title": "Copywriter - eCommerce/Dropship",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>SaleHoo is a New Zealand-based company creating online tools and training for people looking to start their own online businesses. We’re based in Christchurch, but the majority of our team work remotely from various places around the world.<br>We're looking for a talented individual to join us in writing content for our popular wholesale directory, SaleHoo.com<br>Our directory contains an educational section covering topics including eBay selling, Amazon selling, what products sell well online, how to market physical products online, importing and shipping and so on.<br>We're looking for someone with experience with these topics and industry to help us write lessons, scripts and blog posts (and whatever else turns up!).<br></p><ul><li>You should be experienced in at least several aspects of this industry: For instance, online selling, wholesale sourcing, marketing physical products.<br></li><li>You must be able to break a task down and get right to the heart of it: No lessons full of fluff, no beating around the bush. Our users want clear-as-day, step-by-step, hype-free lessons.<br></li><li>You should be a clear thinker: Able to objectively analyse a piece and ask yourself whether it is truly succeeding in what it's trying to do, and not afraid to overhaul something that isn't working.<br></li><li>You must be good at paying attention to detail and checking facts (things change rapidly in this industry!)<br></li><li>And obviously, your technical grasp of English must be good and things you write must be readable and make sense. The &quot;making sense&quot; part is the most important. We can handle the odd erroneously-placed apostrophe, so long as the heart and structure of the writing is A-OK!<br>This is a great opportunity to flex your writing muscles. While a lot of the content can be reasonably technical, the way we write the content has to be friendly, entertaining, personable and accessible to a wide audience.<br>While qualifications or experience in writing or journalism would be valuable, we're more interested in industry knowledge and your ability to write with clarity. If you think you've got the spark we're after... then we want to hear from you.<br>Please note: You <em>must</em> be able to provide at least 3-4 published pieces of industry-related content on authority sites that you have created, under your name.<br>Neat things about working with us:<br></li><li>Flexible hours (we are happy to discuss full-time, part-time, contracting for the role).<br></li><li>Work from home (or from our Christchurch office)<br></li><li>Relaxed, ego-free, family-friendly work culture<br>If you'd like to come work in our Christchurch office in Ferrymead, you also get:<br></li><li>Weekly Friday BBQ (or sushiBQ, or ThaiBQ)<br></li><li>Novelty coffee mugs<br></li><li>An extremely comfortable chair<br></li><li>Tap dancing seagulls</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 12:19:21 AM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "eloI0COIRk2bNCxPlowZpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153534/technical-writer-vividcortex?a=PupDQlctMiI",
    "title": "Technical Writer at VividCortex (Chicago, IL) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Information Services, Information Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the role</strong></p><p>The Technical Content Writer and Journalist develops the voice of VividCortex to create thought leadership content around business, strategy, technology, and future trends. You assist in the execution and distribution of content through various content vehicles, such as company blogs, whitepapers, ebooks, and product videos to help prospects fully understand the value of VividCortex in an engaging, brand-centric manner. You form strong partnerships with leaders inside and outside the organization, and help them turn their ideas into compelling content.&nbsp;You will report to the CMO and are a key member of our Marketing team.</p><p><strong>Key Responsibilities:</strong></p><ul><ul><li>Brainstorm, research, write, and distribute articles, blog posts, case studies, eBooks, whitepapers, and more, that are authoritative, clear, and informative and meets the needs of both key stakeholders and unique personas and user buyer journey stages.</li><li>Continually work with the extended marketing team to measure reader engagement, and iterate to improve content definition, distribution, and performance.</li><li>Engage with development team routinely to gain a full understanding of recent product releases and newest features to better understand ways to position VividCortex in the market.</li><li>Assist with the creation and development of print collateral such as brochures for tradeshows or events.</li><li>Work with customers for case studies/testimonials.</li><li>Balance content distribution efforts, producing a regular cadence of blog content, repositioning high-performing pieces, and managing the development long-tail content assets.</li></ul></ul><p><strong>Requirements:</strong></p><ul><ul><li>History of working with B2B organizations developing technology and business content in a regular cadence, or tech journalism experience.</li><li>Skilled and polished writer who can transform ideas and interviews into content quickly and efficiently.</li><li>Passion to combine strong writing skills with a love of technology.</li><li>Interested in the world of business and technology and love to read and write about it.</li><li>Ability to build a pipeline of successful content based on interviews with thought leaders.</li><li>Experience writing regular blog content that sparks a conversation.</li><li>Academic or professional experience in technical writing and or journalism.</li><li>Located in the Washington, DC or Chicago area, and available for occasional travel.</li></ul></ul><p>At VividCortex, we want to build a diverse team because it's the right thing to do, and because we believe diversity is strength. We encourage applicants from all walks of life and all backgrounds.</p><p><strong>Note to Agencies and Recruiters:</strong>&nbsp;VividCortex has a strict company policy against engaging with unsolicited contact from agencies or recruiters. &nbsp;Unsolicited resumes and leads are property of VividCortex and VividCortex explicitly denies that any information sent to VividCortex can be construed as consideration.</p>                    </div>                            <h2>                About VividCortex            </h2>            <div><p>VividCortex is a modern&nbsp;database monitoring platform that gives developers and DBAs deep visibility into the database. Our solution is delivered as software-as-a-service and helps our customers see and analyze the work their databases are doing in great&nbsp;detail. It addresses critical pain points in measuring and managing today's large, distributed, diverse storage tiers composed of multiple different clustered products, all working together.<br><br>Founded in 2012 by noted database experts, and backed by major venture capital and high-wealth individuals, VividCortex is headquartered in Charlottesville, Virginia with a remote team in Montevideo, Uruguay. With more than 750% year-over-year growth, VividCortex is a company on fire!<br><br> We have a fast-growing customer base of well-known companies, and a tremendous reputation in our market for delivering a high-quality, innovative solution for database performance problems that are common in tens of thousands of small and large organizations.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Unlimited paid leave for any purpose (incl. maternity and paternity)                            </div>                            <div>                                 Excellent medical insurance and dental benefits                            </div>                            <div>                                 Equity                            </div>                            <div>                                 New MacBook or other Mac computer, as best suited to the position                            </div>                            <div>                                 Gym membership. We have quite a few CrossFitters at the office                            </div>                            <div>                                 A nerdy sense of humor, tax-free                            </div>                            <div>                                 Premium coffee, frequent team meals, snacks, and more                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_blogs",
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown",
      "TECH2_technical-writer",
      "TECH2_writer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "blogs",
      "technical-writer",
      "writer"
    ]
  },
  {
    "id": "SKwbhdhzREGFYnMV12tPQw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/150457/technical-writer-auth0?a=OsqTWuTxzfG",
    "title": "Technical Writer at Auth0 (Buenos Aires, Argentina) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you a developer who is always trying to learn new things? Every time a new technology or framework is released, do you try it out and build an open-source repository on GitHub with the code sample? If this sounds like you, we’d love for you to work with us!</p><p>We are looking for writers to join our renowned team and continue taking our blog to EPIC places! We want people who will help us write amazing blog articles and other types of technical content. You'll be able to write about exciting, popular, and emerging technologies (e.g., Angular, React, Passwordless, etc.).<br><br></p><p><strong>YOUR RESPONSIBILITIES WILL BE:</strong></p><ul><li>Research the latest technologies and stay on top of everything that's new.</li><li>Write blog posts that will be helpful to thousands of people.</li><li>Write user documentation, tutorials, landing pages, ebooks, and more to help people use Auth0.</li><li>Edit, clarify, and proofread documents written by others, and mentor non-writers on ways to improve their writing skills.</li></ul><p><strong>WHAT WE NEED FROM YOU:</strong></p><ul><li>Experience as a software developer.</li><li>Demonstrable experience writing blog posts or documentation. If you publish articles in your own blog, this is a great example.</li><li>Excellent skills in writing or translating complex technical and business subjects to a variety of audiences.</li><li>Ability to be self-directed and effective working independently, yet equally comfortable contributing and communicating in a global team environment.</li><li>Ability to estimate and scope documentation assignments.</li><li>Fluency in written US English.</li></ul><p><strong>BONUS POINTS</strong></p><ul><li>You have open-source work such as GitHub projects you can share.</li><li>You write your own technical blog.</li><li>Extra consideration if you can demonstrate your skills by rewriting one of our docs. Send us a <a href='https://github.com/auth0/docs' rel='nofollow'>pull request</a>!</li></ul><p>We are an equal opportunity employer and value diversity at our company.</p>                    </div>                            <h2>                About Auth0            </h2>            <div><p>Ultimately, we strive for an internet with fewer&nbsp;passwords. Our goal is to make authentication and authorization easy, powering the login boxes of every application in the world. We're looking for people to join us on this journey.</p><p>We're looking for people who care deeply about quality, team work and want to build software that people love.</p><p>Benefits vary by location. In Buenos Aires, Argentina, we offer:</p><ul><li>Flexible work hours</li><li>Healthcare coverage</li><li>MacBook Pro Retina 16GB</li><li>Embrace Distributed Work</li></ul><p>Visit us at <a href='http://auth0.com' rel='nofollow'>http://auth0.com</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_php",
      "TECH2_c#",
      "TECH2_javascript",
      "REMOTE1_100",
      "TITLE1_writer",
      "TECH2_java",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c#",
      "java",
      "javascript",
      "php",
      "reactjs"
    ]
  },
  {
    "id": "3De0J9inS3uhhkZOJ0Jorw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157592/technical-content-author-must-be-uk-based-bybox?a=QQN2W1z2r0k",
    "title": "Technical Content Author - Must be U.K. based at ByBox () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Logistics &amp; Distribution, Technical Services</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Job title: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Technical Content Author</p><p>Reporting to: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; Business Interface Manager</p><p>Location: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; <strong>Oxford (Home-based until January 2018)</strong></p><p><strong>Background</strong></p><p>&nbsp;ByBox is the leading provider of Field Support Logistics using its box-based distribution network in the UK. ByBox have done this using its world-beating electronic-box technology and in-house developed software platform to provide the most sophisticated field service solution in the UK. The ByBox solution disrupted the market by increasing service while reducing cost for customers, so that it now dominates the UK market.</p><p>ByBox is now taking its technology globally by building on its already impressive software development team to build a technology team capable of delivering electronic box-based solutions to a global market. The ByBox suite of mobile, web, and client-based applications cover:</p><ul><li>Bluetooth electronic lockers</li><li>Multi-tenanted customer web-applications</li><li>End-user mobile applications</li><li>Logistics support &amp; label/barcode generation</li><li>Warehouse management systems</li><li>Customer-facing order portals</li><li>Customer and 3<sup>rd</sup>-party EDI</li><li>In-field mobile device and scanner solutions</li><li>Automated testing facilities</li><li>And much, much more</li></ul><p><strong>The Position</strong></p><p>ByBox requires an experienced, enthusiastic, and highly motivated Software professional to take on the new role of Technical Content Author at ByBox, in the Software Development department. As the first person to fill this role you will be expected to bring your experience to the team and influence how technical documentation fits into the Software Development Lifecycle in ByBox.</p><p>Until now technical documentation at ByBox has largely been in the form of written documents, been completed by a range of people, and of a mixed quality, but as our team and Software Portfolio grows the need for high-quality technical content has also increased, and deserves dedicated attention from a professional Technical Content Author. This is especially important now, as much of the documentation will be customer-focused; therefore, content must be designed and delivered with an emphasis on presentation, accuracy, clarity, and usability.</p><p>With the support of the development team (in particular the business analysts and system specialists) you will be responsible for owning and maintaining the software team's product catalogue/portfolio and producing user guides (including technical installation instructions), and content for the ByBox marketing team. Working closely with Product Owners you will produce professional documentation for our key products. You will also drive the adoption of the latest mediums for knowledge transfer, such as through e-learning tools, online video, and other techniques. The Software Development team will look to you for guidance on documentation strategy, techniques, templates, and media content. You will also have overall responsibility for guiding the structure and standards in our internal Knowledge Base Wiki.</p><p>Your duties will include:</p><ul><li>Own, develop and maintain the content of ByBox Software Product Catalogue/Portfolio, producing content suitable for both internal and external audiences.</li><li>Be involved from the early stages of projects to understand the solution, and to understand the documentation/training requirements of the end-users.</li><li>Produce appropriate technical content for the end-users of our software, including Users&nbsp; Guides, technical installation instructions, and integration/API guides.</li><li>Understand the configuration and use-cases of the ByBox products to be self-reliant in producing appropriate content (e.g. screenshots, screencasts, videos etc.)</li><li>Drive the adoption of other techniques such as e-learning and online videos, or other media.</li><li>Guide the standardization of documentation and other content and help define our documentation strategy.</li><li>Gather feedback on the usability of content from internal and external customers, and regularly review content and processes to ensure best practices.</li><li>Work with technical team to make products easier to use and thus need fewer instructions.</li><li>Keep up to date with changing technologies, developments and trends in the industry, attending training courses as necessary.</li><li>Work closely with the ByBox Marketing team to produce suitable content for their Marketing material.</li></ul><p>You will receive full domain training where necessary; and experts in all areas of existing systems will be on hand throughout projects™ lifetimes and beyond.</p><p>ByBox is opening a new 'Tech Hub' office in Oxford (opening 2018), and this role will be based from this office, which will be a key place for knowledge transfer, testing our products and utilising demo systems. However, we have a flexible working culture, and with mutual agreement you can spend a proportion of your time working from home. There will also be some travel to other sites in the UK, namely our facilities in Coventry and Milton Keynes. All technical team members are connected remotely and communication is fully established, effective and easy. Face to face meetings in any one of our offices can be arranged easily as and when required.</p><p>Although rare, some out of hours working may be required as part of understanding the different ByBox domains (particularly operational).</p><p><strong>The Person</strong></p><p>The successful candidate will be an experienced technical author/writer with the following experience and qualities:</p><ul><li>Background of working in Software Development teams creating software user documentation, user manuals, release notes, training courses / materials and other documents.</li><li>Outstanding written communication skills, with strong literacy, and a clear and concise writing style.</li><li>Creative, with a flair for turning technical subjects and jargon into easily understood content or training material.</li><li>Be a clear and confident communicator; able to interact effectively with a distributed team of other technical experts and senior representatives.</li><li>Passion and aptitude in technology and technical techniques, particularly content authoring tools.</li><li>Be enthusiastic and pro-active in learning the technologies and capabilities of ByBoxâ€™ existing software.</li><li>An exceptional eye for detail with a passion for accuracy.</li><li>Worked with both internal and external stakeholders to define suitable documentation requirements.</li><li>Be a clear and confident communicator; able to interact effectively with a distributed team of other technical experts and senior representatives.</li><li>Ability to lead and influence a variety of team members with the goal of fulfilling our documentation strategy.</li><li>Be self-motivated, positive, self-disciplined, reliable, trustful, honest and collaborative.</li><li>Capable of working effectively with minimal supervision.</li></ul><p><strong>Desirable qualifications and experience:</strong></p><ul><li>Qualifications in English, Communications, Computer Science, or other relevant subjects.</li><li>Experience in the logistics industry, or knowledge of the ByBox domain.</li><li>Experience working with agile software development methodologies.</li></ul><p><strong>Application Process:</strong></p><p>&nbsp;Please apply in writing to the Recruitment Department including a covering letter and up to date CV</p><p><strong>NOTE</strong>:</p><p>External candidates will be required to supply details of two business referees in senior positions, who will be contacted by the Company after the first interview. Applicants must be eligible to live and work in the UK.</p>                    </div>                            <h2>                About ByBox            </h2>            <div><p>ByBox is leading the way in box-based logistics. Electronic box networks are doing to distribution what ATM's did to retail banking: Increased service, reduced cost.<br> <br> ByBox uses its World-beating electronic box technology as a platform for the most sophisticated field service solution in the UK. ByBox is also the only UK supplier of box-based consumer solutions to the global postal market.<br> <br> As one of the fastest growing technology companies in the UK, ByBox boasts an impressive software development team. Their current suite of mobile, client and web-based applications cover:</p><p>·Mobile Apps</p><p>·Bluetooth &amp; Electronic lock-box integration</p><p>·Customer-facing web applications</p><p>·EDI &amp; Customer integration</p><p>·Transport &amp; distribution management</p><p>·Warehouse management</p><p>·Label and barcode generation</p><p>·Administrative services</p><p>·…and much more</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Home-based working for most of the Technology team                            </div>                            <div>                                 Flexible working hours                            </div>                            <div>                                 High-end kit provided including all software tools required                            </div>                            <div>                                 Training and development budget provided                            </div>                            <div>                                 25 days leave a year rising to 30 days                            </div>                            <div>                                 Several offices in UK and travel expenses covered                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_author",
      "TECH2_c#",
      "TZ_Europe",
      "REMOTE1_100",
      "TECH2_testing",
      "TITLE1_writer"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "author",
      "c#",
      "testing"
    ]
  },
  {
    "id": "S9xT-9UrRA6Hkh-9tSYlbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15602042",
    "title": "ClearVoice | Front-End Software Engineer | Phoenix, AZ or REMOTE (USA) | https://www.clearvoice.com | Full Time ClearVoice is a Content Marketing Platform and ...",
    "content": "<div>                  <span>ClearVoice | Front-End Software Engineer | Phoenix, AZ or REMOTE (USA) | <a href='https://www.clearvoice.com' rel='nofollow'>https://www.clearvoice.com</a> | Full Time<p>ClearVoice is a Content Marketing Platform and Marketplace. We make creating great content easy for everyone. We have indexed over 100M online articles and have identified and ranked 200k+ authors. We use this index to power our transparent freelancer marketplace. We supply all engineers with 15&quot; Macbook Pros and quality tools. Competitive pay, fantastic weather and low cost of living in Phoenix (or wherever you live)!</p><p>Stack:React</p><p>Ruby/Rails - Platform API</p><p>Python - Search Index</p><p>AWS</p><p>Currently looking to hire:</p><p>* Front-End Software Engineer ($100k-$110k)</p><p>Mandatory Requirements:</p><p>* 2+ years experience as a front end developer</p><p><a href='https://www.workable.com/j/7FC989736C' rel='nofollow'>https://www.workable.com/j/7FC989736C</a></p><p>PS: Phoenix also has neighborhoods with Cox Gigablast - full duplex gigabit internet access :)</p><p>Interested in another role not posted?</p><p>E-mail jeff __4t__ clearvoice.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 5:24:05 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "DrlmTP2PR3-8vOpG2qUKTQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/63061/brand-and-communications-editor-intern-at-auctionshelter/",
    "title": "Brand and Communications Editor intern",
    "content": "Are you obsessed with finding and sharing stories online? Do your friends look to you on Facebook and Twitter for the latest trends, ideas, and memes?<br /><br />AuctionShelter is a London based tech start-up set on offering global buyers with a new way to bid on real estate deals. Backed by a successful Angel investor with a winning formula, we have been able to identify an area of the property market that has enormous potential.<br /><br />AuctionShelter has a fast paced work environment and we seek talented people who crave learning new skills and aren't afraid to tackle big projects. As an intern you will get to work with a variety of our executive staff and will work on real projects that will help us grow.  <br /><br />Our ideal candidate is someone who walks into a room of people and can’t leave without making a few friends. Someone who is obsessed with branding, marketing, social media, blogging and is creative and thoughtful when interacting with online communities and building relationships.<br /><br />What you’ll do:<br /><br />For the duration of the internship, candidates will be assisting with ideation of creative assets, in support of client campaigns and internal marketing efforts. Interns will come away from the experience with first-hand knowledge of agency best practices.<br />Candidates will be working closely with the creative content team on real world client deliverables by:<br /><br />•    Define our editorial agenda on all content that goes out to clients across blogs, emails, podcasts, video, social, our website and one off campaigns.<br />•    Blog content for AuctionShelter’s news blog and social media<br />•    Helping to develop content templates for the AuctionShelter team<br />•    Helping to write content for client presentation decks for the creative team (intro pages, next step pages, project descriptions, etc)<br />•    Researching on topics and data for senior writers to create content for clients<br />•    Lead generation through online research <br />•    Promotion and outreach<br />•    Streamlining the process of finding, communicating with, processing, and evaluating potential clients<br /><br />Who we are looking for:<br /><br />•    Junior, Senior, or recent graduate pursuing a B.A. in Advertising, Creative Writing, English, Journalism, or Communications or equivalent course in your country, business, marketing, computer science and technical roles.<br />•    A love of brands creative content and copy.<br />•    Buckets of ambition, a passion for your craft and plenty of hustle.<br />•    Research on market, able to understand the trends<br />•    Proactive and able to take ownership of the assigned tasks<br />•    A passion for Audio Editing, Audio clean up, editing Podcasts, Podcast set up, video editing and blogging<br /><br />Benefits & Perks:<br /><br />AuctionShelter is a young and international team, where you will have the opportunity to develop in a dynamic environment. Our colleagues are highly motivated, open-minded people, self-driven and with a great team spirit. You get access to the newest and most innovative technologies.<br /><br />• Fun, fast-paced, team oriented environment<br />• Remote and flexible working<br />",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 4:39:27 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "LfLONfiLSyuOgm-F8tVZoA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62843",
    "title": "Technical Content Author",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Job title: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Technical Content Author</p><br><p>Reporting to: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; Business Interface Manager</p><br><p>Location: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; <strong>Oxford (Home-based until January 2018)</strong></p><br><br><p><strong>Background</strong></p><br><p>&nbsp;ByBox is the leading provider of Field Support Logistics using its box-based distribution network in the UK. ByBox have done this using its world-beating electronic-box technology and in-house developed software platform to provide the most sophisticated field service solution in the UK. The ByBox solution disrupted the market by increasing service while reducing cost for customers, so that it now dominates the UK market.</p><br><br><p>ByBox is now taking its technology globally by building on its already impressive software development team to build a technology team capable of delivering electronic box-based solutions to a global market. The ByBox suite of mobile, web, and client-based applications cover:</p><br><br><ul><br><li>Bluetooth electronic lockers</li><br><li>Multi-tenanted customer web-applications</li><br><li>End-user mobile applications</li><br><li>Logistics support &amp; label/barcode generation</li><br><li>Warehouse management systems</li><br><li>Customer-facing order portals</li><br><li>Customer and 3<sup>rd</sup>-party EDI</li><br><li>In-field mobile device and scanner solutions</li><br><li>Automated testing facilities</li><br><li>And much, much more</li><br></ul><br><br><p><strong>The Position</strong></p><br><br><p>ByBox requires an experienced, enthusiastic, and highly motivated Software professional to take on the new role of Technical Content Author at ByBox, in the Software Development department. As the first person to fill this role you will be expected to bring your experience to the team and influence how technical documentation fits into the Software Development Lifecycle in ByBox.</p><br><br><p>Until now technical documentation at ByBox has largely been in the form of written documents, been completed by a range of people, and of a mixed quality, but as our team and Software Portfolio grows the need for high-quality technical content has also increased, and deserves dedicated attention from a professional Technical Content Author. This is especially important now, as much of the documentation will be customer-focused; therefore, content must be designed and delivered with an emphasis on presentation, accuracy, clarity, and usability.</p><br><br><p>With the support of the development team (in particular the business analysts and system specialists) you will be responsible for owning and maintaining the software team's product catalogue/portfolio and producing user guides (including technical installation instructions), and content for the ByBox marketing team. Working closely with Product Owners you will produce professional documentation for our key products. You will also drive the adoption of the latest mediums for knowledge transfer, such as through e-learning tools, online video, and other techniques. The Software Development team will look to you for guidance on documentation strategy, techniques, templates, and media content. You will also have overall responsibility for guiding the structure and standards in our internal Knowledge Base Wiki.</p><br><br><p>Your duties will include:</p><br><ul><br><li>Own, develop and maintain the content of ByBox Software Product Catalogue/Portfolio, producing content suitable for both internal and external audiences.</li><br><li>Be involved from the early stages of projects to understand the solution, and to understand the documentation/training requirements of the end-users.</li><br><li>Produce appropriate technical content for the end-users of our software, including Users&nbsp; Guides, technical installation instructions, and integration/API guides.</li><br><li>Understand the configuration and use-cases of the ByBox products to be self-reliant in producing appropriate content (e.g. screenshots, screencasts, videos etc.)</li><br><li>Drive the adoption of other techniques such as e-learning and online videos, or other media.</li><br><li>Guide the standardization of documentation and other content and help define our documentation strategy.</li><br><li>Gather feedback on the usability of content from internal and external customers, and regularly review content and processes to ensure best practices.</li><br><li>Work with technical team to make products easier to use and thus need fewer instructions.</li><br><li>Keep up to date with changing technologies, developments and trends in the industry, attending training courses as necessary.</li><br><li>Work closely with the ByBox Marketing team to produce suitable content for their Marketing material.</li><br></ul><br><br><p>You will receive full domain training where necessary; and experts in all areas of existing systems will be on hand throughout projects™ lifetimes and beyond.</p><br><br><p>ByBox is opening a new 'Tech Hub' office in Oxford (opening 2018), and this role will be based from this office, which will be a key place for knowledge transfer, testing our products and utilising demo systems. However, we have a flexible working culture, and with mutual agreement you can spend a proportion of your time working from home. There will also be some travel to other sites in the UK, namely our facilities in Coventry and Milton Keynes. All technical team members are connected remotely and communication is fully established, effective and easy. Face to face meetings in any one of our offices can be arranged easily as and when required.</p><br><br><p>Although rare, some out of hours working may be required as part of understanding the different ByBox domains (particularly operational).</p><br><br><p><strong>The Person</strong></p><br><br><p>The successful candidate will be an experienced technical author/writer with the following experience and qualities:</p><br><br><ul><br><li>Background of working in Software Development teams creating software user documentation, user manuals, release notes, training courses / materials and other documents.</li><br><li>Outstanding written communication skills, with strong literacy, and a clear and concise writing style.</li><br><li>Creative, with a flair for turning technical subjects and jargon into easily understood content or training material.</li><br><li>Be a clear and confident communicator; able to interact effectively with a distributed team of other technical experts and senior representatives.</li><br><li>Passion and aptitude in technology and technical techniques, particularly content authoring tools.</li><br><li>Be enthusiastic and pro-active in learning the technologies and capabilities of ByBoxâ€™ existing software.</li><br><li>An exceptional eye for detail with a passion for accuracy.</li><br><li>Worked with both internal and external stakeholders to define suitable documentation requirements.</li><br><li>Be a clear and confident communicator; able to interact effectively with a distributed team of other technical experts and senior representatives.</li><br><li>Ability to lead and influence a variety of team members with the goal of fulfilling our documentation strategy.</li><br><li>Be self-motivated, positive, self-disciplined, reliable, trustful, honest and collaborative.</li><br><li>Capable of working effectively with minimal supervision.</li><br></ul><br><br><p><strong>Desirable qualifications and experience:</strong></p><br><ul><br><li>Qualifications in English, Communications, Computer Science, or other relevant subjects.</li><br><li>Experience in the logistics industry, or knowledge of the ByBox domain.</li><br><li>Experience working with agile software development methodologies.</li><br></ul><br><br><p><strong>Application Process:</strong></p><br><p>&nbsp;Please apply in writing to the Recruitment Department including a covering letter and up to date CV</p><br><p><strong>NOTE</strong>:</p><br><p>External candidates will be required to supply details of two business referees in senior positions, who will be contacted by the Company after the first interview. Applicants must be eligible to live and work in the UK.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 16, 2017 4:21:40 PM",
    "tags": [
      "TZ_Europe",
      "REMOTE1_100",
      "TITLE1_writer"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "nbovxGryTiaV4fB6W1jQ6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5527-content-and-search-marketing-specialist",
    "title": "LitCharts LLC: Content and Search Marketing Specialist",
    "content": "<div>  <div>    <h2>Content and Search Marketing Specialist </h2>      <h4>Posted Oct 11</h4>    <h3>      <span>LitCharts LLC</span><br>      <span>Headquarters: New York</span><br>        <a href='https://www.litcharts.com' rel='nofollow'>https://www.litcharts.com</a>    </h3>  </div>    </div>  <div>    <div>Created by the original editors of SparkNotes and No Fear Shakespeare, LitCharts (www.litcharts.com) are the world’s best literature study guides, with innovative features like color-coded theme tracking, data visualizations, beautifully designed chart-based downloadable PDF versions, and much more. Millions of students, teachers, and general interest readers use the LitCharts website and mobile apps every month.</div><div><br></div><div>We’re looking for someone with expertise in content marketing and SEO to grow our organic search traffic by expanding our backlink profile, brand awareness, and outreach marketing efforts.&nbsp;</div><div><br></div><div><b>Overall Responsibilities</b></div><div><b><br></b></div><div>You will focus 100% of your work on improving LitCharts’ organic search traffic and performance on search engine results pages via a combination of strategies, such as:</div><div><br></div><ul><li>Performing keyword research to determine our most impactful content marketing and marketing outreach opportunities.<br></li><li>Assessing the performance of your campaigns using tools such as Google Analytics, Mixpanel, Ahrefs, and so on.<br></li><li>Researching marketing outreach opportunities with influencers and communities in the EdTech space.<br></li><li>Building relationships with teachers, students, librarians and other potential influencers and brand ambassadors.<br></li><li>Developing, testing, and implementing our content marketing strategy on an ongoing basis.</li></ul><div><br></div><div><b>Experience and Expertise We’re Looking For</b></div><div><b><br></b></div><div>The ideal candidate for this role will combine a fluent understanding of SEO with extensive experience creating SEO-driven outreach and content marketing campaigns. Your specific areas of expertise and experience should include the following:</div><div><br></div><div><b>Required</b></div><div><br></div><ul><li>Expertise in all SEO fundamentals, from keyword research to backlinks and other optimization strategies.<br></li><li>Experience and a successful track record of designing, implementing, and assessing the performance of SEO link-building and content marketing campaigns.<br></li><li>Experience writing and editing original education-focused content for the web.<br></li><li>Excellent written and verbal communication skills and a passion for evangelizing strangers about new products, with no fear of being rejected or ignored.&nbsp;&nbsp;</li></ul><div><br></div><div><b>Not required but a big plus…</b></div><div><br></div><ul><li>A familiarity with the EdTech community and a passion for books, reading, and educational technology in general.<br></li><li>Experience working remotely and independently with a distributed team.<br></li></ul><div><span><br></span></div><div><b>Details about this Position</b></div><div><b><br></b></div><div>The Content and Search Marketing Specialist role is a full-time position with the following perks and benefits:</div><div><br></div><ul><li>Competitive salary and performance-based bonus.<br></li><li>Comprehensive healthcare coverage, including medical, dental, and vision.<br></li><li>Ability to work from anywhere with flexible hours.<br></li><li>Generous paid holiday and vacation policy.<br></li><li>The opportunity to work at a fast-growing startup with a small team that has a proven record of success.</li></ul><div><br></div><div>Please note that all applicants must be legally authorized to work in the United States and must pass a background check prior to being hired. Thanks for your interest!</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply for this position, please email the following to <a href='mailto:seojob@litcharts.com' rel='nofollow'>seojob@litcharts.com</a>:(1) Your latest resume or LinkedIn profile. (2) 2-3 writing samples that best convey your ability to create compelling content for the web. Links or PDFs are fine. (3) A list of your top five favorite websites with a brief explanation of why you like them. (4) A few sentences explaining specifically why this position appeals to you.We do not reply to inquiries from agencies or placement firms.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 12:02:51 AM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "8XdSkLnTRsGT89LaoXmbkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5486-content-and-search-marketing-specialist",
    "title": "Hubstaff: Content and Search Marketing Specialist",
    "content": "<div>  <div>    <h2>Content and Search Marketing Specialist</h2>      <h4>Posted Oct  5</h4>    <h3>      <span>Hubstaff</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://hubstaff.com/' rel='nofollow'>https://hubstaff.com/</a>    </h3>  </div>    </div>  <div>    <div>Hubstaff runs a blog, a website and various related web properties. Organic search is driving traffic to our websites, some of that traffic buys our SaaS time tracking and project management products services.The main website and blog perform well across a range of keywords, and we have a plan to increase that further.</div><div><br></div><div></div><div>We want to grow traffic to the website by understanding and meeting user search intent via good onsite and offsite SEO.</div><div><br></div><div></div><div>Choosing and optimising for keywords in a conversion focused way has recently been formalised into a process and is largely Data driven. That process requires someone to run and improve it end to end. We have v1 of that process, and are looking for the right person to run it!</div><div><br></div><div></div><div>Areas of Responsibility:</div><div><br></div><div></div><div>SEO. Your sole responsibility is SEO. Your focus will 100% on driving traffic through organic search. You will run the existing process, and work with the head of SEO, and the content team to iterate and improve on it over time. We will provide all the tools, and guidance you need.</div><div><br></div><div></div><div>This role requires someone who is comfortable with communicating with many different types of people, from skyping developers, to writing content, and replying to link requests etc...</div><div><br></div><div></div><div>The process In Pre-production:</div><div><br></div><div></div><ul><li>Keyword Research, Data Gathering, Assessing keywords and pages according to a set of guidelines and metrics<br>Creating recommendations for actions on new keyword topics, Managing potential SEO issues such as cannibalization.</li><li>Managing a list of prioritised SEO content topics, and feeding the content production team with these topics</li><li>Contributing to SEO content specifications</li><li>Setting up using keyword to rank tracking</li><li>Providing ongoing optimisation recommendations for existing Keywords</li></ul><div></div><div><br></div><div>In Post-production:</div><div><br></div><div></div><ul><li>Following a checklist for all new content to help amplify content’s performance in search</li><li>Do some Basic Link building (where required)</li><li>Optimizing page content</li><li>Monitoring of Rankings using SemRush</li><li>Casual Monitoring of Conversions (woopra)</li><li>Managing onPage and OnSite changes to optimize post, such as internal linking.</li></ul><div></div><div><br></div><div>Ideal Candidate:</div><div><br></div><div></div><div>The ideal candidate is a smart motivated junior to exec level SEO who must:</div><div><br></div><div></div><ul><li>Have good written english and excellent communication skills.</li><li>Have experience in keyword research.</li><li>Have experience using google search console</li><li>Understand basic formulas and enjoys using google sheets (or excel)</li><li>Understand technical SEO principles</li><li>Understand content focused SEO principles</li><li>Functional HTML knowledge</li><li>Have experince with google analytics</li><li>Have experience building links</li><li>Focus on deliverables and output</li></ul><div></div><div><br></div><div>Nice to haves:</div><div><br></div><div></div><ul><li>Experience working in SaaS or for digital products is bonus.</li><li>Experience marketing, in or using, time tracking and project management tools</li><li>Experience using SEMRush and Woopra</li><li>Familiar working in Sprints in Trello like environments</li></ul><div></div><div><br></div><div>The remote team:</div><div><br></div><div></div><div>Hubstaff is a 100% remote company and this is a remote working role, so you must be confident and able to demonstrate that you can work independently, and communicate efficiently with team members in USA, Canada, Portugal, UK, Romania, and India.</div><div><br></div><div></div><div>You must be available to work on hours with a overlap with UK and USA where your main contacts will be. The flip side of this is you get freedom to work from where you like, when you like, and focus on being productive rather than having a lot of meetings.</div><div><br></div><div></div><div>Ongoing:</div><div><br></div><div></div><div>This role is an ongoing one, reporting to the marketing operations manager, and founders. We are looking for someone to join our team. We are freelancer and contractor friendly, but need someone who is committing the majority of their time to us, long term.</div><div><br></div><div></div><div>We expect the role to provide 25 to 40 hours a week, but the total amount depends on you, and can adapt over time.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://talent.hubstaff.com/jobs/content-and-search-marketing-specialist' rel='nofollow'>https://talent.hubstaff.com/jobs/content-and-search-marketing-specialist</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 5, 2017 2:56:25 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "_gtwnLfdRc6FIZNHT0e42g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3909-lead-technical-writer-linux-foundation",
    "title": "Lead Technical Writer @ Linux Foundation",
    "content": "<h2>              Lead Technical Writer<small> @ Linux Foundation</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-04 20:15</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Linux Foundation Overview</strong></p><p>The Linux Foundation is creating the greatest shared technology investment in history by enabling open source collaboration across companies, developers and users. We are the organization of choice to build ecosystems that accelerate open technology development and commercial adoption.</p><p><strong>Cloud Native Computing Foundation Overview</strong></p><p>Cloud Native Computing Foundation is creating and driving the adoption of a new computing paradigm that is optimized for modern distributed systems environments capable of scaling to tens of thousands of healing multi-tenant nodes. Cloud native systems will be containerized, dynamically orchestrated and microservices-oriented. CNCF currently hosts Kubernetes, Prometheus, OpenTracing, fluentd, linkerd, gRPC, CoreDNS, containerd, rkt and CNI. For more information: <a href='https://www.cncf.io/' rel='nofollow'>https://www.cncf.io/</a>.</p><p><strong>Position Overview</strong></p><p>Technical writers take complex information and communicate it clearly, concisely, and accurately without relying on technical or corporate jargon. Technical writers at the Cloud Native Computing Foundation (CNCF) are a key link between engineers, marketing associates, community managers, and external developers, tying together many vital but disparate parts of the developer ecosystem. As a Lead Technical Writer, you will lead an external team of technical writers from different organizations aligned around CNCF community. Also, you will juggle a variety of projects, from reading and writing example code, to updating API reference docs and creating new developer guides that teach developers how to use our APIs.</p><p><strong>Minimum Qualifications</strong></p><p>BA/BS degree (In lieu of degree, 4 years relevant work experience). At least 2 years of relevant experience, such as technical writing, product documentation, or online publishing including experience with writing technical customer-facing materials, including online content. Ability to read and understand source code written in Java, Go, Python and/or JavaScript.</p><p><strong>Preferred Qualifications</strong></p><ul><li>4 years relevant work experience, including experience researching and writing documentation for developers (APIs, SDKs, web technologies).</li><li>Ability to write simple to complex code samples in Java, Python, JavaScript, or similar languages.</li><li>Familiarity with developer tools for cloud, containers, and/or open source.</li><li>Proven ability to author in HTML and work with version-control tools such as Git.</li><li>Ability to manage multiple competing priorities in a fast-paced, constantly changing environment.</li><li>Previous experience in an open source community is definitely a plus!</li><li>An open source pragmatist with a community friendly attitude!</li></ul><p><strong>Responsibilities</strong></p><ul><li>Lead a team and diverse community of technical writers aimed to build the best technical documentation for CNCF related projects.</li><li>Write technical documentation for a developer audience, including API references and developer guides.</li><li>Design and organize documentation sets for new Kubernetes features.</li><li>Edit, clarify, and proofread documents written by others, and coach non-writers on ways to improve their writing skills.</li><li>Work closely with community developers and writers to create quality documentation.</li><li>Travel to meet communities at events and host doc sprints (1-2 trips a quarter).</li></ul><p><em>The Linux Foundation is dedicated to hiring top-notch talent. We are as passionate of providing a flexible and supportive work culture as we are in open source software. Collaboration is in our DNA, and we pride ourselves on being able to work closely together while not being tied to an office. We offer outstanding benefits, including fantastic health care, unlimited PTO, 100% 401k match (up to $18,000), profit-sharing and exceptional healthcare plans.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>North America</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 11:15:02 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_writer",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
